<template>
    <div id="commandment-file" ref="contract"
        style="line-height: 2; width: 100%">
        <section slot="pdf-content" contenteditable="true">
            <div class="col-md-12">
                <div class="info-block">
                    <div style="text-align: right; font-weight: 700; margin-top: 3rem">Приложение  N 6</div>
                    <div style="text-align: right; font-weight: 700">К Приглашению <span style="color: rgb(17, 85, 204);"><span class="getOrgnizeTypeByPlanRu">{{getOrgnizeTypeByPlan}}</span></span></div>
                    <div style="text-align: right; font-weight: 700">Под кодом <span class="contract-code-ru" style="color: rgb(17, 85, 204);">«{{ currentOrganized.translations.code.ru }}»</span></div>
                    <br>
                    <h6 style="margin-top: 3rem; text-align: center; font-weight: 700"> ДОГОВОР ГОСУДАРСТВЕННОЙ ЗАКУПКИ НА ПРЕДОСТАВЛЕНИЕ УСЛУГИ ДЛЯ НУЖД ГОСУДАРСТВА</h6>
                    <h6 style="text-align: center; font-weight: 700">N<span class="contract-code" style="color: rgb(17, 85, 204);"> {{ currentOrganized.translations.code.ru }}</span></h6>
                    <div class="col-md-12 d-flex" style="padding: 0 !important">
                        <table style="width: 100%; border: none !important">
                            <tbody>
                                <tr>
                                    <td style="border:none !important;">
                                        <div style="padding: 0 !important; text-align: left">
                                            <h6>г.<span class="ft-11" style="color: rgb(17, 85, 204);">{{ me.organisation[0].translations.city.ru }}</span></h6>
                                        </div>
                                    </td>
                                    <td>
                                        <div style="padding: 0 !important; text-align: right">
                                            <h6><span style="color: rgb(17, 85, 204);" class="sign-date">__.__.____</span>г.</h6>
                                        </div>
                                    </td>
                                </tr>
                            </tbody>
                        </table>
                    </div>
                    <h6 style="text-align: justify">
                        «<span style="color: rgb(17, 85, 204);">{{ me.organisation[0].translations.name.ru }}</span>», в лице
                        <span style="color: rgb(17, 85, 204);">{{ me.organisation[0].translations.director_name.ru }}</span>, действующего на основании устава
                        «<span style="color: rgb(17, 85, 204);">{{ me.organisation[0].translations.name.ru }}</span>» 
                        (далее — "Заказчик), с одной стороны, и 
                        <span class="winner-name">_______</span>, в лице директора<span class="winner-director">_______</span>, 
                        действующего на основании устава <span class="winner-name">_______</span> (далее — Исполнитель), с другой стороны, заключили настоящий Договор о следующем.
                    </h6>
                </div>
                <div class="info-block">
                    <span style="margin-left: 25px;"/><p style="font-weight: 700;text-align: center">1. ПРЕДМЕТ ДОГОВОРА</p>
                    <h6 style="margin-bottom: 30px; margin-top: 0; text-align: justify"> 
                        <span style="margin-left: 25px;"/>1.1 Заказчик поручает, а Исполнитель принимает обязательство по предоставлению 
                        <editor-input onkeypress="this.style.width = ((this.value.length + 1) * 12 + 5) + 'px';" type="text" inputName="work_names" ref="work_names" v-model="$v.inputs.work_names.$model" />
                        услуг (далее — услуга), согласно требованиям Технической характеристики-графика закупки, установленной Приложением № 1, составляющим неотъемлемую часть настоящего договора (далее — договор).
                        <br/><span style="margin-left: 25px;"/>1.2. Услуга предоставляется в соответствии с установленной Приложением № 1 к договору Технической характеристикой-графиком закупки и в установленные сроки.
                    </h6>
                </div>
                <div class="info-block">
                    <span style="margin-left: 25px;"/><p style="font-weight: 700; text-align: center">2. ПРАВА И ОБЯЗАННОСТИ СТОРОН</p>
                    <h6 style="margin-bottom: 30px; margin-top: 0; text-align: justify;">
                        <span style="margin-left: 25px;"/><span style="font-weight: 700">2.1. Заказчик имеет право:</span>
                        <br/><span style="margin-left: 25px;"/>2.1.1. В любое время проверять ход и качество предоставляемой Исполнителем услуги, без вмешательства в деятельность Исполнителя.
                        <br/><span style="margin-left: 25px;"/>2.1.2. Если предоставлена услуга, не соответствующая Технической характеристике-графику закупки, указанной в Приложении № 1 к договору:
                        <br/><span style="margin-left: 25px;"/>а) Не принимать услугу, с установлением по своему усмотрению разумного срока безвозмездной замены услуги ненадлежащего качества на услугу соответствующего договору качества, и требовать от Исполнителя уплаты штрафа, предусмотренного пунктом 5.2 договора, а также пени, предусмотренной пунктом 5.3 договора;
                        <br/><span style="margin-left: 25px;"/>б) Отказываться от исполнения договора и требовать возврата уплаченной за услугу суммы, а также требовать от Исполнителя уплаты предусмотренного пунктом 5.2 договора штрафа.
                        <br/><span style="margin-left: 25px;"/>2.1.3. В одностороннем порядке расторгать договор, если Исполнитель существенным образом нарушил договор. Нарушение договора Исполнителем считается существенным, если:
                        <br/><span style="margin-left: 25px;"/>а) предоставленная услуга не соответствует требованиям, установленным Приложением № 1 к договору;
                        <br/><span style="margin-left: 25px;"/>б) нарушен срок предоставления услуги.
                    </h6>
                    <span style="margin-left: 25px;"/><span style="font-weight: 700">2.2. Заказчик обязан:</span>
                    <h6 style="margin-bottom: 30px; margin-top: 0;text-align: justify">
                        <span style="margin-left: 25px;"/>2.2.1. Обсуждать и принимать результат услуги, предоставленной в соответствии с Технической характеристикой-графиком закупки, а в случаях выявления недостатков в результате услуги — незамедлительно в письменной форме уведомлять об этом Исполнителя.
                        <br/><span style="margin-left: 25px;"/>2.2.2. В случае приема результата услуги, уплатить Исполнителю суммы, подлежащие уплате последнему, а в случае нарушения срока — также предусмотренную пунктом 5.5 договора пеню.
                    </h6>
                    <span style="margin-left: 25px;"/><span style="font-weight: 700">2.3. Исполнитель имеет право:</span>
                    <h6 style="margin-bottom: 30px; margin-top: 0;text-align: justify">
                        <span style="margin-left: 25px;"/>2.3.1. Требовать от Заказчика подлежащие уплате ему суммы, а в случае нарушения Заказчиком срока, указанного в пункте 4.2 договора — также предусмотренную пунктом 5.5 договора пеню.
                    </h6>
                    <span style="margin-left: 25px;"/><span style="font-weight: 700">2.4. Исполнитель обязан:</span>
                    <h6 style="margin-bottom: 30px; margin-top: 0;text-align: justify">
                        <span style="margin-left: 25px;"/>2.4.1. Обеспечивать предоставление услуги по условиям, установленным Приложением № 1 к договору, руководствуясь действующим законодательством.
                        <br/><span style="margin-left: 25px;"/>2.4.2. В предусмотренных договором случаях уплачивать предусмотренные пунктами 5.2 и 5.3 договора пеню и штраф.
                        <br/><span style="margin-left: 25px;"/>2.4.3. В течение срока действия обеспечений квалификации и договора в случае начала процесса ликвидации или банкротства заранее в письменной форме уведомлять об этом Заказчика.
                        <span style="color: rgb(17, 85, 204);">
                            <br/><span style="margin-left: 25px;"/>2.4.4. При возникновении проектных отклонений в ходе выполнения строительных работ Исполнитель выплачивает Заказчику штраф в размере потерь, возникших в вследствие каждого зафиксированного отклонения. При этом:
                        </span>
                        <span style="color: rgb(17, 85, 204);">
                            <br/><span style="margin-left: 25px;"/>а. отклонением считается выявление в ходе выполнения строительных работ дополнительного объема работ, превышающего десять процентов первоначального проекта, а размер штрафа равен двадцати пяти процентам стоимости работ дополнительного объема,
                        </span>
                        <span style="color: rgb(17, 85, 204);">
                            <br/><span style="margin-left: 25px;"/>б. потерями считаются такие проектные отклонения, которые приводят к изменению фактически выполненных работ (разрушению, реконструкции и т.д.) и к выполнению дополнительных работ, а размер штрафа равен пятидесяти процентам стоимости фактически выполненных работ, приведшим к потере.  
                        </span>
                    </h6>
                </div>
                <div class="info-block">
                    <span style="margin-left: 25px;"/><p style="font-weight: 700;text-align: center">3. ПОРЯДОК СДАЧИ И ПРИЕМКИ УСЛУГИ</p>
                    <h6 style="margin-bottom: 30px; margin-top: 0; text-align: justify">
                        <template v-if="+currentOrganized.organize_type === 1">
                                <span style="margin-left: 25px;"/>Предоставленная услуга принимается подписанием акта сдачи-приемки между Заказчиком и Исполнителем. Факт сдачи услуги Заказчику фиксируется утвержденным в двустороннем порядке документом между Заказчиком и Исполнителем, с указанием даты составления документа.
                                <br/><span style="margin-left: 25px;"/>Включительно до дня, предусмотренного для предоставления услуги по договору, Исполнитель предоставляет Заказчику подписанный им документ, фиксирующий факт сдачи услуги Заказчику (Приложение № 3.1), а посредством системы электронных закупок armeps (пособие по осуществлению действия размещено в разделе "Электронные закупки" интернет-сайта, действующего по адресу: www.procurement.am) — также акт сдачи-приемки (Приложение № 3). При этом Исполнитель не скрепляет печатью акт сдачи-приемки, утверждает электронной подписью, заполняя только те графы, которые относятся к его данным (порядок заполнения размещен в подразделе "Приказы Министра финансов" раздела "Законодательство" интернет-сайта, действующего по адресу: www.procurement.am).
                                <br/><span style="margin-left: 25px;"/>3.2 Если предоставленная услуга соответствует условиям договора, Заказчик в течение
                                <input type="text"
                                    class="editor-input"
                                    v-model="$v.inputs.daysCount.$model"
                                    ref="daysCount"
                                    inputName="daysCount"
                                    style="width: 30px;border-top: 0 !important; border-left: 0 !important; border-right: 0 !important; text-align: right;   
                                    font-size: 13px;
                                    color: #303e67;
                                    border-bottom: 1px solid black"
                                    onkeypress="this.style.width = ((this.value.length + 1) * 8 + 2) + 'px';"
                                />
                                рабочих дней с рабочего дня, следующего за днем получения документов, указанных в пункте 3.1 договора, подписывает и посредством системы электронных закупок armeps предоставляет Исполнителю подписанный им акт сдачи-приемки, а также положительное заключение, послужившее основанием для его подписания.
                                <br/><span style="margin-left: 25px;"/>3.3 Если предоставленная услуга или ее часть не соответствует условиям договора, то Заказчик не подписывает акт сдачи-приемки и в указанный в пункте 3.2 договора срок, посредством системы электронных закупок armeps, возвращает Исполнителю акт сдачи-приемки, а также отрицательное заключение, послужившее основанием для его неподписания. В случае применения настоящего пункта Заказчик предпринимает меры, предусмотренные договором для подобной ситуации и в отношении Исполнителя применяет меры ответственности, предусмотренные договором.
                                <br/><span style="margin-left: 25px;"/>3.4 Если в срок, установленный пунктом 3.2 договора, Заказчик не принимает предоставленной услуги или не отказывается принимать ее, то предоставленная услуга считается принятой, и на следующий рабочий день после установленного пунктом 3.2 договора окончательного срока Заказчик посредством системы электронных закупок предоставляет Исполнителю подписанный им акт сдачи-приемки.
                        </template>

                        <template v-else>
                                <span style="margin-left: 25px;"/>3.1 Предоставленная услуга принимается подписанием акта сдачи-приемки между Заказчиком и Исполнителем. Факт сдачи услуги Заказчику фиксируется утвержденным в двустороннем порядке документом между Заказчиком и Исполнителем, с указанием даты составления документа. 
                                <br/><span style="margin-left: 25px;"/>
                                Включительно до дня, предусмотренного для предоставления услуги по договору, Исполнитель предоставляет Заказчику подписанный им документ, фиксирующий факт сдачи услуги Заказчику (Приложение № 3.1) и
                                <input type="text"
                                    v-model="$v.inputs.copyCount.$model"
                                    ref="copyCount"
                                    inputName="copyCount"
                                    class="editor-input"
                                    style="width: 30px;border-top: 0 !important; border-left: 0 !important; border-right: 0 !important; text-align: right;   
                                    font-size: 13px;
                                    color: #303e67;
                                    border-bottom: 1px solid black" 
                                    onkeypress="this.style.width = ((this.value.length + 1) * 8 + 2) + 'px';"
                                />
                                экземпляр акта сдачи-приемки (Приложение № 3).
                                <br/><span style="margin-left: 25px;"/>3.2 Акт сдачи-приемки подписывается, если предоставленная услуга соответствует условиям договора. В противном случае результаты исполнения договора или его части не принимаются, акт сдачи-приемки не подписывается и Заказчик:
                                <br/><span style="margin-left: 25px;"/>а) для урегулирования вопроса предпринимает меры, предусмотренные договором для подобной ситуации;
                                <br/><span style="margin-left: 25px;"/>б) в отношении Исполнителя применяет меры ответственности, предусмотренные договором.
                                <br/><span style="margin-left: 25px;"/>
                                3.3. Заказчик в течение
                                <input type="text"
                                    class="editor-input"
                                    v-model="$v.inputs.daysCount.$model"
                                    ref="daysCount"
                                    inputName="daysCount"
                                    style="width: 30px;border-top: 0 !important; border-left: 0 !important; border-right: 0 !important; text-align: right;   
                                    font-size: 13px;
                                    color: #303e67;
                                    border-bottom: 1px solid black"
                                    onkeypress="this.style.width = ((this.value.length + 1) * 8 + 2) + 'px';"
                                />
                                рабочих дней с рабочего дня, следующего за днем получения акта сдачи-приемки представляет Исполнителю один экземпляр подписанного им акта сдачи-приемки либо мотивированное отклонение непринятия услуги.
                                <br/><span style="margin-left: 25px;"/>3.4. Если в срок, установленный пунктом 3.3 договора, Заказчик не принимает предоставленной услуги или не отказывается принимать ее, то предоставленная услуга считается принятой, и на следующий рабочий день после установленного пунктом 3.3 договора окончательного срока Заказчик предоставляет Исполнителю утвержденный им акт сдачи-приемки.
                        </template>
                    </h6>
                </div>
                <div class="info-block">
                    <span style="margin-left: 25px;"/><p style="font-weight: 700;text-align: center">4. ЦЕНА ДОГОВОРА</p>
                    <h6 style="margin-bottom: 30px; margin-top: 0; text-align: justify">
                        <span style="margin-left: 25px;"/>4.1. Цена подлежащей предоставлению Исполнителем услуги по настоящему договору составляет <span class="contract-price">_______</span> (<span class="contract-price-word">__прописью____________</span>) драмов РА, включая НДС.
                        <br/><span style="margin-left: 25px;"/>Цена включает все осуществляемые Исполнителем расходы, в том числе налоги, пошлины и установленные законодательством Республики Армения иные платежи.
                        Цена предоставления услуги стабильна, и Исполнитель не вправе требовать увеличения, а Заказчик — снижения этой цены.
                        <template v-if="+currentOrganized.prepayment">
                            <br/><span style="margin-left: 25px;"/> 4.1.1 Заказчик перечисляет сумму в размере до {{ currentOrganized.prepayment_max }}  драмов Республики Армения от цены договора на банковский счет Исполнителя в качестве предоплаты. Погашение предоплаты осуществляется в форме уменьшений (удержаний) из выплат, производимых на основании актов сдачи-приемки. При этом до полного погашения предоплаты платежи Исполнителю не производятся 19.
                        </template>
                        <br/><span style="margin-left: 25px;"/>4.2 Заказчик платит за предоставленную ему услугу в драмах Республики Армения, в безналичной форме, путем перечисления денежных средств на расчетный счет Исполнителя. Перечисление денежных средств производится на основании акта сдачи-приемки в течение месяцев, предусмотренных графиком оплаты договора (Приложение № 2), но не позднее чем до ---- ого декабря данного года. 
                        <br/><span style="margin-left: 25px;"/>При этом, с целью совершения платежа, заказчик в течение 3 рабочих дней со дня подписания протокола передачи-приема вносит платежное поручение и копию протокола передачи-приема в казначейскую систему уполномоченного органа, а на основании документов, представленных согласно установленному порядку, уполномоченный орган в случае поступления в казначейскую систему протокола передачи-приема производит данный платеж в сроки, установленные графиком օплаты настоящего Договора, в течение пяти рабочих дней.  
                        <br/><span style="margin-left: 25px;"/>При этом оплата за закупку осуществляется в срок, установленный графиком oплаты настоящего Договора, в течение пяти рабочих дней. 
                        <template v-if="currentOrganized.repair_services">
                            <br/><span style="margin-left: 25px;"/>В случае закупок услуг по ремонту автомобилей, устройств и оборудования, выплаты за услуги, предоставляемые в рамках заключаемого договора, осуществляются по следующей формуле՝ ВС= ЦУ/СЦxУxК
                            <br/><span style="margin-left: 25px;"/>ВС-сумма, выплачиваемая за оказание отдельных видов услуг, установленных договором;
                            <br/><span style="margin-left: 25px;"/>ЦУ -итоговая цена, предложенная отобранным участником:
                            <br/><span style="margin-left: 25px;"/>СЦ- совокупность максимальных единиц цен, установленных для оказания услуги:
                            <br/><span style="margin-left: 25px;"/>У-цена на максимальную единицу предоставленной услуги
                            <br/><span style="margin-left: 25px;"/>К-количество предоставленных услуг.
                        </template>
                    </h6>
                </div>
                <div class="info-block">
                    <span style="margin-left: 25px;"/><p style="font-weight: 700;text-align: center">5. ОТВЕТСТВЕННОСТЬ СТОРОН</p>
                    <h6 style="margin-bottom: 30px; margin-top: 0; text-align: justify">
                        <span style="margin-left: 25px;"/>5.1. Исполнитель несет ответственность за соблюдение требований договора к предоставлению услуги.
                        <br/><span style="margin-left: 25px;"/>5.2
                        <template v-if="!currentOrganized.is_with_condition">
                            В каждом случае предоставления услуги, не соответствующей указанной в Приложении № 1 к договору технической характеристике, с Исполнителя взимается штраф в размере 0,5 (ноль целых пять десятых) процента от суммы, предусмотренной в пункте 4.1 договора.
                        </template>
                        <template v-else>
                            В каждом случае предоставления услуги, не соответствующей указанной в Приложении № 1 к договору технической характеристике, с Исполнителя взимается штраф в размере 0,5 (ноль целых пять десятых) процента от суммы, предусмотренной в пункте 4.1 договора.
                            <br/><span style="margin-left: 25px;"/>При заключении Договора на основании пункта 6 статьи 15 Закона Республики Армения "О закупках", штраф исчисляется по отношению к цене соглашения, в рамках которого зафиксировано обстоятельство неисполнения или ненадлежащего исполнения взятых на себя обязательств.
                            <br/><span style="margin-left: 25px;"/>Если договор включает в себя больше одного лота, то штраф исчисляется в отношении общей цены, установленной договором на этот лот.
                        </template>
                        При этом штраф рассчитывается также в случае предоставления услуги в срок, установленный настоящим договором, но в случае их непринятия заказчиком.
                        <br/><span style="margin-left: 25px;"/>5.3. В случае нарушения предусмотренного договором срока предоставления услуги с Исполнителя за каждый просроченный рабочий день взимается пеня в размере 0,05 (ноль целых пять сотых) процента от цены подлежащей предоставлению, но не предоставленной услуги.
                        <br/><span style="margin-left: 25px;"/>5.4. Предусмотренные пунктами 5.2 и 5.3 договора штраф и пеня исчисляются и зачитываются вместе с суммами, подлежащими уплате Исполнителю в результате предоставления услуги.
                        <br/><span style="margin-left: 25px;"/>5.5. За нарушение Заказчиком предусмотренного пунктом 4.2 договора срока, в отношении Заказчика за каждый просроченный рабочий день исчисляется пеня в размере 0,05 (ноль целых пять сотых) процента от подлежащей уплате, но не уплаченной суммы.
                        <br/><span style="margin-left: 25px;"/>5.6. В непредусмотренных договором случаях за неисполнение или ненадлежащее исполнение своих обязательств стороны несут ответственность в порядке, установленном законодательством Республики Армения.
                        <br/><span style="margin-left: 25px;"/>5.7. Уплата пеней и (или) штрафов не освобождает стороны от полного исполнения своих договорных обязательств.
                    </h6>
                </div>
                <div class="info-block">
                    <span style="margin-left: 25px;"/><p style="font-weight: 700;text-align: center">6. ДЕЙСТВИЕ НЕПРЕОДОЛИМОЙ СИЛЫ (ФОРС-МАЖОР)</p>
                    <h6 style="margin-bottom: 30px; margin-top: 0; text-align: justify">
                        <span style="margin-left: 25px;"/>Стороны освобождаются от ответственности за полное или частичное неисполнение обязательств по настоящему Договору и соглашениям, заключенным на основании настоящего Договора, если это явилось следствием действия непреодолимой силы, которая возникла после заключения настоящего Договора, и которую стороны не могли предусмотреть или предотвратить. Такими ситуациями являются землетрясение, наводнение, пожар, война, объявление военного и чрезвычайного положения, политические волнения, забастовки, прекращение работ средств коммуникации, акты государственных органов и т. д., которые делают невозможным исполнение обязательств по настоящему Договору. Если действие чрезвычайной силы длится более 3 (трех) месяцев, то каждая из сторон имеет право расторгнуть договор, предварительно уведомив об этом другую сторону.
                    </h6>
                </div>
                <div class="info-block">
                    <span style="margin-left: 25px;"/><p style="font-weight: 700;text-align: center">7. ИНЫЕ УСЛОВИЯ</p>
                    <h6 style="margin-bottom: 30px; margin-top: 0; text-align: justify">
                        <span style="margin-left: 25px;"/>7.1. Договор вступает в силу с момента его подписания сторонами и действует до выполнения в полном объеме принятых сторонами по Договору обязательств.
                        <template v-if="currentOrganized.rights_responsibilities_fulfillment">
                            <br/><span style="margin-left: 25px;"/>Условием исполнения сторонами прав и обязанностей, предусмотренных договором, является обстоятельство учета договора Министерством финансов Республики Армения.
                        </template>
                        <br/><span style="margin-left: 25px;"/>7.2. Возникающее из договора платежное обязательство стороны не может прекратиться зачетом встречного обязательства, возникающего из другого договора, без письменного и утвержденного печатью соглашения сторон. Право требования, вытекающее из договора, не может быть передано другому лицу без письменного согласия стороны должника.
                        <br/><span style="margin-left: 25px;"/>7.3. В том случае, когда в установленном законом порядке в результате контроля либо надзора или рассмотрения жалоб в отношении выполнения требований закона констатируется, что в процессе закупки Исполнитель до заключения договора представил поддельные документы (сведения и данные), или решение о признании последнего отобранным участником не соответствует законодательству Республики Армения, то после выявления данных оснований Заказчик имеет право расторгнуть договор в одностороннем порядке, если выявленные нарушения, в случае если бы о них стало известно до заключения договора, послужили бы основанием для не заключения договора согласно законодательству Республики Армения о закупках. При этом Заказчик не несет риска убытков или упущенной выгоды, возникающих для Исполнителя в результате одностороннего расторжения договора, а последний обязан в порядке, установленном законодательством Республики Армения, возместить понесенные по его вине убытки Заказчика в том объеме, по части которого был расторгнут договор.
                        <br/><span style="margin-left: 25px;"/>7.4. Споры в связи с договором подлежат рассмотрению в судах Республики Армения.
                        <br/><span style="margin-left: 25px;"/>7.5. Изменения и дополнения могут быть внесены в договор исключительно с взаимного согласия сторон – посредством заключения соглашения, которое будет являться неотъемлемой частью договора.
                        <br/><span style="margin-left: 25px;"/>Запрещается внесение в договор, а если цена договора факторная, то также в соглашение к данному договору, заключаемое в каждом последующем году, таких изменений, которые приводят к искусственному изменению объемов закупаемой услуги или цены единицы приобретаемой услуги или цены договора.
                        <br/><span style="margin-left: 25px;"/>Каждый случай изменения договора под воздействием не зависящих от сторон договора факторов устанавливает Правительство Республики Армения.
                        <div class="is-agency-agreement">
                            <span style="color: rgb(17, 85, 204);">
                                <span style="margin-left: 25px;"/>7.6. Если договор осуществляется посредством заключения агентского договора:
                            </span>
                            <p style="color: rgb(17, 85, 204); margin: 0;">
                                <span style="margin-left: 25px;"/>1) Исполнитель несет ответственность за неисполнение или ненадлежащее исполнение обязательств агента;
                            </p>
                            <p style="color: rgb(17, 85, 204); margin: 0;">
                                <span style="margin-left: 25px;"/>2) в случае замены агента в течение исполнения договора Исполнитель в письменной форме уведомляет об этом Заказчика, предоставив копии агентского договора и данных являющегося его стороной лица в течение пяти рабочих дней со дня внесения изменения.
                            </p>
                            <p style="color: rgb(17, 85, 204); margin: 0;">
                                <span style="margin-left: 25px;"/>7.7. Если договор осуществляется посредством заключения договора о совместной деятельности (договора консорциума), то участники этого договора несут совместную и солидарную ответственность. При этом в случае выхода члена консорциума из консорциума договор расторгается в одностороннем порядке, и в отношении членов консорциума применяются предусмотренные договором меры ответственности.
                            </p>
                        </div>
                        <br/><span style="margin-left: 25px;"/>7.8. При наличии предложения от Исполнителя, срок предоставления услуги может быть продлен до истечения данного срока по договору, при условии, что у Заказчика не отпало требование в пользовании услугой, а предложение Исполнителя было представлено не позднее пяти календарных дней до истечения срока, изначально установленного договором для предоставления услуг.. При этом в установленном настоящим пунктом случае срок предоставления услуги может быть продлен один раз на срок до 30 календарных дней, но не более чем на срок, установленный договором.
                        <br/><span style="margin-left: 25px;"/>7.9. В условиях надлежащего исполнения договора, выгода (сбережения) или понесенные убытки сторон (Исполнителя или Заказчика) — это выгода или убытки, понесенные данной стороной.
                        <br/><span style="margin-left: 25px;"/>Обязательства сторон договора по отношению к третьим лицам, включая иные сделки, заключенные Исполнителем в рамках исполнения договора, и вытекающие из них обязательства, находятся вне поля урегулирования договора и не могут влиять на принятие результата исполнения договора. Отношения, связанные с выполнением данных сделок и вытекающих из них обязательств, регулируются нормами, регулирующими отношения, связанные с данными сделками, и за них ответственен Исполнитель.
                        <br/><span style="margin-left: 25px;"/>7.10. Договор не может быть изменен вследствие частичного неисполнения обязательств сторонами или полностью расторгнут по взаимному согласию сторон, за исключением случаев уменьшения финансовых ассигнований, необходимых для предоставления услуги в порядке, установленном законодательством Республики Армения. При этом взаимное согласие сторон договора по частичному неисполнению обязательств или полному расторжению договора должно быть достигнуто до уменьшения финансовых ассигнований, необходимых для предоставления услуги в порядке, установленном законодательством Республики Армения.
                        <br/><span style="margin-left: 25px;"/>7.11. Уведомление относительно полного или частичного одностороннего расторжения договора на основании неисполнения или ненадлежащего исполнения обязательств, принятых на себя Исполнителем, Заказчик опубликовывает в разделе "Уведомления об одностороннем расторжении договоров" на интернет сайте, действующем по адресу www.procurement.am, с указанием даты опубликования. Исполнитель считается надлежащим образом уведомленным относительно одностороннего расторжения договора со следующего за опубликованием уведомления дня, установленного настоящим пунктом. В день публикации в бюллетене уведомления о полном или частичном одностороннем расторжении договора Заказчик высылает его также на электронную почту Исполнителя.
                        <br/><span style="margin-left: 25px;"/>7.12. Споры, возникшие в связи с настоящим Договором, разрешаются путем переговоров. В случае недостижения согласия споры разрешаются в судах Республики Армения.
                        <br/><span style="margin-left: 25px;"/>7.13 Настоящий Договор составлен на <span class="pages-count">__</span> страницах, заключается в двух экземплярах, имеющих равную юридическую силу. Приложения № 1, № 2, № 3 и № 3.1 к настоящему Договору считаются неотъемлемой частью договора, и каждой стороне предоставляется по одному экземпляру договора.
                        <br/><span style="margin-left: 25px;"/>7.14. В отношении настоящего Договора применяется право Республики Армения.
                        <template v-if="currentOrganized.is_with_condition">
                            <span v-if="total > 25000000">
                                <br/><span style="margin-left: 25px;"/>7.15. Предоставление предусмотренных договором услуг осуществляется при наличии предусмотренных для этой цели финансовых средств и посредством заключения на данном основании соответствующего соглашения между сторонами. Договор расторгается, если в течение шести месяцев, следующих за днем его заключения, финансовые средства в целях его исполнения не предусматриваются. Если размер выделенных для исполнения договора финансовых средств превышает двадцатипятикратный размер базовой единицы закупок, то Заказчиком будет заключенo соглашение в случае, если представленное Исполнителем в виде неустойки обеспечений квалификации и договора в размере предусмотренных финансовых средств заменяется гарантией или наличными деньгами, с учетом требований абзаца "б" подпункта 17 пункта 32 Приложения № 1 к Постановлению Правительства Республики Армения № 526-N от 4 мая 2017 года. При этом Исполнитель заключает соглашение, а при замене обеспечений квалификации и договора представленных в виде неустойки, также представляет Заказчику новые обеспечения в течение пятнадцати рабочих дней со дня получения извещения о заключении соглашения. В противном случае договор расторгается Заказчиком в одностороннем порядке.
                            </span>
                            <span v-else>
                                <br/><span style="margin-left: 25px;"/>7.15. Предоставление предусмотренных договором услуг осуществляется при наличии предусмотренных для этой цели финансовых средств и посредством заключения на данном основании соответствующего соглашения между сторонами. Договор расторгается, если в течение шести месяцев, следующих за днем его заключения, финансовые средства в целях его исполнения не предусматриваются.  При этом Исполнитель заключает соглашение и представляет Заказчику новые обеспечения в течение пятнадцати рабочих дней со дня получения извещения о заключении соглашения. В противном случае договор расторгается Заказчиком в одностороннем порядке.
                            </span>
                        </template>
                    </h6>
                </div>
		        <div class="html2pdf__page-break"/>
                <div class="info-block">
                    <h6 style="margin-top: 3rem; text-align: center; font-weight: 700">
                        8. АДРЕСА, БАНКОВСКИЕ РЕКВИЗИТЫ И ПОДПИСИ СТОРОН
                    </h6>
                    <div class="info-block" style="padding: 60px 0">
                        <table style="width: 100%; border: none !important">
                            <tbody>
                                <tr>
                                    <td style="width: 50%">
                                        <div style="text-align: center">
                                            <h6 class="ft-11" style="font-weight: 700">ПОКУПАТЕЛЬ</h6>
                                            <p class="ft-11" style="font-size: 14px;">" {{ me.organisation[0].translations.name.ru }} " {{ me.organisation[0].translations.company_type.ru }}</p>                                      
                                            <p class="ft-11" style="font-size: 14px;" v-if="me.organisation[0].translations.region.ru === me.organisation[0].translations.city.ru">{{ me.organisation[0].translations.city.ru }} {{ me.organisation[0].translations.address.ru }}</p>
                                            <p class="ft-11" style="font-size: 14px;" v-else>{{ me.organisation[0].translations.region.ru }} {{ me.organisation[0].translations.city.ru }} {{ me.organisation[0].translations.address.ru }}</p>
                                            <p class="ft-11" style="font-size: 14px;">Банк: {{ me.organisation[0].translations.bank_name.ru }}</p>
                                            <p class="ft-11" style="font-size: 14px;">Н/С {{ me.organisation[0].bank_account }} </p>
                                            <p class="ft-11" style="font-size: 14px;">ИНН {{ me.organisation[0].tin }} </p>
                                            <p class="ft-11" style="font-size: 14px;">{{ me.organisation[0].translations.director_position.ru }}: {{ me.organisation[0].translations.director_name.ru }}</p>                                          
                                            <p class="ft-11" style="font-size: 14px;">______________________</p>
                                            <p style="font-size: 8px; margin-top: -20px; color: gray; margin-bottom: 35px;">/подпись/</p>
                                            <p style="font-size: 14px; text-align: center">М. П.</p>
                                        </div>
                                    </td>
                                    <td style="width: 50%">
                                        <div style="text-align: center">
                                            <h6 class="ft-11" style="font-weight: 700">ПРОДАВЕЦ</h6>
                                            <p class="ft-11" style="font-size: 14px;"> " <span class="winner-name">______________</span> " <span class="winner-type">_______</span></p>
                                            <p class="ft-11" style="font-size: 14px;"><span class="winner-address">_____________________</span></p>
                                            <p class="ft-11" style="font-size: 14px;">Банк:<span class="winner-bank">___________</span></p>
                                            <p class="ft-11" style="font-size: 14px;">Н/С <span class="winner-bank_account">_____________________</span></p>
                                            <p class="ft-11" style="font-size: 14px;">ИНН <span class="winner-tin">______________</span></p>
                                            <p class="ft-11" style="font-size: 14px;">Директор: <span class="winner-director">_____________________</span></p>
                                            <p class="ft-11" style="font-size: 14px;">______________________</p>
                                            <p style="font-size: 8px; margin-top: -20px; color: gray; margin-bottom: 35px;">/подпись/</p>
                                            <p style="font-size: 14px; text-align: center">М. П.</p>
                                        </div>
                                    </td>
                                </tr>
                            </tbody>
                        </table>
                    </div>
                    <h6 style="text-align: center">
                        В случае необходимости в договор могут быть включены не противоречащие законодательству Республики Армения положения.
                    </h6>
                </div>
		        <div class="html2pdf__page-break"/>
                <div class="info-block">
                    <div style="text-align: right; font-weight: 700">Приложение N 1</div>
                    <div style="text-align: right; font-weight: 700">К Договору под кодом <span class="contract-code-ru" style="color: rgb(17, 85, 204);"></span></div>
                    <div style="text-align: right; font-weight: 700">Заключенному <span class="sign-date">"  	 "    	20_ </span>г.</div> 
                    <br/>
                    <div style="text-align: center">ТЕХНИЧЕСКАЯ ХАРАКТЕРИСТИКА-ГРАФИК ЗАКУПКИ*</div>
                    <br/>
                    <table style="font-size: 10px;
                                    width: 100%;
                                    table-layout: fixed;
                                    border-collapse: collapse;
                                    page-break-inside: avoid;
                                    border: 1px solid black;
                                    text-align: center;" cellspacing="5" cellpadding="5" class="ft-5">
                        <tbody>
                            <tr>
                                <th colspan="8" style="border: 1px solid black;
                                                       border-collapse: collapse;">Услуги</th>
                            </tr>
                            <tr>
                                <th rowspan="2" style="border: 1px solid black;
                                                       border-collapse: collapse;">Н/Л</th>
                                <th rowspan="2" style="border: 1px solid black;
                                                       border-collapse: collapse;">(CPV) код</th>
                                <th rowspan="2" style="border: 1px solid black;
                                                       border-collapse: collapse;">техническая характеристика</th>
                                <th rowspan="2" style="border: 1px solid black;
                                                       border-collapse: collapse;">единица измерения</th>
                                <th rowspan="2" style="border: 1px solid black;
                                                       border-collapse: collapse;">общая цена/драмов РА</th>
                                <th rowspan="2" style="border: 1px solid black;
                                                       border-collapse: collapse;">общий объем</th>
                                <th colspan="2" style="border: 1px solid black;
                                                       border-collapse: collapse;">предоставления</th>	
                            </tr>
                            <tr>	
                                <th style="border: 1px solid black;
                                           border-collapse: collapse;">адрес</th>
                                <th style="border: 1px solid black;
                                           border-collapse: collapse;">срок**</th>
                            </tr>
                        </tbody>
                        <tbody id="services-table-body" class="purchase-schedule">
                            <tr v-for="(row, rowIndex) in currentOrganized.organize_rows" :key="rowIndex">
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{ row.view_id }}</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{ row.procurement_plan.cpv.code }}{{ row.procurement_plan.cpv_drop && '/' }}{{ row.procurement_plan.cpv_drop }}</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{row.procurement_plan.specifications.description.ru}}</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{ row.procurement_plan.cpv.unit_ru }}</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">
                                    <!-- {{ row.procurement_plan.details[0].unit_amount * row.count }} -->
                                </td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">
                                    {{ row.count }}
                                </td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"
                                    v-if="me.organisation[0].translations.region.ru === me.organisation[0].translations.city.ru">
                                Г.
                                    {{ me.organisation[0].translations.city.ru }}
                                    {{ me.organisation[0].translations.address.ru }}
                                </td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"
                                    v-else>
                                    {{ me.organisation[0].translations.region.ru }}

                                    

                                    {{ me.organisation[0].translations.city.ru }}
                                    {{ me.organisation[0].translations.address.ru }}
                                </td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                            </tr>
                        </tbody>
                    </table>
                    <h6 style="margin-top: 3rem; text-align: left">
                        * Oкончательный срок предоставления услуги не может быть позднее 25 декабря данного года.
                    </h6>
                    <h6 style="text-align: left;">
                        <span style="color: rgb(17, 85, 204);">** Если договор заключается на основании части 6 статьи 15 Закона РА "О закупках", то в графе исчисление срока осуществляется со дня вступления в силу заключаемого между сторонами соглашения в случае предусмотрения финансовых средств.</span>
                    </h6>
                    <div class="info-block" style="padding: 60px 0">
                        <table style="width: 100%; border: none !important">
                            <tbody>
                                <tr>
                                    <td style="width: 50%">
                                        <div style="text-align: center">
                                            <h6 class="ft-11"  style="font-weight: 700">ПОКУПАТЕЛЬ</h6>
                                            <p class="ft-11" style="font-size: 14px;">" {{ me.organisation[0].translations.name.ru }} " {{ me.organisation[0].translations.company_type.ru }}</p>
                                            <p class="ft-11" style="font-size: 14px;" v-if="me.organisation[0].translations.region.ru === me.organisation[0].translations.city.ru">{{ me.organisation[0].translations.city.ru }} {{ me.organisation[0].translations.address.ru }}</p>
                                            <p class="ft-11" style="font-size: 14px;" v-else>{{ me.organisation[0].translations.region.ru }} {{ me.organisation[0].translations.city.ru }} {{ me.organisation[0].translations.address.ru }}</p>
                                            <p class="ft-11" style="font-size: 14px;">Банк: {{ me.organisation[0].translations.bank_name.ru }}</p>
                                            <p class="ft-11" style="font-size: 14px;">Н/С {{ me.organisation[0].bank_account }} </p>
                                            <p class="ft-11" style="font-size: 14px;">ИНН {{ me.organisation[0].tin }} </p>
                                            <p class="ft-11" style="font-size: 14px;">{{ me.organisation[0].translations.director_position.ru }}: {{ me.organisation[0].translations.director_name.ru }}</p>
                                            <p class="ft-11" style="font-size: 14px;">______________________</p>
                                            <p style="font-size: 8px; margin-top: -20px; color: gray; margin-bottom: 35px;">/подпись/</p>
                                            <p style="font-size: 14px; text-align: center">М. П.</p>
                                        </div>
                                    </td>
                                    <td style="width: 50%">
                                        <div style="text-align: center">
                                            <h6 class="ft-11" style="font-weight: 700">ПРОДАВЕЦ</h6>
                                            <p class="ft-11" style="font-size: 14px;"> " <span class="winner-name">______________</span> " <span class="winner-type">_______</span></p>
                                            <p class="ft-11" style="font-size: 14px;"><span class="winner-address">_____________________</span></p>
                                            <p class="ft-11" style="font-size: 14px;">Банк:<span class="winner-bank">___________</span></p>
                                            <p class="ft-11" style="font-size: 14px;">Н/С <span class="winner-bank_account">_____________________</span></p>
                                            <p class="ft-11" style="font-size: 14px;">ИНН <span class="winner-tin">______________</span></p>
                                            <p class="ft-11" style="font-size: 14px;">Директор: <span class="winner-director">_____________________</span></p>
                                            <p style="font-size: 14px;">______________________</p>
                                            <p style="font-size: 8px; margin-top: -20px; color: gray; margin-bottom: 35px;">/подпись/</p>
                                            <p style="font-size: 14px; text-align: center">М. П.</p>
                                        </div>
                                    </td>
                                </tr>
                            </tbody>
                        </table>
                    </div>
                </div>
		        <div class="html2pdf__page-break"/>
                <div class="info-block">
                    <div style="text-align: right; font-weight: 700">Приложение N 2</div>
                    <div style="text-align: right; font-weight: 700">К Договору под кодом <span class="contract-code-ru" style="color: rgb(17, 85, 204);"></span></div>
                    <div style="text-align: right; font-weight: 700">Заключенному <span class="sign-date">"  	 "    	20_ </span>г.</div> 
                    <br/>
                    <div style="text-align: center; font-weight: 700">ГРАФИК ОПЛАТЫ*</div>
                    <br/>
                    <table style="font-size: 10px;
                                width: 100%;
                                table-layout: fixed;
                                border-collapse: collapse;
                                page-break-inside: avoid;
                                border: 1px solid black;
                                text-align: center;" cellspacing="4" cellpadding="4" class="ft-5"> 
                        <tbody>
                        <tr>
                                <th colspan="16" style="border: 1px solid black;
                                                        border-collapse: collapse;">Услуги</th>
                            </tr>
                            <tr>
                                <th rowspan="2" style="border: 1px solid black;
                                                       border-collapse: collapse;">Н/Л</th>
                                <th rowspan="2" style="border: 1px solid black;
                                                       border-collapse: collapse;">(CPV) код</th>
                                <th rowspan="2" style="border: 1px solid black;
                                                       border-collapse: collapse;">наименование</th>
                                <th colspan="13" style="border: 1px solid black;
                                                        border-collapse: collapse;">Оплату услуги предусматривается произвести в 20.        	г., по месяцам, в том числе**</th>
                            </tr>
                            <tr>
                                <th style="border: 1px solid black;
                                           writing-mode: vertical-lr;
                                           border-collapse: collapse;">январь</th>
                                <th style="border: 1px solid black;
                                           writing-mode: vertical-lr;
                                           border-collapse: collapse;">февраль</th>
                                <th style="border: 1px solid black;
                                           writing-mode: vertical-lr;
                                           border-collapse: collapse;">март</th>
                                <th style="border: 1px solid black;
                                           writing-mode: vertical-lr;
                                           border-collapse: collapse;">апрель</th>
                                <th style="border: 1px solid black;
                                           writing-mode: vertical-lr;
                                           border-collapse: collapse;">май</th>
                                <th style="border: 1px solid black;
                                           writing-mode: vertical-lr;
                                           border-collapse: collapse;">июнь</th>
                                <th style="border: 1px solid black;
                                           writing-mode: vertical-lr;
                                           border-collapse: collapse;">июль</th>
                                <th style="border: 1px solid black;
                                           writing-mode: vertical-lr;
                                           border-collapse: collapse;">август</th>
                                <th style="border: 1px solid black;
                                           writing-mode: vertical-lr;
                                           border-collapse: collapse;">сентябрь</th>
                                <th style="border: 1px solid black;
                                           writing-mode: vertical-lr;
                                           border-collapse: collapse;">октябрь</th>
                                <th style="border: 1px solid black;
                                           writing-mode: vertical-lr;
                                           border-collapse: collapse;">ноябрь</th>
                                <th style="border: 1px solid black;
                                           writing-mode: vertical-lr;
                                           border-collapse: collapse;">декабрь</th>
                                <th style="border: 1px solid black;
                                           writing-mode: vertical-lr;
                                           border-collapse: collapse;">Всего</th>
                            </tr>
                        </tbody>
                        <tbody class="payment-schedule">
                                <tr v-for="(row, rowIndex) in currentOrganized.organize_rows" :key="rowIndex">
                                    <td style="border: 1px solid black;
                                               border-collapse: collapse;
                                               text-align: center;">{{ rowIndex + 1 }}</td>
                                    <td style="border: 1px solid black;
                                               border-collapse: collapse;
                                               text-align: center;">{{ row.procurement_plan.cpv.code }}{{ row.procurement_plan.cpv_drop && '/' }}{{ row.procurement_plan.cpv_drop }}</td>
                                    <td style="border: 1px solid black;
                                               border-collapse: collapse;
                                               text-align: center;">{{ row.procurement_plan.cpv.name_ru }}</td>
                                    <template v-if="row.organize_row_percent">
                                        <td style="border: 1px solid black;
                                                   border-collapse: collapse;
                                                   text-align: center;">{{ row.organize_row_percent.month_1 !== null ? row.organize_row_percent.month_1 + '%'  : '-' }}</td>
                                        <td style="border: 1px solid black;
                                                   border-collapse: collapse;
                                                   text-align: center;">{{ row.organize_row_percent.month_2 !== null ? row.organize_row_percent.month_2 + '%'  : '-' }}</td>
                                        <td style="border: 1px solid black;
                                                   border-collapse: collapse;
                                                   text-align: center;">{{ row.organize_row_percent.month_3 !== null ? row.organize_row_percent.month_3 + '%'  : '-' }}</td>
                                        <td style="border: 1px solid black;
                                                   border-collapse: collapse;
                                                   text-align: center;">{{ row.organize_row_percent.month_4 !== null ? row.organize_row_percent.month_4 + '%'  : '-' }}</td>
                                        <td style="border: 1px solid black;
                                                   border-collapse: collapse;
                                                   text-align: center;">{{ row.organize_row_percent.month_5 !== null ? row.organize_row_percent.month_5 + '%'  : '-' }}</td>
                                        <td style="border: 1px solid black;
                                                   border-collapse: collapse;">{{ row.organize_row_percent.month_6 !== null ? row.organize_row_percent.month_6 + '%'  : '-' }}</td>
                                        <td style="border: 1px solid black;
                                                   border-collapse: collapse;">{{ row.organize_row_percent.month_7 !== null ? row.organize_row_percent.month_7 + '%'  : '-' }}</td>
                                        <td style="border: 1px solid black;
                                                   border-collapse: collapse;">{{ row.organize_row_percent.month_8 !== null ? row.organize_row_percent.month_8 + '%'  : '-' }}</td>
                                        <td style="border: 1px solid black;
                                                   border-collapse: collapse;">{{ row.organize_row_percent.month_9 !== null ? row.organize_row_percent.month_9 + '%'  : '-' }}</td>
                                        <td style="border: 1px solid black;
                                                   border-collapse: collapse;">{{ row.organize_row_percent.month_10 !== null ? row.organize_row_percent.month_10 + '%'  : '-' }}</td>
                                        <td style="border: 1px solid black;
                                                   border-collapse: collapse;">{{ row.organize_row_percent.month_11 !== null ? row.organize_row_percent.month_11 + '%'  : '-' }}</td>
                                        <td style="border: 1px solid black;
                                                   border-collapse: collapse;">{{ row.organize_row_percent.month_12 !== null ? row.organize_row_percent.month_12 + '%'  : '-' }}</td>
                                        <td v-if="row.organize_row_percent.month_1 === null && row.organize_row_percent.month_2 === null && row.organize_row_percent.month_3 === null && row.organize_row_percent.month_4 === null && row.organize_row_percent.month_5 === null && row.organize_row_percent.month_6 === null && row.organize_row_percent.month_7 === null && row.organize_row_percent.month_8 === null && row.organize_row_percent.month_9 === null && row.organize_row_percent.month_10 === null && row.organize_row_percent.month_11 === null && row.organize_row_percent.month_12 === null" 
                                        style="border: 1px solid black;
                                               border-collapse: collapse;">-</td>
                                        <td v-else style="border: 1px solid black;
                                                          border-collapse: collapse;"> 100% </td>    
                                    </template>
                                    <template v-else>
                                        <td style="padding: 20px;
                                                   border: 1px solid black;
                                                   border-collapse: collapse;"></td>
                                        <td style="padding: 20px;
                                                   border: 1px solid black;
                                                   border-collapse: collapse;"></td>
                                        <td style="padding: 20px;
                                                   border: 1px solid black;
                                                   border-collapse: collapse;"></td>
                                        <td style="padding: 20px;
                                                   border: 1px solid black;
                                                   border-collapse: collapse;"></td>
                                        <td style="padding: 20px;
                                                   border: 1px solid black;
                                                   border-collapse: collapse; "></td>
                                        <td style="padding: 20px;
                                                   border: 1px solid black;
                                                   border-collapse: collapse;"></td>
                                        <td style="padding: 20px;
                                                   border: 1px solid black;
                                                   border-collapse: collapse; "></td>
                                        <td style="padding: 20px;
                                                   border: 1px solid black;
                                                   border-collapse: collapse; "></td>
                                        <td style="padding: 20px;
                                                   border: 1px solid black;
                                                   border-collapse: collapse;"></td>
                                        <td style="padding: 20px;
                                                   border: 1px solid black;
                                                   border-collapse: collapse;"></td>
                                        <td style="padding: 20px;
                                                   border: 1px solid black;
                                                   border-collapse: collapse;"></td>
                                        <td style="padding: 20px;
                                                   border: 1px solid black;
                                                   border-collapse: collapse;"></td>
                                        <td style="padding: 20px;
                                                   border: 1px solid black;
                                                   border-collapse: collapse;"></td>
                                    </template>   
                                </tr>
                    </tbody>
                    </table>
                    <h6 style="text-align: left;"> * Подлежащие уплате суммы представляются в порядке возрастания. Если договор заключается на основании части 6 статьи 15 Закона РА "О закупках", то настоящий график заполняется и скрепляется печатью одновременно с заключаемым между сторонами соглашением в случае предусмотрения финансовых средств, в качестве его неотъемлемой части. 
                    </h6>
                    <h6 style="text-align: left;">
                        ** В приглашении суммы отмечаются в процентах, а при заключении договора вместо процента отмечается размер конкретной суммы.
                    </h6>
                    <div>
                        <div class="info-block" style="padding: 60px 0">
                            <table style="width: 100%; border: none !important">
                                <tbody>
                                <tr>
                                    <td style="width: 50%">
                                        <div style="text-align: center">
                                            <h6 class="ft-11" style="font-weight: 700">ПОКУПАТЕЛЬ</h6>
                                            <p class="ft-11" style="font-size: 14px;">" {{ me.organisation[0].translations.name.ru }} " {{ me.organisation[0].translations.company_type.ru }}</p>
                                            <p class="ft-11" style="font-size: 14px;" v-if="me.organisation[0].translations.region.ru === me.organisation[0].translations.city.ru">{{ me.organisation[0].translations.city.ru }} {{ me.organisation[0].translations.address.ru }}</p>
                                            <p class="ft-11" style="font-size: 14px;" v-else>{{ me.organisation[0].translations.region.ru }} {{ me.organisation[0].translations.city.ru }} {{ me.organisation[0].translations.address.ru }}</p>
                                            <p class="ft-11" style="font-size: 14px;">Банк: {{ me.organisation[0].translations.bank_name.ru }}</p>
                                            <p class="ft-11" style="font-size: 14px;">Н/С {{ me.organisation[0].bank_account }} </p>
                                            <p class="ft-11" style="font-size: 14px;">ИНН {{ me.organisation[0].tin }} </p>
                                            <p class="ft-11" style="font-size: 14px;">{{ me.organisation[0].translations.director_position.ru }}: {{ me.organisation[0].translations.director_name.ru }}</p>    
                                            <p class="ft-11" style="font-size: 14px;">______________________</p>
                                            <p style="font-size: 8px; margin-top: -20px; color: gray; margin-bottom: 35px;">/подпись/</p>
                                            <p style="font-size: 14px; text-align: center">М. П.</p>
                                        </div>
                                    </td>
                                    <td style="width: 50%">
                                        <div style="text-align: center">
                                            <h6 class="ft-11" style="font-weight: 700">ПРОДАВЕЦ</h6>
                                            <p class="ft-11" style="font-size: 14px;"> " <span class="winner-name">______________</span> " <span class="winner-type">_______</span></p>
                                            <p class="ft-11" style="font-size: 14px;"><span class="winner-address">_____________________</span></p>
                                            <p class="ft-11" style="font-size: 14px;">Банк:<span class="winner-bank">___________</span></p>
                                            <p class="ft-11" style="font-size: 14px;">Н/С <span class="winner-bank_account">_____________________</span></p>
                                            <p class="ft-11" style="font-size: 14px;">ИНН <span class="winner-tin">______________</span></p>
                                            <p class="ft-11" style="font-size: 14px;">Директор: <span class="winner-director">_____________________</span></p>
                                            <p class="ft-11" style="font-size: 14px;">______________________</p>
                                            <p style="font-size: 8px; margin-top: -20px; color: gray; margin-bottom: 35px;">/подпись/</p>
                                            <p style="font-size: 14px; text-align: center">М. П.</p>
                                        </div>
                                    </td>
                                </tr>
                                </tbody>
                            </table>
                        </div>
                    </div>
                </div>
		        <div class="html2pdf__page-break"/>
                <div class="info-block">
                    <div style="text-align: right; font-weight: 700">Приложение N 3</div>
                    <div style="text-align: right; font-weight: 700">К Договору под кодом <span class="contract-code-ru" style="color: rgb(17, 85, 204);"></span></div>
                    <div style="text-align: right; font-weight: 700">Заключенному <span class="sign-date">"  	 "    	20_ </span>г.</div> 
                    <br/>
                    <div class="col-md-12 d-flex">
                        <table style="width: 100%; border: none !important">
                            <tbody>
                                <tr>
                                    <td style="border:none !important;">
                                        <div style="text-align: right;">
                                            <p class="ft-11" style="font-size: 14px; font-weight: 700">Сторона договора</p>
                                            <p class="ft-11" style="font-size: 14px;">____________________ </p>
                                            <p class="ft-11" style="font-size: 14px;">____________________ </p>
                                            <p class="ft-11" style="font-size: 14px;">__________место нахождения</p>
                                            <p class="ft-11" style="font-size: 14px;">___________Р/С</p>
                                            <p class="ft-11" style="font-size: 14px;">_______________________УНН</p>
                                        </div>
                                    </td>
                                    <td>
                                        <div style="text-align: left; padding-left: 80px">
                                            <p class="ft-11" style="font-size: 14px; font-weight: 700">Заказчик</p>
                                            <p class="ft-11" style="font-size: 14px;">____________________ </p>
                                            <p class="ft-11" style="font-size: 14px;">____________________ </p>
                                            <p class="ft-11" style="font-size: 14px;">место нахождения__________</p>
                                            <p class="ft-11" style="font-size: 14px;">Р/С___________</p>
                                            <p class="ft-11" style="font-size: 14px;">УНН_______________________ </p>
                                        </div>
                                    </td>
                                </tr>
                            </tbody>
                        </table>
                    </div>
                </div>
		        <div class="html2pdf__page-break"/>
                <div class="info-block">
                    <h6 style="text-align: center; margin-top: 3rem">
                        АКТ N
                    </h6>
                    <h6 style="text-align: center">
                        СДАЧИ-ПРИЕМКИ РЕЗУЛЬТАТОВ ИСПОЛНЕНИЯ ДОГОВОРА ИЛИ ЕГО ЧАСТИ
                    </h6>
                    <p style="text-align: left;">" &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;     " "  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;        	"  20.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;	г.</p>
                    <h6>
                        Наименование договора (далее — Договор) 
                    </h6>
                    <h6>_______________________________________________________________</h6>
                    <h6 style="text-align: left;">
                        Дата заключения Договора "____" "__________________" 20. г.
                    </h6>
                    <h6 style="text-align: left;">
                        Заказчик и сторона Договора, принимая за основание относящийся к исполнению договора счет-фактуру N      "   &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;      "      "  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;	                "  20&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;   г., составили настоящий акт о следующем:
                    </h6>
                    <h6 style="text-align: left;">
                        В рамках Договора сторона Договора предоставила следующие услуги:
                    </h6>
                    <table style="font-size: 10px;
                            width: 100%;
                            table-layout: fixed;
                            border-collapse: collapse;
                            page-break-inside: avoid;
                            border: 1px solid black;
                            text-align: center;" cellspacing="5" cellpadding="5">
                        <tbody>
                            <tr>
                                <th rowspan="3" style="border: 1px solid black;
                                                       border-collapse: collapse;">N</th>
                                <th colspan="8" style="border: 1px solid black;
                                                       border-collapse: collapse;">
                                    Предоставленные услуги
                                </th>
                            </tr>
                            <tr>
                                <th rowspan="2" style="border: 1px solid black;
                                                       border-collapse: collapse;">наименование</th>
                                <th rowspan="2" style="border: 1px solid black;
                                                       border-collapse: collapse;">краткое изложение технической характеристики</th>
                                <th colspan="2" style="border: 1px solid black;
                                                       border-collapse: collapse;">количественный показатель
                                </th>
                                <th colspan="2" style="border: 1px solid black;
                                                       border-collapse: collapse;">срок исполнения</th>
                                <th rowspan="2" style="border: 1px solid black;
                                                       border-collapse: collapse;">сумма, подлежащая уплате (тыс. драмов)</th>
                                <th rowspan="2" style="border: 1px solid black;
                                                       border-collapse: collapse;">срок оплаты (по графику оплаты)</th>
                            </tr>
                            <tr>
                                <th style="border: 1px solid black;
                                           border-collapse: collapse;">по графику закупки, утвержденному Договором</th>
                                <th style="border: 1px solid black;
                                           border-collapse: collapse;">фактический</th>
                                <th style="border: 1px solid black;
                                           border-collapse: collapse;">по графику закупки, утвержденному Договором</th>
                                <th style="border: 1px solid black;
                                           border-collapse: collapse;">фактический
                                </th>
                            </tr>
                            <tr>
                                <td style ="padding: 20px;
                                            border: 1px solid black;
                                            border-collapse: collapse;"></td>
                                <td style ="padding: 20px;
                                            border: 1px solid black;
                                            border-collapse: collapse;"></td>
                                <td style ="padding: 20px;
                                            border: 1px solid black;
                                            border-collapse: collapse;"></td>
                                <td style ="padding: 20px;
                                            border: 1px solid black;
                                            border-collapse: collapse;"></td>
                                <td style ="padding: 20px;
                                            border: 1px solid black;
                                            border-collapse: collapse;"></td>
                                <td style ="padding: 20px;
                                            border: 1px solid black;
                                            border-collapse: collapse;"></td>
                                <td style ="padding: 20px;
                                            border: 1px solid black;
                                            border-collapse: collapse;"></td>
                                <td style ="padding: 20px;
                                            border: 1px solid black;
                                            border-collapse: collapse;"></td>
                                <td style ="padding: 20px;
                                            border: 1px solid black;
                                            border-collapse: collapse;"></td>
                            </tr>
                            <tr>
                                <td style ="padding: 20px;
                                            border: 1px solid black;
                                            border-collapse: collapse;"></td>
                                <td style ="padding: 20px;
                                            border: 1px solid black;
                                            border-collapse: collapse;"></td>
                                <td style ="padding: 20px;
                                            border: 1px solid black;
                                            border-collapse: collapse;"></td>
                                <td style ="padding: 20px;
                                            border: 1px solid black;
                                            border-collapse: collapse;"></td>
                                <td style ="padding: 20px;
                                            border: 1px solid black;
                                            border-collapse: collapse;"></td>
                                <td style ="padding: 20px;
                                            border: 1px solid black;
                                            border-collapse: collapse;"></td>
                                <td style ="padding: 20px;
                                            border: 1px solid black;
                                            border-collapse: collapse;"></td>
                                <td style ="padding: 20px;
                                            border: 1px solid black;
                                            border-collapse: collapse;"></td>
                                <td style ="padding: 20px;
                                            border: 1px solid black;
                                            border-collapse: collapse;"></td>
                            </tr>
                        </tbody>
                    </table>
                    <h6 style="text-align: left; margin-top: 3rem">
                        &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
                        Счет-фактура и положительное заключение, послужившие основанием для подтверждения в двустороннем порядке настоящего Акта, являются составляющей частью настоящего Акта и прилагаются.
                    </h6>
                    <div class="col-md-12 d-flex" style="margin-top: 3rem">
                        <table style="width: 100%; border: none !important">
                            <tbody style="width: 100%">
                                <tr>
                                    <td>
                                        <div style="text-align: center">
                                            <h6 class="ft-11">Услугу сдал</h6>
                                            <h6>__________________________________</h6>
                                            <h6 style="font-size: 8px; text-align: center ; margin-top: -5px; color: gray; margin-bottom: 25px;">подпись</h6>
                                            <h6>__________________________________</h6>
                                            <h6 style="font-size: 8px; text-align: center ; margin-top: -5px; color: gray; margin-bottom: 35px;">фамилия, имя</h6>
                                            <p style="font-size: 14px; text-align: center">М. П.</p>
                                        </div>
                                    </td>
                                    <td>
                                        <div style="text-align: center;">
                                            <h6 class="ft-11">Услугу принял</h6>
                                            <h6>__________________________________</h6>
                                            <h6 style="font-size: 8px; text-align: center ; margin-top: -5px; color: gray; margin-bottom: 25px;">подпись</h6>
                                            <h6>__________________________________</h6>
                                            <h6 style="font-size: 8px; text-align: center ; margin-top: -5px; color: gray; margin-bottom: 35px;">фамилия, имя</h6>
                                            <p style="font-size: 14px; text-align: center">М. П.</p>
                                        </div>
                                    </td>
                                </tr>
                            </tbody>
                        </table>
                    </div>
                </div>
		        <div class="html2pdf__page-break"/>
                <div class="info-block">
                    <div style="text-align: right; font-weight: 700">Приложение N 3.1</div>
                    <div style="text-align: right; font-weight: 700">К Договору под кодом <span class="contract-code-ru" style="color: rgb(17, 85, 204);"></span></div>
                    <div style="text-align: right; font-weight: 700">Заключенному <span class="sign-date">"  	 "    	20_ </span>г.</div>
                    <br/>
                    <div style="margin-top: 3rem; text-align: center; font-weight: 700">
                        АКТ N_
                    </div>
                    <div style="text-align: center">
                        относительно фиксирования факта сдачи Заказчику результата договора
                    </div>
                    <p>Настоящим фиксируется, что в рамках договора закупки № ______________________,</p>
                    <p style="font-size: 8pt; margin-left: 420px; margin-top: -20px">номер договора</p>
                    <p>заключенного ______________________20</p>
                    <p style="font-size: 8pt; margin-left: 95px; margin-top: -20px">дата заключения договора</p>
                    <table>
                        <tr>
                            <td style="width: 50%">
                                <p>г. между ____________________________________________</p>
                                <p style="font-size: 8pt; margin-left: 95px; margin-top: -20px">имя Заказчика</p>
                            </td>
                            <td style="width: 50%">
                                <p>(далее — Заказчик) и____________________________________________(далее — Исполнитель),</p>
                                <p style="font-size: 8pt; margin-left: 105px; margin-top: -20px">имя Исполнителя</p>
                            </td>
                        </tr>
                    </table>
                    <p>Исполнитель _______ 20   г. с целью сдачи-приемки сдал Заказчику нижеуказанные услуги:</p>
                    <table style="width: 100%;
                                    table-layout: fixed;
                                    border-collapse: collapse;
                                    page-break-inside: avoid;
                                    border: 1px solid black;
                                    text-align: center;" cellspacing="8" cellpadding="8">
                        <tr>
                            <th colspan="3" style="border: 1px solid black;
                                                   border-collapse: collapse;">Услуги</th>
                        </tr>
                        <tr>
                            <th style="border: 1px solid black;
                                       border-collapse: collapse;">наименование</th>
                            <th style="border: 1px solid black;
                                       border-collapse: collapse;">единица измерения</th>
                            <th style="border: 1px solid black;
                                       border-collapse: collapse;">объем (фактический)</th>
                        </tr>
                        <tr>
                            <td style ="padding: 20px;
                                         border: 1px solid black;
                                         border-collapse: collapse;
                                         text-align: center;"></td>
                            <td style ="padding: 20px;
                                         border: 1px solid black;
                                         border-collapse: collapse;
                                         text-align: center;"></td>
                            <td style ="padding: 20px;
                                         border: 1px solid black;
                                         border-collapse: collapse;
                                         text-align: center;"></td>
                        </tr>
                        <tr>
                            <td style ="padding: 20px;
                                        border: 1px solid black;
                                        border-collapse: collapse;
                                        text-align: center;"></td>
                            <td style ="padding: 20px;
                                        border: 1px solid black;
                                        border-collapse: collapse;
                                        text-align: center;"></td>
                            <td style ="padding: 20px;
                                        border: 1px solid black;
                                        border-collapse: collapse;
                                        text-align: center;"></td>
                        </tr>
                    </table>
                    <h6  style="text-align: left; margin-top: 3rem">Настоящий акт составлен в 2 экземплярах, каждой из сторон предоставляется по одному экземпляру.</h6>
                    <h6  style="text-align: center; margin-top: 3rem">СТОРОНЫ</h6>
                    <div class="col-md-12 d-flex" style="margin-top: 3rem">
                        <table style="width: 100%; border: none !important"> 
                            <tbody>
                                <tr>
                                    <td>
                                        <div style="text-align: center">
                                            <h6 class="ft-11" style="font-weight: 700">Сдал&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</h6>
                                            <h6 style="margin-top: 32px;">__________________________________</h6>
                                            <h6 style="font-size: 8px; text-align: center ; margin-top: -5px; color: gray; margin-bottom: 35px;">фамилия, имя&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</h6>
                                            <h6>__________________________________</h6>
                                            <h6 style="font-size: 8px; text-align: center ; margin-top: -5px; color: gray; margin-bottom: 35px;">подпись&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</h6>
                                        </div>
                                    </td>
                                    <td>
                                        <div style="text-align: center;">
                                            <h6 class="ft-11" style="font-weight: 700"><span style="margin-left: 25px;"/>Принял <br> представитель, спроектировавший заявку:</h6>
                                            <h6>__________________________________</h6>
                                            <h6 style="font-size: 8px; text-align: center ; margin-top: -5px; color: gray; margin-bottom: 35px;">фамилия, имя&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</h6>
                                            <h6>__________________________________</h6>
                                            <h6 style="font-size: 8px; text-align: center ; margin-top: -5px; color: gray; margin-bottom: 35px;">подпись&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</h6>
                                        </div>
                                    </td>
                                </tr>
                            </tbody>
                        </table>
                    </div>
                </div>
            </div>
        </section>
    </div>
</template>

<script>
import { required } from "vuelidate/lib/validators";
import EditorInput from '@/components/helpers/EditorInput';
import purchaseTypesLongNamesCased from '@/mixins/purchaseTypes'
import $ from 'jquery';

export default {
    name: 'contract_draft_work',
    components: { EditorInput },
    mixins: [purchaseTypesLongNamesCased],
    props: ['handleLoaded', 'handleLoadingStart', 'handleLoadingEnd'],
    data() {
        return {
            total: 0,
            inputs: {
                work_type: null,
                work_names: null,
                daysCount: null,
                option1: '',
                copyCount: null,
            },
            purchaseType: 1,
            getOrgnizeTypeByPlan: '',
            participants: [],
            participantsSequence: [],
            totalMembers: 0,
        }
    },
    validations() {
        const rules = {
            inputs: {
                work_names: { required },
                daysCount: { required },
            }
        }
        if(+this.currentOrganized.organize_type === 0){
            Object.assign(rules.inputs, {
                copyCount: { required },
            })
        }
        return rules;
    },
    mounted() { 
        this.$store.dispatch('organize/getCurrent', this.$route.params.id)
        const locale = 'ru'
        this.purchaseType = this.organizedRows[0].type
        this.getOrgnizeTypeByPlan = this.purchaseTypesLongNamesCased[locale][this.purchaseType || 2]
        this.organizedRows.forEach(item => {
            if(item.is_condition){
                this.total += item.count * item.procurementPlan.details[0].unit_amount
            }
        })
    },
    computed: {
        currentOrganized() {
            return this.$store.getters['organize/currentOrganized']
        },
        organizedRows() {
            return this.$store.getters['organize/organizedRows']
        },
        userChildren() {
            return this.$store.getters['user/userChildren']
        },
        me() {
            return this.$store.getters['user/me']
        },
    },
    watch: {
        currentOrganized: {
            immediate: true,
            async handler() {
                this.handleLoaded()
            },
        },
    },
    methods: {
        save() {
            this.$v.inputs.$touch();
            const _this = this
            let hasInvalid = false;
            $('#commandment-file .editor-input').each(function() {
                const inputName = $(this).attr('inputname');
                const input = _this.$v.inputs[inputName];
                if (input.$error) {
                    hasInvalid = true;
                    if(_this.$refs[inputName]._isVue) {
                        _this.$refs[inputName].$el.focus()
                    } else {
                        _this.$refs[inputName].focus();
                    }
                    return false;
                }
            });
            if (!hasInvalid) {
                this.handleLoadingStart()
                $('.editor-input').each(function() {
                    const txt = $(this).val()
                    $(this).after(txt)
                    $(this).remove()
                });

                $('.editor-option').each(function(index) {
                    const inputNumber = index+1
                    const optionValue = $(`.option-${inputNumber}:checked`).val()
                    const notSelectedOptionValue = +optionValue === 1 ? 2 : 1
                    $(`.option-${inputNumber}-variant-${notSelectedOptionValue}`).remove()
                    $(`.option-${inputNumber}`).remove()
                });
                 this.$client.put(`organize/${this.currentOrganized.id}`, {contract_html_ru: $('#commandment-file').html()}).then(({ status, data }) => {
                    // eslint-disable-next-line eqeqeq
                    if(status == 200) {
                    this.$store.commit('organize/setCurrentOrganized', data.data)
                        this.$notify({
                            group: 'foo',
                            type: 'success',
                            text: 'Հաջողությամբ թարմացված է'
                        })
                        this.$modal.hide('new-editor-modal')
                    }
                    this.isSaving = false
                    this.handleLoadingEnd()
                }).catch(e => {
                    this.handleLoadingEnd()
                    this.$notify({
                        group: 'foo',
                        type: 'error',
                        title: 'Ինչ որ բան այն չէ',
                        text: 'Կրկին փորձեք!'
                    })
                    this.isSaving = false
                })
            }
        },
        consoleLog(msg) {
            console.log(msg)
        },
    },
}
</script>
<style>
.option-box *{
    color: grey;
}
.option-box-selected *{
    color: red;
}
</style>