<template>
    <div id="commandment-file" ref="contract"
        style="line-height: 2; width: 100%">
        <section slot="pdf-content" contenteditable="true">
            <div class="col-md-12">
                <div class="info-block">
                    <div style="text-align: right; font-weight: 700; margin-top: 3rem; ">Հավելված  N 6</div>
                    <div style="text-align: right;font-weight: 700;  "><span class="contract-code" style="color: rgb(17, 85, 204);">«{{ currentOrganized.translations.code.hy }}»</span> ծածկագրով</div>
                    <div style="text-align: right;font-weight: 700;  "><span style="color: rgb(17, 85, 204);"><span class="getOrgnizeTypeByPlan">{{getOrgnizeTypeByPlan}}</span></span> հրավերի</div>
                    <br>
                    <h6 style="margin-top: 3rem; text-align: center; font-weight: 700; ">ՊԵՏՈՒԹՅԱՆ ԿԱՐԻՔՆԵՐԻ ՀԱՄԱՐ ԱՊՐԱՆՔԻ ՄԱՏԱԿԱՐԱՐՄԱՆ ՊԱՅՄԱՆԱԳԻՐ </h6>
                    <h6 style="text-align: center; font-weight: 700; ">N <span class="contract-code" style="color: rgb(17, 85, 204);"> {{ currentOrganized.translations.code.hy }}</span> </h6>
                    <div class="col-md-12 d-flex" style="padding: 0 !important;">
                        <table style="width: 100%; border: none !important">
                            <tbody>
                                <tr>
                                    <td style="border:none !important;">
                                        <div style="padding: 0 !important; text-align: left">
                                            <h6 style=""> <span class="ft-11" style="color: rgb(17, 85, 204);">{{ me.organisation[0].translations.city.hy }}</span></h6>
                                        </div>
                                    </td>
                                    <td  style="border:none !important;">
                                        <div style="padding: 0 !important; text-align: right">
                                            <h6 style=""><span style="color: rgb(17, 85, 204);" class="sign-date">__.__.____</span>թ.</h6>
                                        </div>
                                    </td>
                                </tr>
                            </tbody>
                        </table>
                    </div>
                    <h6 style="text-align: justify; ">
                        <span style="color: rgb(17, 85, 204);">« {{ me.organisation[0].translations.name.hy }} » {{ me.organisation[0].translations.company_type.hy }}</span>-ն, ի դեմս
                        {{ me.organisation[0].translations.director_position.hy }} <span style="color: rgb(17, 85, 204);">{{ me.organisation[0].translations.director_name.hy }}</span>-ի, որը գործում է 
                        <span style="color: rgb(17, 85, 204);">«{{ me.organisation[0].translations.name.hy }}» {{ me.organisation[0].translations.company_type.hy }}</span>
                        կանոնադրության հիման վրա (այսուհետ՝ Գնորդ), մի կողմից, և  
                        <span class="winner-name">_______</span>-ն, ի դեմս տնօրեն<span class="winner-director">_______</span>ի, 
                        որը գործում է <span class="winner-name">_______</span> կանոնադրության հիման վրա (այսուհետ՝ Վաճառող), մյուս կողմից,
                        կնքեցին սույն պայմանագիրը հետևյալի մասին։
                    </h6>
                </div>
                <br/>
                <div class="info-block">
                    <p style="font-weight: 700; text-align: center;">1. ՊԱՅՄԱՆԱԳՐԻ ԱՌԱՐԿԱՆ</p>
                    <h6 style="margin-top: 3rem; text-align: justify; "> 
                        <br/><br/><span style="margin-left: 25px;"/>1.1. Վաճառողը պարտավորվում է սույն պայմանագրով (այսուհետ` պայմանագիր) սահմանված կարգով, ծավալներով, ժամկետներում և հասցեով Գնորդին մատակարարել պայմանագրի N 1 հավելվածով` Տեխնիկական բնութագիր-գնման-ժամանակացույցով նախատեսված ապրանքը (այսուհետ` ապրանք), իսկ Գնորդը պարտավորվում է ընդունել ապրանքը և վճարել դրա համար։
                    </h6>
                </div>
                <br/>
                <div class="info-block" style="margin-top: 3rem;">
                    <p style="font-weight: 700; text-align: center;">2. ԿՈՂՄԵՐԻ ԻՐԱՎՈՒՆՔՆԵՐԸ ԵՎ ՊԱՐՏԱԿԱՆՈՒԹՅՈՒՆՆԵՐԸ</p>
                    <h6 style="text-align: justify; margin-top: 0; margin-bottom: 30px;">
                        <span style="margin-left: 25px;"/><span style="font-weight: 700">2.1 Գնորդն իրավունք ունի`</span>
                        <br/><span style="margin-left: 25px;"/>
                        2.1.1 Ապրանքը պայմանագրով սահմանված ժամկետում Վաճառողի կողմից չմատակարարելու դեպքում հրաժարվել ապրանքից, եթե մատակարարման ժամկետները խախտվել են 
                        <input type="text"
                            class="editor-input"
                            v-model="$v.inputs.violationDays.$model"
                            ref="violationDays"
                            inputName="violationDays"
                            style="width: 30px;border-top: 0 !important; border-left: 0 !important; border-right: 0 !important;text-align: right;   
                            font-size: 13px;
                            color: #303e67;
                            border-bottom: 1px solid black" 
                            onkeypress="this.style.width = ((this.value.length + 1) * 8 + 2) + 'px';"
                        /> 
                        օրից ավելի:
                        <br/><span style="margin-left: 25px;"/>2.1.2 Եթե հանձնվել է անպատշաճ որակի` պայմանագրով նախատեսված տեխնիկական բնութագրին չհամապատասխանող ապրանք`
                        <br/><span style="margin-left: 25px;"/>ա) պահանջել հատուցելու ապրանքի անպատշաճ որակի լինելու պատճառով իր կատարած ծախսերը.
                        <br/><span style="margin-left: 25px;"/>բ) չընդունել ապրանքն` իր հայեցողությամբ սահմանելով անպատշաճ որակի ապրանքը պայմանագրին համապատասխանող որակի ապրանքով անհատույց փոխարինման ողջամիտ ժամկետ և պահանջել Վաճառողից վճարելու պայմանագրի 6.3 կետով նախատեսված տուգանքը.
                        <br/><span style="margin-left: 25px;"/>գ) հրաժարվել պայմանագիրը կատարելուց և պահանջել վերադարձնելու ապրանքի համար վճարված գումարը:
                        <br/><span style="margin-left: 25px;"/>2.1.3. Եթե հանձնվել է պայմանագրով որոշվածից պակաս քանակի ապրանք, ապա`
                        <br/><span style="margin-left: 25px;"/>ա) պահանջել լրացնելու ապրանքի պակաս հանձնված քանակը,
                        <br/><span style="margin-left: 25px;"/>բ) հրաժարվել հանձնված ապրանքից և դրա համար վճարելուց, իսկ եթե ապրանքի համար վճարվել է, ապա պահանջել վերադարձնելու վճարված գումարը և վճարելու պայմանագրի 6.2 կետով նախատեսված տույժը:
                        <br/><span style="margin-left: 25px;"/>2.1.4. Եթե հանձնվել է տեսակի պայմանի խախտմամբ ապրանք,  իր ընտրությամբ`
                        <br/><span style="margin-left: 25px;"/>ա) ընդունել տեսակի վերաբերյալ պայմանին համապատասխանող ապրանքը և հրաժարվել մնացած ապրանքներից.
                        <br/><span style="margin-left: 25px;"/>բ) հրաժարվել հանձնված բոլոր ապրանքներից և պահանջել վճարելու պայմանագրի 6.2 կետով նախատեսված տույժը.
                        <br/><span style="margin-left: 25px;"/>գ) պահանջել տեսակի վերաբերյալ պայմանին չհամապատասխանող ապրանքի անհատույց փոխարինում պայմանագրով նախատեսված տեսակին համապատասխան ապրանքով:
                        <br/><span style="margin-left: 25px;"/>2.1.5. Վաճառողի կողմից մատակարարման ժամկետների խախտման դեպքում իր հայեցողությամբ սահմանել ապրանքի մատակարարման նոր ժամկետ և պահանջել Վաճառողից վճարելու պայմանագրի  6.2 կետով նախատեսված տույժը։
                        <br/><span style="margin-left: 25px;"/>2.1.6. Վաճառողից պահանջել հատուցելու վնասները, եթե Գնորդը Վաճառողի կողմից պարտավորությունը խախտելու հետևանքով պայմանագրի լուծումից հետո ողջամիտ ժամկետում այլ անձից ավելի բարձր, սակայն ողջամիտ գնով գնել է ապրանք` պայմանագրով նախատեսվածի փոխարեն` պայմանագրով սահմանված և դրա փոխարեն կնքված գործարքի գների միջև տարբերության չափով, ինչպես նաև ապրանքն այլ անձից ձեռք բերելու համար իր կատարած բոլոր անհրաժեշտ և ողջամիտ ծախսերը:
                        <br/><span style="margin-left: 25px;"/>2.1.7. Միակողմանի լուծել պայմանագիրը (լրիվ կամ մասնակի), եթե Վաճառողն էականորեն խախտել է պայմանագիրը.
                        <br/><span style="margin-left: 25px;"/>2.1.7.1. Վաճառողի կողմից պայմանագիրը խախտելն էական է համարվում, եթե`
                        <br/><span style="margin-left: 25px;"/><span style="margin-left: 25px;"/>ա) մատակարարվել է անպատշաճ որակի ապրանք որը չի կարող փոխարինվել Գնորդի համար ընդունելի ժամկետում.
                        <br/><span style="margin-left: 25px;"/><span style="margin-left: 25px;"/>
                        բ) ապրանքի մատակարարման ժամկետները խախտվել են
                        <input type="text"
                            class="editor-input"
                            v-model="$v.inputs.violationDays_1.$model"
                            ref="violationDays_1"
                            inputName="violationDays_1"
                            style="width: 30px;border-top: 0 !important; border-left: 0 !important; border-right: 0 !important;text-align: right;   
                            font-size: 13px;
                            color: #303e67;
                            border-bottom: 1px solid black"  
                            onkeypress="this.style.width = ((this.value.length + 1) * 8 + 2) + 'px';"
                        /> օրից ավելի,
                        <br/><span style="margin-left: 25px;"/>2.1.8. Զննել ապրանքը և հայտնաբերված թերությունների մասին անհապաղ տեղեկացնել Վաճառողին։
                    </h6>
                    <span style="margin-left: 25px;"/><span style="font-weight: 700">2.2 Գնորդը պարտավոր է`</span>
                    <h6 style="text-align: justify;  margin-top: 0; margin-bottom: 30px;">
                        <span style="margin-left: 25px;"/>2.2.1 Կատարել պայմանագրին համապատասխան մատակարարված ապրանքի ընդունումն ապահովող բոլոր անհրաժեշտ գործողությունները:
                        <br/><span style="margin-left: 25px;"/>2.2.2 Վաճառողի հանձնած ապրանքից պայմանագրին համապատասխան հրաժարվելու դեպքում, ապահովել այդ ապրանքի պատասխանատու պահպանությունը և դրա մասին անհապաղ տեղեկացնել Վաճառողին:
                        <br/><span style="margin-left: 25px;"/>2.2.3. Պայմանագրով նախատեսված կարգով և ժամկետներում մատակարարված ապրանքն ընդունելու դեպքում Վաճառողին վճարել վերջինիս վճարման ենթակա գումարները, իսկ վճարման ժամկետի խախտման դեպքում` նաև պայմանագրի  6.5 կետով նախատեսված տույժը։
                        <br/><span style="margin-left: 25px;"/>2.2.4. Ապրանքի քանակի, տեսականու, որակի մասին պայմանագրի պայմանները խախտելու մասին Վաճառողին ծանուցել թերությունը հայտնաբերելուց հետո անմիջապես կամ այն բանից հետո` ողջամիտ ժամկետում, երբ պայմանագրի համապատասխան պայմանի խախտումը պետք է հայտնաբերված լիներ` ելնելով ապրանքի բնույթից և նշանակությունից։
                        <br/><span style="margin-left: 25px;"/>2.2.5. Պայմանագրի 2.3.3 կետի համաձայն պայմանագրի լուծումից հետո Վաճառողին հատուցել վերջինիս պատճառված և սահմանված կարգով հիմնավորված վնասները։
                    </h6>
                    <span style="margin-left: 25px;"/><span style="font-weight: 700">2.3 Վաճառողն իրավունք ունի`</span>
                    <h6 style="text-align: justify;  margin-top: 0; margin-bottom: 30px;">
                        <span style="margin-left: 25px;"/>2.3.1. Գնորդից պահանջել ընդունելու պայմանագրով նախատեսված կարգով, ծավալներով, ժամկետներում և հասցեով մատակարարված ապրանքը:
                        <br/><span style="margin-left: 25px;"/>2.3.2. Գնորդից պահանջել վճարելու պայմանագրով նախատեսված կարգով, ծավալներով, ժամկետներում և հասցեով մատակարարված և Գնորդի կողմից ընդունված ապրանքի համար իրեն վճարման ենթակա գումարները:
                        <br/><span style="margin-left: 25px;"/>2.3.3. Միակողմանի լուծել պայմանագիրը (լրիվ կամ մասնակի), եթե Գնորդն էականորեն խախտել է պայմանագիրը:
                        <br/><span style="margin-left: 25px;"/>2.3.3.1. Գնորդի կողմից պայմանագիրը խախտելն էական է համարվում, եթե բազմիցս խախտվել են ապրանքի համար վճարելու ժամկետները։
                        <br/><span style="margin-left: 25px;"/>2.3.4. Գնորդի համաձայնությամբ վաղաժամկետ մատակարարել ապրանքը։
                    </h6>
                    <span style="margin-left: 25px;"/><span style="font-weight: 700">2.4 Վաճառողը պարտավոր է`</span>
                    <h6 style="text-align: justify;  margin-top: 0; margin-bottom: 30px;">
                        <span style="margin-left: 25px;"/>2.4.1. Գնորդին հանձնել ապրանքը` պայմանագրով նախատեսված կարգով, ծավալներով, ժամկետներում և հասցեով:
                        <br/><span style="margin-left: 25px;"/>2.4.2. Ապահովել ապրանքի մատակարարումը պայմանագրի 2.1.2 կետի բ) ենթակետին և (կամ) 2.1.5 կետին համապատասխան` Գնորդի կողմից սահմանված ժամկետներում: 
                        <br/><span style="margin-left: 25px;"/>2.4.3. Գնորդին հանձնել երրորդ անձանց իրավունքներից ազատ ապրանք:
                        <br/><span style="margin-left: 25px;"/>2.4.4. Գնորդին հանձնել պայմանագրով նախատեսված որակի և քանակի ապրանք` պայմանագրով նախատեսված ժամկետներում և հասցեով, իսկ Գնորդի պահանջով տրամադրել ապրանքի որակը հավաստող` ՀՀ օրենսդրությամբ սահմանված փաստաթղթեր։
                        <br/><span style="margin-left: 25px;"/>2.4.5. Թերի մատակարարում թույլ տալու դեպքում, պայմանագրով նախատեսված կարգով, լրացնել թերի մատակարարվածը։
                        <br/><span style="margin-left: 25px;"/>2.4.6. Հետ տանել Գնորդի կողմից պայմանագրի 2.2.2 կետին համապատասխան` պատասխանատու պահպանության ընդունված ապրանքը կամ ողջամիտ ժամկետում տնօրինել այն, ինչպես նաև հատուցել ապրանքը պատասխանատու պահպանության ընդունելու, այն իրացնելու կամ Վաճառողին վերադարձնելու հետ կապված անհրաժեշտ ծախսերը։
                        <br/><span style="margin-left: 25px;"/>2.4.7. Պայմանագրով նախատեսված դեպքերում վճարել պայմանագրի 6.2 և 6.3  կետերով նախատեսված տույժը և տուգանքը։
                        <br/><span style="margin-left: 25px;"/>2.4.8. Գնորդին հանձնել ապրանքի պատկանելիքները և համապատասխան փաստաթղթերը։
                        <br/><span style="margin-left: 25px;"/>2.4.9. Պայմանագրի 2.1.7 կետի համաձայն պայմանագրի լուծումից հետո Գնորդին հատուցել վերջինիս պատճառված և սահմանված կարգով հիմնավորված վնասները։
                        <br/><span style="margin-left: 25px;"/>2.4.10. Որակավորման և պայմանագրի ապահովում ներկայացրած անձը պարտավոր է ապահովումների գործողության ընթացքում լուծարման կամ սնանկացման գործընթաց սկսելու դեպքում դրա մասին նախապես գրավոր տեղեկացնել Գնորդին։
                        <template v-if="currentOrganized.is_with_condition && Number(currentOrganized.organize_type) === 1">
                            <br/><span style="margin-left: 25px;"/>2.4.12. Պայմանագրի կատարման շրջանակում յուրաքանչյուր փուլի հանձնման-ընդունման արձանագրության հետ մեկտեղ պատվիրատուին ներկայացնել տվյալ փուլի կատարումն ապահովելու նպատակով օգտագործված հայաստանյան ծագում ունեցող արտադրական ռեսուրսների ծագման երկրի սերտիֆիկատների և ռեսուրսների ձեռքբերման հաշիվ-ապրանքագրերի, ինչպես նաև իր կողմից հաստատված տեղեկանքի պատճենները՝ համապատասխան թվով աշխատողներին վճարված գումարների մասին, նշելով ըստ աշխատողների վճարված գումարների չափերը և վերջիններիս հանրային ծառայության համարանիշները։
                        </template>
                    </h6>
                </div>
                <div class="info-block">
                    <p style="font-weight: 700; text-align: center;">3. ՊԱՅՄԱՆԱԳՐԻ ԳԻՆԸ ԵՎ ՎՃԱՐՄԱՆ ԿԱՐԳԸ</p>
                    <h6 style="margin-top: 3rem; text-align: justify;  margin-top: 0; margin-bottom: 30px;">
                        <span style="margin-left: 25px;"/>3.1. Պայմանագրի գինը կազմում է <span class="contract-price">_______</span> (<span class="contract-price-word">______________</span>) ՀՀ դրամ <span class="contract-det"></span> 
                        <br/><span style="margin-left: 25px;"/>Պայմանագրի գինը ներառում է պայմանագրի կատարումն ապահովելու նպատակով Վաճառողի կողմից կատարվելիք բոլոր վճարները (ծախսերը), այդ թվում` հարկերը, տուրքերը, փոխադրման, ապահովագրման ծախսերը, պարգևավճարները և ակնկալվող շահույթը
                        <span class="if-phys-person">, ընդ որում` հարկային պարտավորությունները (հարկեր և պարտադիր այլ վճարներ) վճարվում են հարկային գործակալի` Գնորդի կողմից</span>:
                        Ապրանքի մատակարարման գինը կայուն է և Վաճառողն իրավունք չունի պահանջել ավելացնելու, իսկ Գնորդը նվազեցնելու այդ գինը։
                        <template v-if="+currentOrganized.prepayment">
                            <span style="margin-left: 25px;"/>3.1.1. Պայմանագրի գնից` մինչև {{ currentOrganized.prepayment_max }} ({{ currentOrganized.prepayment_max_text }}) ՀՀ դրամը, Գնորդը փոխանցում է Վաճառողի բանկային հաշվին` որպես կանխավճար։ Կանխավճարի մարումն իրականացվում է հանձնման-ընդունման արձանագրությունների հիման վրա կատարվող վճարումներից նվազեցումներ (պահումներ) կատարելու ձևով։ Ընդ որում մինչև կանխավճարի ամբողջական մարումը, Վաճառողին վճարումներ չեն կատարվում:
                        </template>
                        <br/><span style="margin-left: 25px;"/>3.2. Գնորդն իրեն մատակարարված ապրանքի դիմաց վճարում է ՀՀ դրամով անկանխիկ` դրամական միջոցները Վաճառողի հաշվարկային հաշվին փոխանցելու միջոցով։ Դրամական միջոցների փոխանցումը կատարվում է հանձման-ընդունման արձանագրության հիման վրա` պայմանագրի վճարման  ժամանակացույցով (հավելված N 2) նախատեսված ամիսներին, բայց ոչ ուշ, քան մինչև տվյալ տարվա դեկտեմբերի 30-ը: 
                        <br/><span style="margin-left: 25px;"/>Ընդ որում վճարում կատարելու նպատակով հանձնման-ընդունման արձանագրությունն ստորագրվելու օրվանից հետո 3 աշխատանքային օրվա ընթացքում գնորդը վճարման հանձնարարագիրը և հանձնման-ընդունման արձանագրության պատճենը մուտքագրում է լիազորված մարմնի գանձապետական համակարգ, իսկ սահմանված կարգի համաձայն ներկայացված փաստաթղթերի հիման վրա լիազորված մարմինը տվյալ վճարումը կատարում է հանձնման-ընդունման արձանագրությունը գանձապետական համակարգ մուտքագրված լինելու դեպքում՝ սույն պայմանագրի վճարման ժամանակացույցով սահմանված ժամկետներում, հինգ աշխատանքային օրվա ընթացքում: 
                        <br/><span style="margin-left: 25px;"/>Ընդ որում գնման դիմաց վճարումն իրականացվում է սույն պայմանագրի վճարման ժամանակացույցով սահմանված ժամկետում, հինգ աշխատանքային օրվա ընթացքում:

                    </h6>
                </div>
                <div class="info-block">
                    <p style="font-weight: 700; text-align: center;">4. ԱՊՐԱՆՔԻ ՈՐԱԿԸ ԵՎ ԵՐԱՇԽԻՔԸ</p>
                    <h6 style="margin-top: 3rem; text-align: justify;  margin-top: 0; margin-bottom: 30px;">
                        <span style="margin-left: 25px;"/>4.1. Վաճառողը երաշխավորում է մատակարարված ապրանքի որակի համապատասխանությունը պետական ստանդարտի պահանջներին։
                        <br/><span style="margin-left: 25px;"/>
                        <span  v-if="organizedRows[0].is_main_tool === 1">
                            4.2. <span style="color: rgb(17, 85, 204);">Հիմնական միջոց</span> հանդիսացող ապրանքների համար երաշխիքային ժամկետ է սահմանվում Գնորդի կողմից ապրանքն ընդունվելու օրվան հաջորդող օրվանից հաշված 
                            <input type="text"
                                class="editor-input"
                                v-model="$v.inputs.calendar_days.$model"
                                ref="calendar_days"
                                inputName="calendar_days"
                                style="width: 30px;border-top: 0 !important; border-left: 0 !important; border-right: 0 !important; text-align: right;   
                                font-size: 13px;
                                color: #303e67;
                                border-bottom: 1px solid black"
                                onkeypress="this.style.width = ((this.value.length + 1) * 8 + 2) + 'px';"  />
                            օրացուցային օրը:  Եթե երաշխիքային ժամկետի ընթացքում ի հայտ են եկել մատակարարված ապրանքի թերություններ, ապա Վաճառողը պարտավոր է իր հաշվին, Գնորդի կողմից սահմանված ողջամիտ ժամկետում վերացնել թերությունները։
                        </span> 
                    </h6>
                </div>
                <div class="info-block">
                    <p style="font-weight: 700;text-align: center;">5. ԱՊՐԱՆՔԻ ՀԱՆՁՆՈՒՄԸ ԵՎ ԸՆԴՈՒՆՈՒՄԸ</p>
                    <h6 style="text-align: justify;  margin-top: 0; margin-bottom: 30px;">
                        <template v-if="+currentOrganized.organize_type === 1" style="">
                                <span style="margin-left: 25px;"/>5.1. Մատակարարված ապրանքն ընդունվում է Գնորդի և Վաճառողի միջև հանձնման-ընդունման արձանագրության ստորագրմամբ: Ապրանքը Գնորդին հանձնելու փաստը ֆիքսվում է Գնորդի և Վաճառողի միջև երկկողմ հաստատված փաստաթղթով՝ նշելով փաստաթղթի կազմման ամսաթիվը:
                                <br/><span style="margin-left: 25px;"/>Մինչև պայմանագրով ապրանքի մատակարարման համար նախատեսված օրը ներառյալ Վաճառողը Գնորդին է տրամադրում իր կողմից ստորագրված` ապրանքը Գնորդին հանձնելու փաստը ֆիքսող փաստաթուղթը (հավելված N 3.1), իսկ էլեկտրոնային գնումների armeps համակարգի միջոցով (գործողության իրականացման ձեռնարկը տեղադրված է www.procurement.am հասցեով գործող կայքի «Էլեկտրոնային գնումներ» բաժնում)` նաև հանձնման-ընդունման արձանագրությունը (հավելված N 3): Ընդ որում Վաճառողը հանձնման-ընդունման արձանագրությունը չի կնքում, հաստատում է էլեկտրոնային ստորագրությամբ` լրացնելով միայն այն սյունակները, որոնք վերաբերում են իր տվյալներին (լրացման կարգը տեղադրված է www.procurement.am հասցեով գործող կայքի «Օրենսդրություն» բաժնի «Ֆինանսների նախարարի հրամաններ» ենթաբաժնում):
                                <br/><span style="margin-left: 25px;"/>
                                5.2. Եթե մատակարարված ապրանքը համապատասխանում է պայմանագրի պայմաններին, Գնորդը պայմանագրի 5.1 կետում նշված փաստաթղթերը ստանալու օրվան հաջորդող աշխատանքային օրվանից հաշված 
                                <input type="text"
                                    class="editor-input"
                                    v-model="$v.inputs.daysCount.$model"
                                    ref="daysCount"
                                    inputName="daysCount"
                                    style="width: 30px;border-top: 0 !important; border-left: 0 !important; border-right: 0 !important; text-align: right;   
                                    font-size: 13px;
                                    color: #303e67;
                                    border-bottom: 1px solid black"
                                    onkeypress="this.style.width = ((this.value.length + 1) * 8 + 2) + 'px';"
                                />
                                աշխատանքային օրվա ընթացքում ստորագրում և էլեկտրոնային գնումների armeps համակարգի միջոցով Վաճառողին է տրամադրում իր կողմից ստորագրված հանձնման-ընդունման արձանագրությունը և դրա ստորագրման համար հիմք հանդիսացած դրական եզրակացությունը:
                                <br/><span style="margin-left: 25px;"/>5.3. Եթե մատակարարված ապրանքը կամ դրա մի մասը չի համապատասխանում պայմանագրի պայմաններին, ապա Գնորդը չի ստորագրում հանձնման-ընդունման արձանագրությունը և պայմանագրի 5.2 կետում նշված ժամկետում էլեկտրոնային գնումների armeps համակարգի միջոցով Վաճառողին հետ է վերադարձնում հանձնման-ընդունման արձանագրությունը և դրա չստորագրման համար հիմք հանդիսացած բացասական եզրակացությունը: Սույն կետի կիրառման դեպքում Գնորդը ձեռնարկում է նման իրավիճակի համար պայմանագրով նախատեսված միջոցները և Վաճառողի նկատմամբ կիրառում է պայմանագրով նախատեսված պատասխանատվության միջոցներ։
                                <br/><span style="margin-left: 25px;"/>5.4. Եթե պայմանագրի 5.2 կետով սահմանված ժամկետում Գնորդը չի ընդունում մատակարարված ապրանքը կամ չի մերժում դրա ընդունումը, ապա մատակարարված ապրանքը համարվում է ընդունված և պայմանագրի 5.2 կետով սահմանված վերջնաժամկետին հաջորդող աշխատանքային օրը Գնորդը էլեկտրոնային գնումների համակարգի միջոցով Վաճառողին է տրամադրում իր կողմից ստորագրված հանձնման-ընդունման արձանագրությունը:
                        </template>
                        <template v-else style="">
                                <span style="margin-left: 25px;"/>5.1. Մատակարարված ապրանքն ընդունվում է Գնորդի և Վաճառողի միջև հանձնման-ընդունման արձանագրության ստորագրմամբ: Ապրանքը Գնորդին հանձնելու փաստը ֆիքսվում է Գնորդի և Վաճառողի միջև երկկողմ հաստատված փաստաթղթով՝ նշելով փաստաթղթի կազմման ամսաթիվը:
                                <br/><span style="margin-left: 25px;"/>
                                Մինչև պայմանագրով ապրանքի մատակարարման համար նախատեսված օրը ներառյալ Վաճառողը Գնորդին է տրամադրում իր կողմից ստորագրված` ապրանքը Գնորդին հանձնելու փաստը ֆիքսող փաստաթուղթը (հավելված N 3.1) և հանձնման-ընդունման արձանագրության 
                                <input type="text"
                                    v-model="$v.inputs.copyCount.$model"
                                    ref="copyCount"
                                    inputName="copyCount"
                                    class="editor-input"
                                    style="width: 30px;border-top: 0 !important; border-left: 0 !important; border-right: 0 !important; text-align: right;   
                                    font-size: 13px;
                                    color: #303e67;
                                    border-bottom: 1px solid black" 
                                    onkeypress="this.style.width = ((this.value.length + 1) * 8 + 2) + 'px';"
                                />
                                օրինակ (հավելված N 3):
                                <br/><span style="margin-left: 25px;"/>5.2. Հանձնման-ընդունման արձանագրությունը ստորագրվում է, եթե մատակարարված ապրանքը համապատասխանում է պայմանագրի պայմաններին։ Հակառակ դեպքում պայմանագրի կամ դրա մի մասի կատարման արդյունքները չեն ընդունվում, հանձնման-ընդունման արձանագրությունը չի ստորագրվում և Գնորդը`
                                <br/><span style="margin-left: 25px;"/>ա) հարցի կարգավորման համար ձեռնարկում է նման իրավիճակի համար պայմանագրով նախատեսված միջոցները.
                                <br/><span style="margin-left: 25px;"/>բ) Վաճառողի նկատմամբ կիրառում է պայմանագրով նախատեսված պատասխանատվության միջոցներ։
                                <br/><span style="margin-left: 25px;"/>
                                5.3. Գնորդը հանձնման-ընդունման արձանագրությունը ստանալու օրվան հաջորդող աշխատանքային օրվանից հաշված
                                <input type="text"
                                    class="editor-input"
                                    v-model="$v.inputs.daysCount.$model"
                                    ref="daysCount"
                                    inputName="daysCount"
                                    style="width: 30px;border-top: 0 !important; border-left: 0 !important; border-right: 0 !important; text-align: right;   
                                    font-size: 13px;
                                    color: #303e67;
                                    border-bottom: 1px solid black"
                                    onkeypress="this.style.width = ((this.value.length + 1) * 8 + 2) + 'px';"
                                />
                                աշխատանքային օրվա ընթացքում Վաճառողին է ներկայացնում իր կողմից ստորագրված հանձնման-ընդունման արձանագրության մեկ օրինակը կամ ապրանքը չընդունելու պատճառաբանված մերժումը։
                                <br/><span style="margin-left: 25px;"/>5.4. Եթե պայմանագրի 5.3 կետով սահմանված ժամկետում Գնորդը չի ընդունում մատակարարված ապրանքը կամ չի մերժում դրա ընդունումը, ապա մատակարարված ապրանքը համարվում է ընդունված և պայմանագրի 5.3 կետով սահման­ված վերջնաժամկետին հաջորդող աշխատանքային օրը Գնորդը Վաճառողին է տրամադրում իր կողմից ստորագրված հանձնման-ընդունման արձանա­գրությունը: 
                        </template>
                    </h6>
                </div>
                <div class="info-block">
                    <p style="font-weight: 700; text-align: center;">6. ԿՈՂՄԵՐԻ ՊԱՏԱՍԽԱՆԱՏՎՈՒԹՅՈՒՆԸ</p>
                    <h6 style="margin-top: 3rem; text-align: justify;  margin-top: 0; margin-bottom: 30px;">
                        <span style="margin-left: 25px;"/>6.1. Վաճառողը պատասխանատվություն է կրում հանձնած ապրանքի որակի և պայմանագրով նախատեսված մատակարարման ժամկետների պահպանման համար։
                        <br/><span style="margin-left: 25px;"/>6.2. Վաճառողի կողմից պայմանագրով նախատեսված ապրանքի մատակարարման ժամկետների խախտման դեպքում Վաճառողից յուրաքանչյուր ուշացված աշխատանքային օրվա համար գանձվում է տույժ` մատակարարման ենթակա, սակայն չմատակարարված ապրանքի գնի 0,05 (զրո ամբողջ հինգ հարյուրերրորդական) տոկոսի  չափով։
                        <br/><span style="margin-left: 25px;"/>6.3. Պայմանագրի 1.1 կետում նշված տեխնիկական բնութագրին չհամապատասխանող ապրանք մատակարարելու յուրաքանչյուր դեպքում Վաճառողից գանձվում է տուգանք` պայմանագրի գնի 0,5 (զրո ամբողջ հինգ տասնորդական) տոկոսի  չափով: Ընդ որում տուգանքը հաշվարկվում է նաև ապրանքի մատակարարումը սույն պայմանագրով սահմանված ժամկետում կատարելու, սակայն պատվիրատուի կողմից այդ չընդունվելու դեպքում: 
                        <br/><span style="margin-left: 25px;"/>6.4. Պայմանագրի 6.2 և 6.3 կետերով նախատեսված տույժը և տուգանքը հաշվարկվում և հաշվանցվում են Վաճառողին վճարման ենթակա գումարների հետ։
                        <br/><span style="margin-left: 25px;"/>6.5. Գնորդի կողմից պայմանագրի 3.2 կետով նախատեսված ժամկետի խախտման համար Գնորդի նկատմամբ յուրաքանչյուր ուշացված աշխատանքային օրվա համար հաշվարկվում է տույժ` վճարման ենթակա, սակայն չվճարված գումարի 0,05 (զրո ամբողջ հինգ հարյուրերրորդական) տոկոսի  չափով։
                        <br/><span style="margin-left: 25px;"/>6.6. Պայմանագրով չնախատեսված դեպքերում կողմերն իրենց պարտավորությունները չկատարելու կամ ոչ պատշաճ կատարելու համար պատասխանատվություն են կրում ՀՀ օրենսդրությամբ սահմանված կարգով։
                        <br/><span style="margin-left: 25px;"/>6.7. Տույժերի և (կամ) տուգանքի վճարումը Կողմերին չի ազատում իրենց պայմանագրային պարտվորությունները լրիվ կատարելուց։
                    </h6>
                </div>
                <div class="info-block">
                    <p style="font-weight: 700; text-align: center;">7. ԱՆՀԱՂԹԱՀԱՐԵԼԻ ՈՒԺԻ ԱԶԴԵՑՈՒԹՅՈՒՆԸ (ՖՈՐՍ-ՄԱԺՈՐ)</p>
                    <h6 style="margin-top: 3rem; text-align: justify;  margin-top: 0; margin-bottom: 30px;">
                        <span style="margin-left: 25px;"/>Պայմանագրով պարտավորություններն ամբողջությամբ կամ մասնակիորեն չկատարելու համար կողմերն ազատվում են պատասխանատվությունից, եթե դա եղել է անհաղթահարելի ուժի ազդեցության հետևանքով, որը ծագել է սույն պայմանագիրը կնքելուց հետո, և որը կողմերը  չէին կարող կանխատեսել կամ կանխարգելել։ Այդպիսի իրավիճակներ են երկրաշարժը, ջրհեղեղը, հրդեհը, պատերազմը, ռազմական և արտակարգ դրություն հայտարարելը, քաղաքական հուզումները, գործադուլները, հաղորդակցության միջոցների աշխատանքի դադարեցումը, պետական մարմինների ակտերը և այլն, որոնք անհնարին են դարձնում սույն պայմանագրով պարտավորությունների կատարումը։ Եթե արտակարգ ուժի ազդեցությունը շարունակվում է 3 (երեք) ամսից ավելի, ապա կողմերից յուրաքանչյուրն իրավունք ունի լուծել պայմանագիրը` այդ մասին նախապես տեղյակ պահելով մյուս կողմին։
                    </h6>
                </div>
                <div class="info-block">
                    <p style="font-weight: 700; text-align: center;">8. ԱՅԼ ՊԱՅՄԱՆՆԵՐ</p>
                    <h6 style="margin-top: 3rem; text-align: justify;  margin-top: 0; margin-bottom: 30px;">
                        <span style="margin-left: 25px;"/>8.1 Պայմանագիրն ուժի մեջ է մտնում Կողմերի ստորագրման պահից և գործում է մինչև կողմերի` պայմանագրով ստանձնած պարտավորությունների ողջ ծավալով կատարումը։
                        <template v-if="currentOrganized.rights_responsibilities_fulfillment">
                            <br/><span style="margin-left: 25px;"/>Պայմանագրով նախատեսված կողմերի իրավունքների և պարտականությունների կատարման պայման է հանդիսանում պայմանագիրը ՀՀ ֆինանսների նախարարության կողմից հաշվառված լինելու հանգամանքը:
                        </template>
                        <br/><span style="margin-left: 25px;"/>8.2. Պայմանագրից ծագած` կողմի վճարային պարտավորությունը չի կարող դադարել այլ պայմանագրից ծագած` հակընդդեմ պարտավորության հաշվանցով, առանց կողմերի գրավոր և կնիքով հաստատված համաձայնության։ Պայմանագրից ծագած պահանջի իրավունքը չի կարող փոխանցվել այլ անձի, առանց պարտապան կողմի գրավոր համաձայնության։
                        <br/><span style="margin-left: 25px;"/>8.3. Այն դեպքում, երբ օրենքով նախատեսված կարգով օրենքի պահանջների կատարման նկատմամբ հսկողության կամ վերահսկողության կամ բողոքների քննության արդյունքում արձանագրվում է, որ պայմանագիրը կնքելու նպատակով կազմակերպված գնման գործընթացում, մինչև պայմանագրի կնքումը, Վաճառողը ներկայացրել է կեղծ փաստաթղթեր (տեղեկություններ և տվյալներ), կամ վերջինիս ընտրված մասնակից ճանաչելու մասին որոշումը չի համապատասխանում Հայաստանի Հանրապետության օրենսդրությանը, ապա այդ հիմքերն ի հայտ գալուց հետո Գնորդը միակողմանիորեն լուծում է պայմանագիրը, եթե արձանագրված խախտումները մինչև պայմանագրի կնքումը հայտնի լինելու դեպքում գնումների մասին Հայաստանի Հանրապետության օրենսդրության համաձայն հիմք կհանդիսանային պայմանագիրը չկնքելու համար։ Ընդ որում, Գնորդը չի կրում պայմանագրի միակողմանի լուծման հետևանքով Վաճառողի համար առաջացող վնասների կամ բաց թողնված օգուտի ռիսկը, իսկ վերջինս պարտավոր է Հայաստանի Հանրապետության օրենքով սահմանված կարգով փոխհատուցել իր մեղքով Գնորդի կրած վնասներն այն ծավալով, որի մասով պայմանագիրը լուծվել է։
                        <br/><span style="margin-left: 25px;"/>8.4. Պայմանագրի հետ կապված վեճերը ենթակա են քննության Հայաստանի Հանրապետության դատարաններում։
                        <br/><span style="margin-left: 25px;"/>8.5. Պայմանագրում փոփոխություններ և լրացումներ կարող են կատարվել միայն Կողմերի փոխադարձ համաձայնությամբ` համաձայնագիր կնքելու միջոցով, որը կհանդիսանա պայմանագրի անբաժանելի մասը։
                        <br/><span style="margin-left: 25px;"/>Արգելվում է պայմանագրում, իսկ եթե պայմանագրի գինը գործոնային է, ապա նաև այդ պայմանագրին կից հաջորդող յուրաքանչյուր տարիներին կնքված համաձայնագրում կատարել այնպիսի փոփոխություններ, որոնք հանգեցնում են գնվող ապրանքի ծավալների կամ ձեռք բերվող ապրանքի միավորի գնի կամ պայմանագրի գնի արհեստական փոփոխման։
                        <br/><span style="margin-left: 25px;"/>Պայմանագրի կողմերից անկախ գործոնների ազդեցությամբ պայմանագրի փոփոխման յուրաքանչյուր դեպք սահմանում է Հայաստանի Հանրապետության կառավարությունը։
                        <div class="is-agency-agreement">
                            <span style="color: rgb(17, 85, 204);">
                                <span style="margin-left: 25px;"/>8.6. Եթե պայմանագիրն  իրականացվում է գործակալության պայմանագիր կնքելու միջոցով.
                            </span>
                            <p style="color: rgb(17, 85, 204);margin-bottom: 0;">
                                <span style="margin-left: 25px;"/>1) Վաճառողը պատասխանատվություն է կրում գործակալի պարտավորությունների չկատարման կամ ոչ պատշաճ կատարման համար.
                            </p>
                            <p style="color: rgb(17, 85, 204);margin-bottom: 0;">
                                <span style="margin-left: 25px;"/>2) պայմանագրի կատարման ընթացքում գործակալի փոփոխման դեպքում Վաճառողը գրավոր տեղեկացնում է Գնորդին՝ տրամադրելով գործակալության պայմանագրի պատճենը և դրա կողմ հանդիսացող անձի տվյալները՝ փոփոխությունը կատարվելու օրվանից  հինգ աշխատանքային օրվա ընթացքում:
                            </p>
                            <p style="color: rgb(17, 85, 204);margin-bottom: 0;">
                                <span style="margin-left: 25px;"/>8.7. Եթե պայմանագիրն  իրականացվում է համատեղ գործունեության (կոնսորցիումի) պայմանագիր կնքելու միջոցով, ապա այդ պայմանագրի մասնակիցները կրում են համատեղ և համապարտ պատասխանատվություն: Ընդ որում, կոնսորցիումի անդամի կոնսորցիումից դուրս գալու դեպքում պայմանագիրը միակողմանիորեն լուծվում է և կոնսորցիումի անդամների նկատմամբ կիրառվում են պայմանագրով նախատեսված պատասխանատվության միջոցները:
                            </p>
                        </div>
                        <br/><span style="margin-left: 25px;"/>8.8. Ապրանքի մատակարարման ժամկետը կարող է երկարաձգվել մինչև պայմանագրով այդ ժամկետը լրանալը` Վաճառողի առաջարկության առկայության դեպքում, պայմանով, որ Գնորդի մոտ չի վերացել ապրանքի օգտագործման պահանջը, իսկ Վաճառողի առաջարկությունը ներկայացվել է ոչ ուշ, քան պայմանագրով ի սկզբանե մատակարարման համար սահմանված ժամկետը լրանալուց առնվազն 5 օրացուցային օր առաջ: Ընդ որում սույն կետով սահմանված դեպքում ապրանքի մատակարարման ժամկետը կարող է երկարաձգվել մեկ անգամ մինչև 30 օրացուցային օրով, բայց ոչ ավել քան պայմանագրով սահմանված ժամկետն է:
                        <br/><span style="margin-left: 25px;"/>8.9. Պայմանագրի պատշաճ կատարման պայմաններում կողմերի (Վաճառող կամ Գնորդ) օգուտները (խնայողություններ) կամ կրած վնասները տվյալ կողմի օգուտը կամ կրած վնասն են։
                        <br/><span style="margin-left: 25px;"/>Պայմանագրի կողմերի` երրորդ անձանց նկատմամբ պարտավորությունները՝ ներառյալ պայմանագրի կատարման շրջանակում Վաճառողի կնքած այլ գործարքները և դրանցից բխող պարտավորությունները, դուրս են պայմանագրի կարգավորման դաշտից և չեն կարող ազդել պայմանագրի կատարման արդյունքն ընդունելու վրա։ Այդ գործարքների և դրանցից բխող պարտավորությունների կատարման հետ կապված հարաբերությունները կարգավորվում են այդ գործարքների հետ կապված հարաբերությունները կարգավորող նորմերով, և դրանց համար պատասխանատու է Վաճառողը։
                        <br/><span style="margin-left: 25px;"/>8.10. Պայմանագիրը չի կարող փոփոխվել կողմերի պարտա­վորու­թյունների մասնակի չկատարման հետևանքով կամ ամբողջությամբ լուծվել կողմերի փոխադարձ համաձայնությամբ՝ բացառությամբ` Հայաստանի Հանրապետության օրենսդրությամբ սահմանված կարգով ապրանքի մատակարարման համար անհրաժեշտ ֆինանսական հատկացումների նվազեցման դեպքերի: Ընդ որում, պայմանագրի կողմերի` պարտավորությունների մասնակի չկատարման կամ ամբողջությամբ լուծման կողմերի փոխադարձ համաձայնությունն անհրաժեշտ է ձեռք բերել նախքան Հայաստանի Հանրապետության օրենսդրությամբ սահմանված կարգով ապրանքի մատակարարման համար անհրաժեշտ ֆինանսական հատկացումների նվազեցումը:
                        <br/><span style="margin-left: 25px;"/>8.11. Վաճառողի  կողմից ստանձնած պարտավորությունները չկատա­րելու կամ ոչ պատշաճ կատարելու հիմքով պայմանագիրն ամբողջությամբ կամ մասնակի միակողմանի լուծելու մասին ծանուցումը Գնորդը հրապարակում է www.procurement.am հասցեով գործող ինտերնետային կայքի «Պայմանագրերը միակողմանի լուծելու մասին ծանուցումներ» բաժնում` նշելով հրապարակման ամսաթիվը: Վաճառողը, պայմանագիրը միակողմանի լուծելու վերաբերյալ, համարվում է պատշաճ ծանուցված` ծանուցումը, սույն կետով սահմանված հրապարակվելուն հաջորդող օրվանից: Պայմանագիրն ամբողջությամբ կամ մասնակի միակողմանի լուծելու մասին ծանուցումը տեղեկագրում հրապարակվելու օրը Գնորդը այն ուղարկվում է նաև Վաճառողի էլեկտրոնային փոստին:
                        <br/><span style="margin-left: 25px;"/>8.12. Պայմանագրի կապակցությամբ ծագած վեճերը լուծվում են բանակցությունների միջոցով։ Համաձայնություն ձեռք չբերելու դեպքում վեճերը լուծվում են դատական կարգով։
                        <br/><span style="margin-left: 25px;"/>8.13. Սույն պայմանագիրը կազմված է <span class="pages-count">__</span> էջից, կնքվում է երկու օրինակից, որոնք ունեն հավասարազոր իրավաբանական ուժ, յուրաքանչյուր կողմին տրվում է մեկական օրինակ։ Պայմանագրի N 1, N 2, N 3 և N 3.1 հավելվածները, համարվում են պայմանագրի անբաժանելի մասը։
                        <br/><span style="margin-left: 25px;"/>8.14. Պայմանագրի հետ կապված հարաբերությունների նկատմամբ կիրառվում է Հայաստանի Հանրապետության իրավունքը։
                        <template v-if="currentOrganized.is_with_condition && Number(currentOrganized.organize_type) === 1"> 
                            <br/><span style="margin-left: 25px;"/>8.12. Պայմանագրի կապակցությամբ ծագած վեճերը լուծվում են բանակցությունների միջոցով։ Համաձայնություն ձեռք չբերելու դեպքում վեճերը լուծվում են դատական կարգով։
                        </template>
                        <template v-if="currentOrganized.is_with_condition && currentOrganized.rows_total_price < 25000000" style="text-align: left">
                            <span style="color: rgb(17, 85, 204);">
                                <br/><span style="margin-left: 25px;"/>8.15 Պայմանագրով նախատեսված ապրանքների մատակարարումն իրականացվում է այդ նպատակով ֆինանսական միջոցների առկայության և դրա հիման վրա կողմերի միջև համապատասխան համաձայնագրի կնքման միջոցով: Պայմանագիրը լուծվում է, եթե այն կնքելու օրվան հաջորդող վեց ամսվա ընթացքում այդ նպատակով պայմանագրի կատարման համար ֆինանսական միջոցներ չեն նախատեսվում: Ընդ որում, Վաճառողը համաձայնագիրը կնքում և Գնորդին ներկայացնում է համաձայնագիր կնքելու ծանուցումը ստանալու օրվանից տասնհինգ աշխատանքային օրվա ընթացքում։ Հակառակ դեպքում պայմանագիրը Գնորդի կողմից միակողմանիորեն լուծվում է:
                            </span>
                        </template>
                        <template v-else-if="currentOrganized.is_with_condition" style="text-align: left">
                            <span style="color: rgb(17, 85, 204);">
                                <br/><span style="margin-left: 25px;"/>8.15. Պայմանագրով նախատեսված ապրանքների մատակարարումն իրականացվում է այդ նպատակով ֆինանսական միջոցների առկայության և դրա հիման վրա կողմերի միջև համապատասխան համաձայնագրի կնքման միջոցով: Պայմանագիրը լուծվում է, եթե այն կնքելու օրվան հաջորդող վեց ամսվա ընթացքում այդ նպատակով պայմանագրի կատարման համար ֆինանսական միջոցներ չեն նախատեսվում: Ընդ որում յուրաքանչյուր հաջորդ համաձայնագիրը կնքելու համար ֆինանսական միջոցների նախատեսման համար սույն կետով տրված վեցամսյա ժամանակահատվածի հաշվարկը սկսվում նախորդ համաձայնագրով սահմանված ապրանքի մատակարարման արդյունքը ողջ ծավալով պատվիրատուի կողմից ընդունվելու օրվանից: Եթե պայմանագրի կատարման համար հատկացված ֆինանսական միջոցների չափը գերազանցում է գնումների բազային միավորի քսանհինգապատիկը, ապա Գնորդի կողմից համաձայնագիր կկնքվի, եթե Վաճառողի կողմից տուժանքի ձևով ներկայացված որակավորման և պայմանագրի ապահովումները փոխարինվում են երաշխիքով կամ կանխիկ փողով` հաշվի առնելով ՀՀ կառավարության 2017 թվականի մայիսի 4-ի N 526-Ն որոշման N 1 հավելվածի 32-րդ կետի 1-ին ենթակետի «գ» և 17-րդ ենթակետի «բ» պարբերությունների պահանջները: Ընդ որում, Վաճառողը համաձայնագիրը կնքում, իսկ  տուժանքի ձևով ներկայացված որակավորման և պայմանագրի ապահովումների փոխարինման դեպքում նաև նոր ապահովները Գնորդին ներկայացնում է համաձայնագիր կնքելու ծանուցումը ստանալու օրվանից տասնհինգ աշխատանքային օրվա ընթացքում։ Հակառակ դեպքում պայմանագիրը Գնորդի կողմից միակողմանիորեն լուծվում է:
                            </span>
                        </template>
                    </h6>
                </div>
		        <div class="html2pdf__page-break"/>
                <div class="info-block">
                    <h6 style="margin-top: 3rem; text-align: center; font-weight: 700; ">
                    9. Կողմերի հասցեները, բանկային վավերապայմանները և ստորագրությունները
                    </h6>
                    <div class="col-md-12 row d-flex justify-content-center info-block">
                        <table style="width: 100%; border: none !important">
                            <tbody>
                                <tr>
                                    <td style="border:none !important;">
                                        <div>
                                            <h6 class="ft-11" style="text-align: right; font-weight: 700; ">ԳՆՈՐԴ</h6>
                                            <p class="ft-11" style="font-size: 14px; text-align: right; ">« {{ me.organisation[0].translations.name.hy }} » {{ me.organisation[0].translations.company_type.hy }}</p>
                                            <p class="ft-11" style="font-size: 14px; text-align: right; " v-if=" me.organisation[0].translations.region.hy === me.organisation[0].translations.city.hy ">  {{ me.organisation[0].translations.city.hy }} {{ me.organisation[0].translations.address.hy }}</p>
                                            <p class="ft-11" style="font-size: 14px; text-align: right; " v-else> {{ me.organisation[0].translations.region.hy }}  {{ me.organisation[0].translations.city.hy }} {{ me.organisation[0].translations.address.hy }} </p>
                                            <p class="ft-11" style="font-size: 14px; text-align: right; ">Բանկ՝ {{ me.organisation[0].translations.bank_name.hy }}</p>
                                            <p class="ft-11" style="font-size: 14px; text-align: right; ">Հ/Հ {{ me.organisation[0].bank_account }} </p>
                                            <p class="ft-11" style="font-size: 14px; text-align: right; ">ՀՎՀՀ {{ me.organisation[0].tin }} </p>
                                            <p class="ft-11" style="font-size: 14px; text-align: right; ">{{ me.organisation[0].translations.director_position.hy }}՝ {{ me.organisation[0].translations.director_name.hy }}</p>
                                            <p class="ft-11" style="font-size: 14px; text-align: right; ">______________________</p>
                                            <p style="font-size: 14px; text-align: right; ">ստորագրություն</p>
                                        </div>
                                    </td>
                                    <td style="border:none !important;padding-left: 80px">
                                        <div>
                                            <h6 class="ft-11" style="text-align: left; font-weight: 700; ">ՎԱՃԱՌՈՂ</h6>
                                            <p class="ft-11" style="font-size: 14px; text-align: left; "><span class="winner-name">______________</span></p>
                                            <p class="ft-11" style="font-size: 14px; text-align: left; "><span class="winner-address">_____________________</span></p>
                                            <p class="ft-11" style="font-size: 14px; text-align: left; ">Բանկ՝<span class="winner-bank">___________</span></p>
                                            <p class="ft-11" style="font-size: 14px; text-align: left; ">Հ/Հ <span class="winner-bank_account">_____________________</span></p>
                                            <p class="ft-11" style="font-size: 14px; text-align: left; ">ՀՎՀՀ <span class="winner-tin">______________</span></p>
                                            <p class="ft-11" style="font-size: 14px; text-align: left; ">Տնօրեն՝ <span class="winner-director">_____________________</span></p>
                                            <p class="ft-11" style="font-size: 14px; text-align: left; ">______________________</p>
                                            <p style="font-size: 14px; text-align: left; ">ստորագրություն</p>
                                        </div>
                                    </td>
                                </tr>
                            </tbody>
                        </table>
                    </div>
                    <h6 style="text-align: center; margin-bottom: 3rem; ">
                    Անհրաժեշտության դեպքում պայմանագրում կարող են ներառվել ՀՀ օրենսդրությանը չհակասող դրույթներ։
                    </h6>
                </div>
		        <div class="html2pdf__page-break"/>
                <div class="info-block">
                    <div style="text-align: right; margin-top: 3rem; ">Հավելված  N 1</div>
                    <div style="text-align: right; "><span class="contract-code" style="color: rgb(17, 85, 204);"></span> ծածկագրով</div>
                    <div style="text-align: right; "><span style="color: rgb(17, 85, 204);"><span class="getContractType"></span></span> պայմանագրի</div>
                    <h6 style="text-align: center; font-weight: 700; ">ՏԵԽՆԻԿԱԿԱՆ ԲՆՈՒԹԱԳԻՐ - ԳՆՄԱՆ ԺԱՄԱՆԱԿԱՑՈՒՅՑ*</h6>
                    <p style="text-align: right; ">ՀՀ դրամ <span style="margin-left: 25px;"/></p>
                    <table style="font-size: 10px;
                                width: 100%;
                                table-layout: fixed;
                                border-collapse: collapse;
                                page-break-inside: avoid;
                                border: 1px solid black;
                                text-align: center;" cellspacing="5" cellpadding="5" class="ft-5">
                        <tbody>
                            <tr>
                                <td colspan="12" style="border: 1px solid black;
                                                        border-collapse: collapse;
                                                        text-align: center;">Ապրանքի</td>
                            </tr>
                            <tr>
                                <td rowspan="2" style="border: 1px solid black;
                                                       border-collapse: collapse;
                                                       text-align: center;">Չ/Հ</td>
                                <td rowspan="2" style="border: 1px solid black;
                                                       border-collapse: collapse;
                                                       text-align: center;">CPV կոդ</td>
                                <td rowspan="2" style="border: 1px solid black;
                                                       border-collapse: collapse;
                                                       text-align: center;">անվանումը</td>
                                <td rowspan="2" style="border: 1px solid black;
                                                       border-collapse: collapse;
                                                       text-align: center;"><span style="color: rgb(17, 85, 204);">ապրանքային նշանը, ֆիրմային անվանումը, մոդելը և արտադրողի անվանումը **</span></td>
                                <td rowspan="2" style="border: 1px solid black;
                                                       border-collapse: collapse;
                                                       text-align: center;">տեխնիկական բնութագիրը</td>
                                <td rowspan="2" style="border: 1px solid black;
                                                       border-collapse: collapse;
                                                       text-align: center;">չափման միավորը</td>
                                <td rowspan="2" style="border: 1px solid black;
                                                       border-collapse: collapse;
                                                       text-align: center;">միավոր գինը/ՀՀ դրամ</td>
                                <td rowspan="2" style="border: 1px solid black;
                                                       border-collapse: collapse;
                                                       text-align: center;">ընդհանուր գինը/ՀՀ դրամ</td>
                                <td rowspan="2" style="border: 1px solid black;
                                                       border-collapse: collapse;
                                                       text-align: center;">ընդհանուր քանակը</td>
                                <td colspan="3" style="border: 1px solid black;
                                                       border-collapse: collapse;
                                                       text-align: center;">մատակարարման</td>
                            </tr>
                            <tr>	
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">հասցեն</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">ենթակա քանակը</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">Ժամկետը</td>
                            </tr>
                        </tbody>
                        <tbody class="purchase-schedule">
                            <tr v-for="(row, rowIndex) in currentOrganized.organize_rows" :key="rowIndex">
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{ rowIndex + 1 }}</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{ row.procurement_plan.cpv.code }}{{ row.procurement_plan.cpv_drop && '/' }}{{ row.procurement_plan.cpv_drop }}</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{ row.procurement_plan.cpv.name }}</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">&nbsp;&nbsp;&nbsp;</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{ row.procurement_plan.specifications.description.hy }}</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{ row.procurement_plan.unit }}</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">
                                </td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">
                                </td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{ row.count }}</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"
                                    v-if="me.organisation[0].translations.region.hy === me.organisation[0].translations.city.hy">
                                Ք.
                                    {{ me.organisation[0].translations.city.hy }}
                                    {{ me.organisation[0].translations.address.hy }}
                                </td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"
                                    v-else>
                                    {{ me.organisation[0].translations.region.hy }}

                                    ք.

                                    {{ me.organisation[0].translations.city.hy }}
                                    {{ me.organisation[0].translations.address.hy }}
                                </td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{row.supply || ''}}</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{row.supply_date || ''}}</td>
                            </tr>
                        </tbody>
                    </table>
                    <p style="text-align: justify;">*Ապրանքի մատակարարման ժամկետը, իսկ փուլային մատակարարման դեպքում` առաջին փուլի մատակարարման ժամկետը, պետք է սահմանվի առնվազն 20 օրացուցային օր, որի հաշվարկը կատարվում է պայմանագրով նախատեսված կողմերի իրավունքների և պարտականությունների կատարման պայմանն ուժի մեջ մտնելու օրը, բացառությամբ այն դեպքի, երբ ընտրված մասնակիցը համաձայնում է ապրանքը մատակարարել ավելի կարճ ժամկետում: Մատակարարման վերջնաժամկետը չի կարող ավել լինել, քան տվյալ տարվա դեկտեմբերի 25-ը:</p>
                    <p style="text-align: justify;">
                        <span style="color: rgb(17, 85, 204); text-align: justify;">
                            ** Եթե ընտրված մասնակցի հայտով  ներկայավել է մեկից ավելի արտադրողների կողմից արտադրված, ինչպես նաև տարբեր ապրանքային նշան, ֆիրմային անվանում և մոդել ունեցող ապրանքներ, ապա դրանցից բավարար գնահատվածները ներառվում են սույն հավելվածում: Եթե հրավերով չի նախատեսվում մասնակցի կողմից առաջարկվող ապրանքի՝ ապրանքային նշանի, ֆիրմային անվանման, մոդելի և արտադրողի վերաբերյալ տեղեկատվության ներկայացում, ապա հանվում են «ապրանքային նշանը, ֆիրմային անվանումը, մոդելը և արտադրողի անվանումը » սյունակը: 
                        </span>
                    </p>
                    <p style="text-align: justify;">
                        <span style="color: rgb(17, 85, 204); text-align: justify;">
                            Պայմանագրով նախատեսված դեպքում Վաճառողը Գնորդին ներկայացնում է նաև ապրանքն արտադրողից կամ վերջինիս ներկայացուցչից երաշխիքային նամակի կամ համապատասխանության սերտիֆիկատ:
                        </span>
                    </p>
                    <p v-if="currentOrganized.is_with_condition" style="font-family: GHEA grapalat; text-align: justify;">
                        <span style="color: rgb(17, 85, 204); text-align: justify;">
                            *** Եթե պայմանագիրը կնքվում է "Գնումների մասին" ՀՀ օրենքի 15-րդ հոդվածի 6-րդ մասի հիման վրա, ապա սյունակում ժամկետի հաշվարկը սահմանվում է օրացուցային օրերով՝ հաշվարկն իրականացնելով ֆինանսական միջոցներ նախատեսվելու դեպքում կողմերի միջև կնքվող համաձայնագրի ուժի մեջ մտնելու օրվանից:
                        </span>
                    </p>
                    <div class="col-md-12 row d-flex justify-content-center info-block">
                        <table style="width: 100%; border: none !important">
                            <tbody>
                                <tr>
                                    <td style="border:none !important;">
                                        <div>
                                            <h6 class="ft-11" style="text-align: right; font-weight: 700; ">ԳՆՈՐԴ</h6>
                                            <p class="ft-11" style="font-size: 14px; text-align: right; ">« {{ me.organisation[0].translations.name.hy }} » {{ me.organisation[0].translations.company_type.hy }}</p>
                                            <p class="ft-11" style="font-size: 14px; text-align: right; " v-if=" me.organisation[0].translations.region.hy === me.organisation[0].translations.city.hy ">  {{ me.organisation[0].translations.city.hy }} {{ me.organisation[0].translations.address.hy }}</p>
                                            <p class="ft-11" style="font-size: 14px; text-align: right; " v-else> {{ me.organisation[0].translations.region.hy }}  {{ me.organisation[0].translations.city.hy }} {{ me.organisation[0].translations.address.hy }} </p>
                                            <p class="ft-11" style="font-size: 14px; text-align: right; ">Բանկ՝ {{ me.organisation[0].translations.bank_name.hy }}</p>
                                            <p class="ft-11" style="font-size: 14px; text-align: right; ">Հ/Հ {{ me.organisation[0].bank_account }} </p>
                                            <p class="ft-11" style="font-size: 14px; text-align: right; ">ՀՎՀՀ {{ me.organisation[0].tin }} </p>
                                            <p class="ft-11" style="font-size: 14px; text-align: right; ">{{ me.organisation[0].translations.director_position.hy }}՝ {{ me.organisation[0].translations.director_name.hy }}</p>
                                            <p class="ft-11" style="font-size: 14px; text-align: right; ">______________________</p>
                                            <p style="font-size: 14px; text-align: right; ">ստորագրություն</p>
                                        </div>
                                    </td>
                                    <td style="border:none !important;padding-left: 80px">
                                        <div>
                                            <h6 class="ft-11" style="text-align: left; font-weight: 700; ">ՎԱՃԱՌՈՂ</h6>
                                            <p class="ft-11" style="font-size: 14px; text-align: left; "><span class="winner-name">______________</span></p>
                                            <p class="ft-11" style="font-size: 14px; text-align: left; "><span class="winner-address">_____________________</span></p>
                                            <p class="ft-11" style="font-size: 14px; text-align: left; ">Բանկ՝<span class="winner-bank">___________</span></p>
                                            <p class="ft-11" style="font-size: 14px; text-align: left; ">Հ/Հ <span class="winner-bank_account">_____________________</span></p>
                                            <p class="ft-11" style="font-size: 14px; text-align: left; ">ՀՎՀՀ <span class="winner-tin">______________</span></p>
                                            <p class="ft-11" style="font-size: 14px; text-align: left; ">Տնօրեն՝ <span class="winner-director">_____________________</span></p>
                                            <p class="ft-11" style="font-size: 14px; text-align: left; ">______________________</p>
                                            <p style="font-size: 14px; text-align: left; ">ստորագրություն</p>
                                        </div>
                                    </td>
                                </tr>
                            </tbody>
                        </table>
                    </div>
                </div>
		        <div class="html2pdf__page-break"/>
                <div class="info-block" v-if="currentOrganized.is_with_condition && Number(currentOrganized.organize_type) === 1">
                    <div style="text-align: right; margin-top: 3rem; ">Հավելված  N 1.1</div>
                    <div style="text-align: right; "><span class="contract-code" style="color: rgb(17, 85, 204);"></span> ծածկագրով</div>
                    <div style="text-align: right; "><span style="color: rgb(17, 85, 204);"><span class="getContractType"></span></span> պայմանագրի</div>
                    <br/>
                    <div style="font-weight: 700; text-align: center; ">ՑԱՆԿ</div>
                    <div style="font-weight: 700; text-align: center; ">հայաստանյան ծագում ունեցող ապրանքների  և աշխատանքային ռեսուրսների</div>
                    <br/>
                    <table style="width: 100%;
                                table-layout: fixed;
                                border-collapse: collapse;
                                page-break-inside: avoid;
                                border: 1px solid black;
                                text-align: center;" cellspacing="8" cellpadding="8">
                        <tbody>
                            <tr>
                                <th colspan="4" style="border: 1px solid black;
                                                       border-collapse: collapse;">Չափաբաժնի N՝</th>
                            </tr>
                            <tr>
                                <th colspan="3" style="border: 1px solid black;
                                                       border-collapse: collapse;">հայաստանյան ծագում ունեցող ապրանքների</th>
                                <th rowspan="2" style="border: 1px solid black;
                                                       border-collapse: collapse;">աշխատակիցների քանակը, որոնց միջոցով պետք է ապահովվի պայմանագրի կատարումը</th>
                            </tr>
                            <tr>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"><span style="color: rgb(17, 85, 204);">Անվանում</span></td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"><span style="color: rgb(17, 85, 204);">Քանակ</span></td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"><span style="color: rgb(17, 85, 204);">Գումար</span></td>
                            </tr>
                            <tr>
                                <td style="padding:20px;
                                           border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"><span style="color: rgb(17, 85, 204);">__</span></td>
                                <td style="padding:20px;
                                           border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"><span style="color: rgb(17, 85, 204);">__</span></td>
                                <td style="padding:20px;
                                           border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"><span style="color: rgb(17, 85, 204);">__</span></td>
                                <td style="padding:20px;
                                           border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"><span style="color: rgb(17, 85, 204);">__</span></td>
                            </tr>
                            <tr>
                                <td style="padding:20px;
                                           border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="padding:20px;
                                           border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="padding:20px;
                                           border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="padding:20px;
                                           border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                            </tr>
                            <tr>
                                <td style="padding:20px;
                                           border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="padding:20px;
                                           border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="padding:20px;
                                           border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="padding:20px;
                                           border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                            </tr>
                        </tbody>
                    </table>
                    <div class="col-md-12 row d-flex justify-content-center info-block">
                        <table style="width: 100%; border: none !important">
                            <tbody>
                                <tr>
                                    <td style="border:none !important;">
                                        <div>
                                            <h6 class="ft-11" style="text-align: right; font-weight: 700; ">ԳՆՈՐԴ</h6>
                                            <p class="ft-11" style="font-size: 14px; text-align: right; ">« {{ me.organisation[0].translations.name.hy }} » {{ me.organisation[0].translations.company_type.hy }}</p>
                                            <p class="ft-11" style="font-size: 14px; text-align: right; " v-if=" me.organisation[0].translations.region.hy === me.organisation[0].translations.city.hy ">  {{ me.organisation[0].translations.city.hy }} {{ me.organisation[0].translations.address.hy }}</p>
                                            <p class="ft-11" style="font-size: 14px; text-align: right; " v-else> {{ me.organisation[0].translations.region.hy }}  {{ me.organisation[0].translations.city.hy }} {{ me.organisation[0].translations.address.hy }} </p>
                                            <p class="ft-11" style="font-size: 14px; text-align: right; ">Բանկ՝ {{ me.organisation[0].translations.bank_name.hy }}</p>
                                            <p class="ft-11" style="font-size: 14px; text-align: right; ">Հ/Հ {{ me.organisation[0].bank_account }} </p>
                                            <p class="ft-11" style="font-size: 14px; text-align: right; ">ՀՎՀՀ {{ me.organisation[0].tin }} </p>
                                            <p class="ft-11" style="font-size: 14px; text-align: right; ">{{ me.organisation[0].translations.director_position.hy }}՝ {{ me.organisation[0].translations.director_name.hy }}</p>
                                            <p class="ft-11" style="font-size: 14px; text-align: right; ">______________________</p>
                                            <p style="font-size: 14px; text-align: right; ">ստորագրություն</p>
                                        </div>
                                    </td>
                                    <td style="border:none !important;padding-left: 80px">
                                        <div>
                                            <h6 class="ft-11" style="text-align: left; font-weight: 700; ">ՎԱՃԱՌՈՂ</h6>
                                            <p class="ft-11" style="font-size: 14px; text-align: left; "><span class="winner-name">______________</span></p>
                                            <p class="ft-11" style="font-size: 14px; text-align: left; "><span class="winner-address">_____________________</span></p>
                                            <p class="ft-11" style="font-size: 14px; text-align: left; ">Բանկ՝<span class="winner-bank">___________</span></p>
                                            <p class="ft-11" style="font-size: 14px; text-align: left; ">Հ/Հ <span class="winner-bank_account">_____________________</span></p>
                                            <p class="ft-11" style="font-size: 14px; text-align: left; ">ՀՎՀՀ <span class="winner-tin">______________</span></p>
                                            <p class="ft-11" style="font-size: 14px; text-align: left; ">Տնօրեն՝ <span class="winner-director">_____________________</span></p>
                                            <p class="ft-11" style="font-size: 14px; text-align: left; ">______________________</p>
                                            <p style="font-size: 14px; text-align: left; ">ստորագրություն</p>
                                        </div>
                                    </td>
                                </tr>
                            </tbody>
                        </table>
                    </div>
                </div>
		        <div class="html2pdf__page-break"/>
                <div class="info-block">
                    <div style="text-align: right; margin-top: 3rem; ">Հավելված  N 2</div>
                    <div style="text-align: right; "><span class="contract-code" style="color: rgb(17, 85, 204);"></span> ծածկագրով</div>
                    <div style="text-align: right; "><span style="color: rgb(17, 85, 204);"><span class="getContractType"></span></span> պայմանագրի</div>
                    <br class="page-break"/>
                    <h6 style="margin-top: 3rem; text-align: center; font-weight: 700; ">
                        ՎՃԱՐՄԱՆ ԺԱՄԱՆԱԿԱՑՈՒՅՑ*
                    </h6>
                    <table style="font-size: 10px;
                                width: 100%;
                                table-layout: fixed;
                                border-collapse: collapse;
                                page-break-inside: avoid;
                                border: 1px solid black;
                                text-align: center;" cellspacing="5" cellpadding="5" class="ft-5"> 
                        <tbody><tr>
                            <th rowspan="2" style="border: 1px solid black;
                                                   border-collapse: collapse;">Չ/Հ</th>
                            <th rowspan="2" style="border: 1px solid black;
                                                   border-collapse: collapse;">CPV կոդ</th>
                            <th rowspan="2" style="border: 1px solid black;
                                                   border-collapse: collapse;">անվանումը</th>
                            <th colspan="13" style="border: 1px solid black;
                                                    border-collapse: collapse;">դիմաց վճարումները նախատեսվում է իրականացնել <span style="color: rgb(17, 85, 204);"><span>{{new Date().getFullYear()}}</span>թ</span>-ին` ըստ ամիսների, այդ թվում**</th>
                        </tr>
                        <tr>
                            <td style="border: 1px solid black;
                                       border-collapse: collapse;
                                       writing-mode: vertical-lr;
                                       text-align: center;"><span style="color: rgb(17, 85, 204);">հունվար</span></td>
                            <td style="border: 1px solid black;
                                       border-collapse: collapse;
                                       writing-mode: vertical-lr;
                                       text-align: center;"><span style="color: rgb(17, 85, 204);">փետրվար</span></td>
                            <td style="border: 1px solid black;
                                       border-collapse: collapse;
                                       writing-mode: vertical-lr;
                                       text-align: center;"><span style="color: rgb(17, 85, 204);">մարտ</span></td>
                            <td style="border: 1px solid black;
                                       border-collapse: collapse;
                                       writing-mode: vertical-lr;
                                       text-align: center;"><span style="color: rgb(17, 85, 204);">ապրիլ</span></td>
                            <td style="border: 1px solid black;
                                       border-collapse: collapse;
                                       writing-mode: vertical-lr;
                                       text-align: center;"><span style="color: rgb(17, 85, 204);">մայիս</span></td>
                            <td style="border: 1px solid black;
                                       writing-mode: vertical-lr;
                                       border-collapse: collapse;"><span style="color: rgb(17, 85, 204);">հունիս</span></td>
                            <td style="border: 1px solid black;
                                       writing-mode: vertical-lr;
                                       border-collapse: collapse;
                                       text-align: center;"><span style="color: rgb(17, 85, 204);">հուլիս</span></td>
                            <td style="border: 1px solid black;
                                       border-collapse: collapse;
                                       writing-mode: vertical-lr;
                                       text-align: center;"><span style="color: rgb(17, 85, 204);">օգոստոս</span></td>
                            <td style="border: 1px solid black;
                                       border-collapse: collapse;
                                       writing-mode: vertical-lr;
                                       text-align: center;"><span style="color: rgb(17, 85, 204);">սեպտեմբեր</span></td>
                            <td style="border: 1px solid black;
                                       border-collapse: collapse;
                                       writing-mode: vertical-lr;
                                       text-align: center;"><span style="color: rgb(17, 85, 204);">հոկտեմբեր</span></td>
                            <td style="border: 1px solid black;
                                       border-collapse: collapse;
                                       writing-mode: vertical-lr;
                                       text-align: center;"><span style="color: rgb(17, 85, 204);">նոյեմբեր</span></td>
                            <td style="border: 1px solid black;
                                       border-collapse: collapse;
                                       writing-mode: vertical-lr;
                                       text-align: center;"><span style="color: rgb(17, 85, 204);">դեկտեմբեր</span></td>
                            <td style="border: 1px solid black;
                                       border-collapse: collapse;
                                       writing-mode: vertical-lr;
                                       text-align: center;"><span style="color: rgb(17, 85, 204);">Ընդամենը</span></td>
                        </tr>
                    </tbody>
                    <tbody class="payment-schedule">
                        <tr v-for="(row, rowIndex) in currentOrganized.organize_rows" :key="rowIndex">
                            <td style="border: 1px solid black;
                                       border-collapse: collapse;
                                       text-align: center;">{{ rowIndex + 1 }}</td>
                            <td style="border: 1px solid black;
                                       border-collapse: collapse;
                                       text-align: center;">{{ row.procurement_plan.cpv_outside ? row.procurement_plan.cpv_outside.code : row.procurement_plan.cpv.code }}{{ row.procurement_plan.cpv_drop && '/' }}{{ row.procurement_plan.cpv_drop }}</td>
                            <td style="border: 1px solid black;
                                       border-collapse: collapse;
                                       text-align: center;">{{ row.procurement_plan.cpv_outside ? row.procurement_plan.cpv_outside.name : row.procurement_plan.cpv.name }}</td>
                            <template v-if="row.organize_row_percent">
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{ row.organize_row_percent.month_1 !== null ? row.organize_row_percent.month_1 + '%'  : '-' }}</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse; 
                                           text-align: center;">{{ row.organize_row_percent.month_2 !== null ? row.organize_row_percent.month_2 + '%'  : '-' }}</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{ row.organize_row_percent.month_3 !== null ? row.organize_row_percent.month_3 + '%'  : '-' }}</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{ row.organize_row_percent.month_4 !== null ? row.organize_row_percent.month_4 + '%'  : '-' }}</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{ row.organize_row_percent.month_5 !== null ? row.organize_row_percent.month_5 + '%'  : '-' }}</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{ row.organize_row_percent.month_6 !== null ? row.organize_row_percent.month_6 + '%'  : '-' }}</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{ row.organize_row_percent.month_7 !== null ? row.organize_row_percent.month_7 + '%'  : '-' }}</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{ row.organize_row_percent.month_8 !== null ? row.organize_row_percent.month_8 + '%'  : '-' }}</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{ row.organize_row_percent.month_9 !== null ? row.organize_row_percent.month_9 + '%'  : '-' }}</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{ row.organize_row_percent.month_10 !== null ? row.organize_row_percent.month_10 + '%'  : '-' }}</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{ row.organize_row_percent.month_11 !== null ? row.organize_row_percent.month_11 + '%'  : '-' }}</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{ row.organize_row_percent.month_12 !== null ? row.organize_row_percent.month_12 + '%'  : '-' }}</td>
                                <td v-if="row.organize_row_percent.month_1 === null && row.organize_row_percent.month_2 === null && row.organize_row_percent.month_3 === null && row.organize_row_percent.month_4 === null && row.organize_row_percent.month_5 === null && row.organize_row_percent.month_6 === null && row.organize_row_percent.month_7 === null && row.organize_row_percent.month_8 === null && row.organize_row_percent.month_9 === null && row.organize_row_percent.month_10 === null && row.organize_row_percent.month_11 === null && row.organize_row_percent.month_12 === null" 
                                style="border: 1px solid black;
                                       border-collapse: collapse;
                                       text-align: center;">-</td>
                                <td v-else style="border: 1px solid black;
                                                  border-collapse: collapse;
                                                  text-align: center;"> 100% </td> 
                            </template>
                            <template v-else>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                            </template>   
                        </tr>
                    </tbody>
                    </table>
                    <p style="">
                        * Վճարման ենթակա գումարները ներկայացվում են աճողական կարգով:
                        <span v-if="currentOrganized.is_with_condition" style="color: rgb(17, 85, 204);"> 
                        Եթե պայմանագիրը կնքվում է "Գնումների մասին" ՀՀ օրենքի 15-րդ հոդվածի 6-րդ մասի հիման վրա, ապա սույն ժամանակացույցը լրացվում և կնքվում է ֆինանսական միջոցներ նախատեսվելու դեպքում կողմերի միջև կնքվող համաձայնագրի հետ միաժամանակ` որպես դրա անբաժանելի մաս:
                        </span>
                    </p>
                    <p style="text-align: justify">
                        ** հրավերում գումարները նշվում են տոկոսով, իսկ պայմանագիրը կնքելիս տոկոսի փոխարեն նշվում է կոնկրետ գումարի չափ
                    </p>
                    <div class="col-md-12 row d-flex justify-content-center info-block">
                        <table style="width: 100%; border: none !important">
                            <tbody>
                                <tr>
                                    <td style="border:none !important;">
                                        <div>
                                            <h6 class="ft-11" style="text-align: right; font-weight: 700; ">ԳՆՈՐԴ</h6>
                                            <p class="ft-11" style="font-size: 14px; text-align: right; ">« {{ me.organisation[0].translations.name.hy }} » {{ me.organisation[0].translations.company_type.hy }}</p>
                                            <p class="ft-11" style="font-size: 14px; text-align: right; " v-if=" me.organisation[0].translations.region.hy === me.organisation[0].translations.city.hy ">  {{ me.organisation[0].translations.city.hy }} {{ me.organisation[0].translations.address.hy }}</p>
                                            <p class="ft-11" style="font-size: 14px; text-align: right; " v-else> {{ me.organisation[0].translations.region.hy }}  {{ me.organisation[0].translations.city.hy }} {{ me.organisation[0].translations.address.hy }} </p>
                                            <p class="ft-11" style="font-size: 14px; text-align: right; ">Բանկ՝ {{ me.organisation[0].translations.bank_name.hy }}</p>
                                            <p class="ft-11" style="font-size: 14px; text-align: right; ">Հ/Հ {{ me.organisation[0].bank_account }} </p>
                                            <p class="ft-11" style="font-size: 14px; text-align: right; ">ՀՎՀՀ {{ me.organisation[0].tin }} </p>
                                            <p class="ft-11" style="font-size: 14px; text-align: right; ">{{ me.organisation[0].translations.director_position.hy }}՝ {{ me.organisation[0].translations.director_name.hy }}</p>
                                            <p class="ft-11" style="font-size: 14px; text-align: right; ">______________________</p>
                                            <p style="font-size: 14px; text-align: right; ">ստորագրություն</p>
                                        </div>
                                    </td>
                                    <td style="border:none !important;padding-left: 80px">
                                        <div>
                                            <h6 class="ft-11" style="text-align: left; font-weight: 700; ">ՎԱՃԱՌՈՂ</h6>
                                            <p class="ft-11" style="font-size: 14px; text-align: left; "><span class="winner-name">______________</span></p>
                                            <p class="ft-11" style="font-size: 14px; text-align: left; "><span class="winner-address">_____________________</span></p>
                                            <p class="ft-11" style="font-size: 14px; text-align: left; ">Բանկ՝<span class="winner-bank">___________</span></p>
                                            <p class="ft-11" style="font-size: 14px; text-align: left; ">Հ/Հ <span class="winner-bank_account">_____________________</span></p>
                                            <p class="ft-11" style="font-size: 14px; text-align: left; ">ՀՎՀՀ <span class="winner-tin">______________</span></p>
                                            <p class="ft-11" style="font-size: 14px; text-align: left; ">Տնօրեն՝ <span class="winner-director">_____________________</span></p>
                                            <p class="ft-11" style="font-size: 14px; text-align: left; ">______________________</p>
                                            <p style="font-size: 14px; text-align: left; ">ստորագրություն</p>
                                        </div>
                                    </td>
                                </tr>
                            </tbody>
                        </table>
                    </div>
                </div>
		        <div class="html2pdf__page-break"/>
                <div class="info-block">
                    <div style="text-align: right; margin-top: 3rem; ">Հավելված  N 3</div>
                    <div style="text-align: right; "><span class="contract-code" style="color: rgb(17, 85, 204);"></span> ծածկագրով</div>
                    <div style="text-align: right; "><span style="color: rgb(17, 85, 204);"><span class="getContractType"></span></span> պայմանագրի</div>
                    <br/>
                    <table style="width: 100%; border: none !important">
                        <tbody>
                            <tr>
                                <td style="border:none !important;">
                                    <div style="text-align: right">	
                                        <p class="ft-11" style="font-size: 14px; font-weight: 700; ">Պայմանագրի կողմ </p>
                                        <p class="ft-11" style="font-size: 14px; ">_____________________________ </p>
                                        <p class="ft-11" style="font-size: 14px; ">_____________________________ </p>
                                        <p class="ft-11" style="font-size: 14px; ">գտնվելու վայրը__________</p>
                                        <p class="ft-11" style="font-size: 14px; ">հհ __________________________</p>
                                        <p class="ft-11" style="font-size: 14px; ">հվհհ _______________________ </p>
                                    </div>
                                </td>
                                <td style="border:none !important;padding-left: 80px">
                                    <div style="text-align: left">	
                                        <p class="ft-11" style="font-size: 14px; font-weight: 700; ">Պատվիրատու</p>
                                        <p class="ft-11" style="font-size: 14px; ">_____________________________ </p>
                                        <p class="ft-11" style="font-size: 14px; ">_____________________________ </p>
                                        <p class="ft-11" style="font-size: 14px; ">գտնվելու վայրը__________</p>
                                        <p class="ft-11" style="font-size: 14px; ">հհ __________________________</p>
                                        <p class="ft-11" style="font-size: 14px; ">հվհհ _______________________ </p>
                                    </div>
                                </td>
                            </tr>
                        </tbody>
                    </table>
                </div>
		        <div class="html2pdf__page-break"/>
                <div class="info-block">
                    <h6 style="font-weight: 700; text-align: center; margin-top: 3rem; ">ԱՐՁԱՆԱԳՐՈՒԹՅՈՒՆ N</h6>
                    <h6 style="font-weight: 700; text-align: center; ">ՊԱՅՄԱՆԱԳՐԻ ԿԱՄ ԴՐԱ ՄԻ ՄԱՍԻ ԿԱՏԱՐՄԱՆ ԱՐԴՅՈՒՆՔՆԵՐԻ</h6>
                    <h6 style="font-weight: 700; text-align: center; ">ՀԱՆՁՆՄԱՆ-ԸՆԴՈՒՆՄԱՆ</h6>
                    <h6 style=""><span style="margin-left: 25px;" />«<span style="margin-left: 25px;" />  	»<span style="margin-left: 25px;" /> «<span style="margin-left: 25px;" />  » <span style="margin-left: 25px;" /> 20	թ.</h6>
                    <h6 style="">Պայմանագրի <span style="margin-left: 25px;" />/այսուհետ`<span style="margin-left: 25px;" /> Պայմանագիր/ <span style="margin-left: 25px;" />անվանումը` </h6>
                    <h6 style="">______________________________________________________________________________________</h6>
                    <h6 style="">Պայմանագրի կնքման ամսաթիվը` «____» «__________________» 20 թ.</h6>
                    <h6 style="">Պայմանագրի համարը`<span style="margin-left: 25px;"/>	__________</h6>
                    <h6 style="">Պատվիրատուն  և  Պայմանագրի կողմը՝  հիմք  ընդունելով  պայմանագրի  կատարման  վերաբերյալ    <span style="margin-left: 25px;" />  «   <span style="margin-left: 25px;" />    »   <span style="margin-left: 25px;" />   «  	      <span style="margin-left: 25px;" />          »  <span style="margin-left: 25px;" />20   <span style="margin-left: 25px;" />  թ. դուրս գրված N ___   հաշիվ ապրանքագիրը, կազմեցին սույն արձանագրությունը հետևյալի մասին.</h6>
                    <h6 style="">Պայմանագրի շրջանակներում Պայմանագրի կողմը  մատակարարել է հետևյալ ապրանքները՝</h6>
                    <table style="width: 100%;
                                table-layout: fixed;
                                border-collapse: collapse;
                                page-break-inside: avoid;
                                border: 1px solid black;
                                text-align: center;" cellspacing="8" cellpadding="8">
                            <tbody>
                            <tr>
                                <th rowspan="3" style=" border: 1px solid black;
                                                        border-collapse: collapse;">N</th>
                                <th colspan="8" style=" border: 1px solid black;
                                                        border-collapse: collapse;">Մատակարարված ապրանքների</th>
                            </tr>
                            <tr>
                                <th rowspan="2" style=" border: 1px solid black;
                                                        border-collapse: collapse;">անվանումը</th>
                                <th rowspan="2" style=" border: 1px solid black;
                                                        border-collapse: collapse;">տեխնիկական բնութագրի համառոտ շարադրանքը</th>
                                <th colspan="2" style=" border: 1px solid black;
                                                        border-collapse: collapse;">քանակական ցուցանիշը
                                </th>
                                <th colspan="2" style=" border: 1px solid black;
                                                        border-collapse: collapse;">կատարման ժամկետը</th>
                                <th rowspan="2" style=" border: 1px solid black;
                                                        border-collapse: collapse;">Վճարման ենթակա գումարը /հազար դրամ/</th>
                                <th rowspan="2" style=" border: 1px solid black;
                                                        border-collapse: collapse;">Վճարման ժամկետը /ըստ վճարման ժամանակացույցի/</th>
                            </tr>
                            <tr>
                                <th style=" border: 1px solid black;
                                            border-collapse: collapse;">պայմանագրով հաստատված գնման ժամանակացույցի</th>
                                <th style=" border: 1px solid black;
                                            border-collapse: collapse;">փաստացի</th>
                                <th style=" border: 1px solid black;
                                            border-collapse: collapse;"> ըստ պայմանագրով հաստատված գնման ժամանակացույցի</th>
                                <th style=" border: 1px solid black;
                                            border-collapse: collapse;">փաստացի</th>
                            </tr>
                            <tr>
                                <td style="padding: 20px;
                                           border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="padding: 20px;
                                           border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="padding: 20px;
                                           border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="padding: 20px;
                                           border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="padding: 20px;
                                           border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="padding: 20px;
                                           border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="padding: 20px;
                                           border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="padding: 20px;
                                           border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="padding: 20px;
                                           border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                            </tr>
                            <tr>
                                <td style="padding: 20px;
                                           border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="padding: 20px;
                                           border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="padding: 20px;
                                           border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="padding: 20px;
                                           border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="padding: 20px;
                                           border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="padding: 20px;
                                           border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="padding: 20px;
                                           border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="padding: 20px;
                                           border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="padding: 20px;
                                           border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                            </tr>
                        </tbody>
                    </table>
                    <p style="text-align: justify;"> Սույն արձանագրության երկկողմ հաստատման համար հիմք հանդիսացած հաշիվ ապրանքագիրը և դրական եզրակացությունը հանդիսանում են սույն արձանագրության բաղկացուցիչ մասը և կցվում են:</p>
                    <div class="col-md-12 d-flex" style="margin-bottom: 3rem">
                        <table style="width: 100%; border: none !important">
                            <tbody>
                                <tr>
                                    <td style="border:none !important;">
                                        <div style="margin-top: 1.5rem">
                                            <h6 class="ft-11" style="text-align: right; font-weight: 700; ">Ապրանքը հանձնեց<span style="margin-left: 25px;"/></h6>
                                            <p  style="text-align: right; font-weight: 700; margin-top: 1.5rem; ">	---------------------------------</p>
                                            <p  style="text-align: right; ">/ստորագրություն/<span style="margin-left: 25px;"/></p>
                                            <p  style="text-align: right; font-weight: 700; margin-top: 1.5rem; ">	---------------------------------</p>
                                            <p  style="text-align: right; ">ազգանուն, անուն<span style="margin-left: 25px;"/></p>
                                        </div>
                                    </td>
                                    <td style="border:none !important;padding-left: 80px">
                                        <div style="margin-top: 1.5rem">
                                            <h6 class="ft-11" style="text-align: left; font-weight: 700; "><span style="margin-left: 25px;"/>Ապրանքը ընդունեց</h6>
                                            <p style="text-align: left; font-weight: 700; margin-top: 1.5rem; ">	---------------------------------</p>
                                            <p style="text-align: left; "><span style="margin-left: 25px;"/>/ստորագրություն/</p>
                                            <p style="text-align: left; font-weight: 700; margin-top: 1.5rem; ">	---------------------------------</p>
                                            <p style="text-align: left; margin-left: 25px; ">ազգանուն, անուն<span style="margin-left: 25px;"/></p>
                                        </div>
                                    </td>
                                </tr>
                            </tbody>
                        </table>
                    </div>
                </div>
		        <div class="html2pdf__page-break"/>
                <div class="info-block">
                    <div style="text-align: right; margin-top: 3rem; ">Հավելված  N 3.1</div>
                    <div style="text-align: right; "><span class="contract-code" style="color: rgb(17, 85, 204);"></span> ծածկագրով</div>
                    <div style="text-align: right; "><span style="color: rgb(17, 85, 204);"><span class="getContractType"></span></span> պայմանագրի</div>
                    <h6 style="text-align: center; font-weight: 700; ">ԱԿՏ	N  </h6>
                    <div style="text-align: center; font-weight: 700; ">պայմանագրի արդյունքը Գնորդին հանձնելու փաստը ֆիքսելու վերաբերյալ </div>
                    <h6 style="">Սույնով արձանագրվում է, որ _____________________________-ի (այսուհետ` Գնորդ) և   ________________________-</h6>
                    <p style="font-size: 14px;"><span style="margin-left: 25px;"/><span style="margin-left: 25px;"/><span style="margin-left: 25px;"/><span style="margin-left: 25px;"/><span style="margin-left: 25px;"/><span style="margin-left: 25px;"/><span style="margin-left: 25px;"/><span style="margin-left: 25px;"/><span style="margin-left: 25px;"/>Գնորդի անվանումը  <span style="margin-left: 25px;"/><span style="margin-left: 25px;"/><span style="margin-left: 25px;"/><span style="margin-left: 25px;"/><span style="margin-left: 25px;"/><span style="margin-left: 25px;"/><span style="margin-left: 25px;"/><span style="margin-left: 25px;"/><span style="margin-left: 25px;"/>Վաճառողի անվանումը </p>
                    <h6 style="">(այսուհետ` Վաճառող) միջև 20 <span style="margin-left: 25px;"/>    թ.<span style="margin-left: 25px;"/>     ___________________--ին կնքված N  <span style="margin-left: 25px;"/>  ___________________</h6>
                    <p style="font-size: 14px; ">
                        <span style="margin-left: 25px;"/><span style="margin-left: 25px;"/><span style="margin-left: 25px;"/><span style="margin-left: 25px;"/><span style="margin-left: 25px;"/><span style="margin-left: 25px;"/><span style="margin-left: 25px;"/><span style="margin-left: 25px;"/><span style="margin-left: 25px;"/>
                        պայմանագրի կնքման ամսաթիվը
                        <span style="margin-left: 25px;"/><span style="margin-left: 25px;"/><span style="margin-left: 25px;"/><span style="margin-left: 25px;"/><span style="margin-left: 25px;"/><span style="margin-left: 25px;"/>
                        պայմանագրի համարը
                    </p>
                    <h6 style="">
                        պայմանագրի շրջանակներում Վաճառողը  20 <span style="margin-left: 25px;"/> թ.__________________-ին հանձնման-ընդունման նպատակով 
                    </h6>
                    <h6 style=""> Գնորդին հանձնեց ստորև նշված ապրանքները. </h6>
                    <table style="width: 100%;
                                table-layout: fixed;
                                border-collapse: collapse;
                                page-break-inside: avoid;
                                border: 1px solid black;
                                text-align: center;" cellspacing="8" cellpadding="8">
                        <tbody><tr>
                            <th colspan="3" style="border: 1px solid black;
                                                   border-collapse: collapse;">Ապրանքի</th>
                        </tr>
                        <tr>
                            <th style="border: 1px solid black;
                                       border-collapse: collapse;">անվանումը</th>
                            <th style="border: 1px solid black;
                                       border-collapse: collapse;">չափման միավորը</th>
                            <th style="border: 1px solid black;
                                       border-collapse: collapse;">քանակը (փաստացի)</th>
                        </tr>
                        <tr>
                            <td style="padding:20px;    
                                       border: 1px solid black;
                                       border-collapse: collapse;
                                       text-align: center;"></td>
                            <td style="padding:20px;
                                       border: 1px solid black;
                                       border-collapse: collapse;
                                       text-align: center;"></td>
                            <td style="padding:20px;
                                       border: 1px solid black;
                                       border-collapse: collapse;
                                       text-align: center;"></td>
                        </tr>
                        <tr>
                            <td style="padding:20px;
                                       border: 1px solid black;
                                       border-collapse: collapse;
                                       text-align: center;"></td>
                            <td style="padding:20px;
                                       border: 1px solid black;
                                       border-collapse: collapse;
                                       text-align: center;">
                            </td>
                            <td style="padding:20px;
                                       border: 1px solid black;
                                       border-collapse: collapse;
                                       text-align: center;"></td>
                        </tr>
                    </tbody></table>
                    <h6 style="">Սույն ակտը կազմված է 2 օրինակից, յուրաքանչյուր կողմին տրամադրվում է մեկական օրինակ:</h6>
                    <div class="col-md-12 d-flex" style="margin-bottom: 3rem">
                        <table style="width: 100%; border: none !important">
                            <tbody>
                                <tr>
                                    <td style="border:none !important;">
                                        <div style="width: 50%; text-align: left;">
                                            <h6 class="ft-11" style="text-align: right; font-weight: 700; margin-bottom: 35px; ">Ապրանքը հանձնեց<span style="margin-left: 25px;"/></h6>
                                            <p style="text-align: right; font-weight: 700; margin-top: 1.5rem; ">	---------------------------------</p>
                                            <p style="text-align: right; ">ազգանուն, անուն<span style="margin-left: 25px;"/></p>
                                            <p style="text-align: right; font-weight: 700; margin-top: 1.5rem; ">	---------------------------------</p>
                                            <p style="text-align: right; ">/ստորագրություն/<span style="margin-left: 25px;"/></p>
                                        </div>
                                    </td>
                                    <td style="width: 50%;">
                                        <div style="margin-top: 1.5rem; text-align: right;">
                                            <h6 class="ft-11" style="text-align: left; font-weight: 700; "><span style="margin-left: 25px;"/>Ընդունեց <br> հայտը նախագծած ներկայացուցիչ`</h6>
                                            <p style="text-align: left; font-weight: 700; margin-top: 1.5rem; ">	---------------------------------</p>
                                            <p style="text-align: left; ">ազգանուն, անուն<span style="margin-left: 25px;"/></p>
                                            <p style="text-align: left; font-weight: 700; margin-top: 1.5rem; ">	---------------------------------</p>
                                            <p style="text-align: left; "><span style="margin-left: 25px;"/>/ստորագրություն/</p>
                                        </div>
                                    </td>
                                </tr>
                            </tbody>
                        </table>
                    </div>
                </div>
            </div>
        </section>
    </div>
</template>

<script>
import { required } from "vuelidate/lib/validators";
import purchaseTypesLongNamesCased from '@/mixins/purchaseTypes'
import $ from 'jquery';

export default {
    name: 'contract_draft_product',
    mixins: [purchaseTypesLongNamesCased],
    props: ['handleLoaded','handleLoading', 'handleLoadingStart', 'handleLoadingEnd'],
    data() {
        return {
            inputs: {
                // work_type: null,
                // option1: '',
                copyCount: null,
                daysCount: null,
                violationDays: null,
                violationDays_1: null,
                calendar_days: null,
                workersCount: null,
            },
            participants: [],
            getOrgnizeTypeByPlan: '',
            participantsSequence: [],
            totalMembers: 0,
        }
    },
    validations() {
        const rules = {
            inputs: {
                violationDays: { required },
                violationDays_1: { required },
                workersCount: { required },
                daysCount: { required }
            }
        }
        if(+this.currentOrganized.organize_type === 0){
            Object.assign(rules.inputs, {
                copyCount: { required },
            })
        }
        if(this.organizedRows[0].is_main_tool === 1){
            Object.assign(rules.inputs, {
                calendar_days: { required },
            })
        }

        return rules;
    },
    mounted() { 
        this.$store.dispatch('organize/getCurrent', this.$route.params.id)
        const locale = 'hy'
        this.purchaseType = this.organizedRows[0].type
        this.getOrgnizeTypeByPlan = this.purchaseTypesLongNamesCased[locale][this.purchaseType || 2]
    },
    computed: {
        currentOrganized() {
            return this.$store.getters['organize/currentOrganized']
        },
        organizedRows() {
            return this.$store.getters['organize/organizedRows']
        },
        userChildren() {
            return this.$store.getters['user/userChildren']
        },
        me() {
            return this.$store.getters['user/me']
        },
    },
    watch: {
        currentOrganized: {
            immediate: true,
            async handler() {
                this.$store.dispatch('organize/getRows', {organizeId: this.$route.params.id})
                this.handleLoaded()
            },
        },
    },
    methods: {
        save() {
            this.$v.inputs.$touch();
            const _this = this
            let hasInvalid = false;
            $('#commandment-file .editor-input').each(function() {
                const inputName = $(this).attr('inputname');
                const input = _this.$v.inputs[inputName];
                if (input.$error) {
                    hasInvalid = true;
                    if(_this.$refs[inputName]._isVue) {
                        _this.$refs[inputName].$el.focus()
                    } else {
                        _this.$refs[inputName].focus();
                    }
                    return false;
                }
            });
            if(!hasInvalid){
                this.handleLoadingStart()
                this.handleLoading(true)
                $('.editor-input').each(function() {
                    const txt = $(this).val()
                    $(this).after(txt)
                    $(this).remove()
                });

                $('.editor-option').each(function(index) {
                    const inputNumber = index+1
                    const optionValue = $(`.option-${inputNumber}:checked`).val()
                    const notSelectedOptionValue = +optionValue === 1 ? 2 : 1
                    $(`.option-${inputNumber}-variant-${notSelectedOptionValue}`).remove()
                    $(`.option-${inputNumber}`).remove()
                });
                 this.$client.put(`organize/${this.currentOrganized.id}`, {contract_html_hy: $('#commandment-file').html()}).then(({ status, data }) => {
                    // eslint-disable-next-line eqeqeq
                    if(status == 200) {
                    this.$store.commit('organize/setCurrentOrganized', data.data)
                        this.$notify({
                            group: 'foo',
                            type: 'success',
                            text: 'Հաջողությամբ թարմացված է'
                        })
                        this.handleLoading(false)
                        this.$modal.hide('new-editor-modal')
                    }
                    this.isSaving = false
                    this.handleLoadingEnd()
                }).catch(e => {
                    this.handleLoadingEnd()
                    this.$notify({
                        group: 'foo',
                        type: 'error',
                        title: 'Ինչ որ բան այն չէ',
                        text: 'Կրկին փորձեք!'
                    })
                    this.isSaving = false
                })
            }
        },
        consoleLog(msg) {
            console.log(msg)
        },
        calculateMonthPrice(price, percent){
            return price*percent/100
        },
    },
}
</script>
<style>
.option-box *{
    color: grey;
}
.option-box-selected *{
    color: red;
}
</style>
<style scoped>
    *{
        font-family: GHEA grapalat  !important;
    }
</style>