<template>
    <div id="commandment-file" ref="contract"
        style="line-height: 2; width: 100%">
        <section slot="pdf-content" contenteditable="true">
            <div class="col-md-12">
                <div class="info-block">
                    <div style="text-align: right;font-weight: 700;">Приложение N 6</div>
                    <div style="text-align: right;font-weight: 700;">К Приглашению на <span style="color: rgb(17, 85, 204);"><span class="getOrgnizeTypeByPlanRu">{{getOrgnizeTypeByPlan}}</span></span></div>
                    <div style="text-align: right;font-weight: 700;">Под кодом <span class="contract-code-ru" style="color: rgb(17, 85, 204);">«{{ currentOrganized.translations.code.ru }}»</span></div>
                    <br>
                    <h6 style="margin-top: 3rem; text-align: center; font-weight: 700">ДОГОВОР</h6>
                    <h6 style="text-align: center; font-weight: 700">ПОСТАВКИ ТОВАРА ДЛЯ НУЖД ГОСУДАРСТВА</h6>
                    <h6 style="text-align: center; font-weight: 700">N<span class="contract-code" style="color: rgb(17, 85, 204);"> {{ currentOrganized.translations.code.ru }}</span> </h6>
                    <div class="col-md-12 d-flex" style="padding: 0 !important;">
                        <table style="width: 100%; border: none !important">
                            <tbody>
                                <tr>
                                    <td style="border:none !important;">
                                        <div style="padding: 0 !important; text-align: left">
                                            <h6>г.<span class="ft-11" style="color: rgb(17, 85, 204);">{{ me.organisation[0].translations.city.ru }}</span></h6>
                                        </div>
                                    </td>
                                    <td>
                                        <div style="padding: 0 !important; text-align: right">
                                            <h6><span style="color: rgb(17, 85, 204);" class="sign-date">__.__.____</span>г.</h6>
                                        </div>
                                    </td>
                                </tr>
                            </tbody>
                        </table>
                    </div>
                    <h6 style="text-align: justify">
                        «<span style="color: rgb(17, 85, 204);">{{ me.organisation[0].translations.name.ru }}</span>», в лице {{ me.organisation[0].translations.director_position.ru }}а <span style="color: rgb(17, 85, 204);">{{ me.organisation[0].translations.director_name.ru }}</span>, действующего на основании устава
                        «<span style="color: rgb(17, 85, 204);">{{ me.organisation[0].translations.name.ru }}</span>» ,
                        далее — "Покупатель", с одной стороны, и 
                        <span class="winner-name">_______</span>, в лице директора <span class="winner-director">_______</span>, действующего на основании устава <span class="winner-name">_______</span>, далее — "Продавец", с другой стороны, заключили настоящий Договор о следующем
                    </h6>
                </div>
                <div class="info-block">
                    <h6 style="text-align: justify;"> <span style="margin-left: 25px;"/><p style="font-weight: 700;text-align: center; margin-top: 3rem;margin-bottom: 0;">1. ПРЕДМЕТ ДОГОВОРА</p>
                        <br/><span style="margin-left: 25px;"/>
                        1.1. Продавец обязуется в установленном настоящим Договором (далее — договор) порядке, объемах, сроки и по адресу поставить Покупателю товар (далее — товар), предусмотренный Технической характеристикой-графиком закупки, являющейся Приложением № 1 к договору, а Покупатель обязуется принять товар и заплатить за него.
                    </h6>
                </div>
                <div class="info-block">
                    <span style="margin-left: 25px;"/><p style="font-weight: 700; text-align: center; margin-bottom: 0;">2. ПРАВА И ОБЯЗАННОСТИ СТОРОН</p>
                    <span style="margin-left: 25px;"/><span style="font-weight: 700;">2.1. Покупатель имеет право:</span>
                    <h6 style="margin-top: 3rem; text-align: justify; margin-top: 0; margin-bottom: 20px;">
                        <span style="margin-left: 25px;"/>
                        2.1.1. Отказываться от товара в случае непоставки товара Продавцом в установленный договором срок, если сроки поставки были нарушены более чем на 
                        <input type="text"
                            class="editor-input"
                            v-model="$v.inputs.violationDays.$model"
                            ref="violationDays"
                            inputName="violationDays"
                            style="width: 30px;border-top: 0 !important; border-left: 0 !important; border-right: 0 !important;text-align: right;   
                            font-size: 13px;
                            color: #303e67;
                            border-bottom: 1px solid black" 
                            onkeypress="this.style.width = ((this.value.length + 1) * 8 + 2) + 'px';"
                        /> 
                        дней.
                        <br/><span style="margin-left: 25px;"/>2.1.2. Если передан товар ненадлежащего качества, не соответствующий предусмотренной договором технической характеристике:
                        <br/><span style="margin-left: 25px;"/>а) требовать возмещения расходов, произведенных им по причине ненадлежащего качества товара;
                        <br/><span style="margin-left: 25px;"/>б) не принимать товар, установив по своему усмотрению разумный срок безвозмездной замены товара ненадлежащего качества на товар соответствующего договору качества, и требовать у Продавца уплаты штрафа, предусмотренного пунктом 6.3 договора;
                        <br/><span style="margin-left: 25px;"/>в) отказываться от исполнения договора и требовать возврата уплаченной за товар суммы.
                        <br/><span style="margin-left: 25px;"/>2.1.3. Если передан товар в количестве меньше оговоренного в договоре, то:
                        <br/><span style="margin-left: 25px;"/>а) требовать восполнения недопереданного количества товара;
                        <br/><span style="margin-left: 25px;"/>б) отказываться от переданного товара и оплаты за него, а если товар оплачен, то требовать возврата уплаченной суммы и уплаты пени, предусмотренной пунктом 6.2 договора.
                        <br/><span style="margin-left: 25px;"/>2.1.4. Если передан товар с нарушением условия его вида, по своему усмотрению:
                        <br/><span style="margin-left: 25px;"/>а) принимать товар, соответствующий условию относительно его вида, и отказываться от остальных товаров;
                        <br/><span style="margin-left: 25px;"/>б) отказываться от всех переданных товаров и требовать уплаты пени, предусмотренной пунктом 6.2 договора;
                        <br/><span style="margin-left: 25px;"/>в) требовать безвозмездной замены товара, не соответствующего условию относительно его вида, на товар, соответствующий предусмотренному договором виду.
                        <br/><span style="margin-left: 25px;"/>2.1.5. В случае нарушения Продавцом сроков поставки, по своему усмотрению устанавливать новый срок поставки товара и требовать у Продавца уплаты пени, предусмотренной пунктом 6.2 договора.
                        <br/><span style="margin-left: 25px;"/>2.1.6. Требовать у Продавца возмещения убытков, если Покупатель в результате нарушения Продавцом обязательства, в разумный срок после расторжения договора приобрел у иного лица по более высокой, но разумной цене товар вместо предусмотренного договором товара, в размере разницы цены, установленной по договору, и заключенной вместо этого сделки, а также всех необходимых и разумных расходов, осуществленных им для приобретения товара у иного лица.
                        <br/><span style="margin-left: 25px;"/>2.1.7. В одностороннем порядке расторгать договор (полностью или частично), если Продавец существенным образом нарушил договор;
                        <br/><span style="margin-left: 25px;"/>2.1.7.1. Нарушение договора Продавцом считается существенным, если:
                        <br/><span style="margin-left: 25px;"/><span style="margin-left: 25px;"/>а) был поставлен товар ненадлежащего качества, который не может быть заменен в приемлемый для Покупателя срок;
                        <br/><span style="margin-left: 25px;"/><span style="margin-left: 25px;"/>
                        б) сроки поставки товара нарушены более чем 
                        <input type="text"
                            class="editor-input"
                            v-model="$v.inputs.violationDays_1.$model"
                            ref="violationDays_1"
                            inputName="violationDays_1"
                            style="width: 30px;border-top: 0 !important; border-left: 0 !important; border-right: 0 !important;text-align: right;   
                            font-size: 13px;
                            color: #303e67;
                            border-bottom: 1px solid black"  
                            onkeypress="this.style.width = ((this.value.length + 1) * 8 + 2) + 'px';"
                        /> на дней;
                        <br/><span style="margin-left: 25px;"/>2.1.8. Осматривать товар и незамедлительно уведомлять Продавца о выявленных дефектах.
                    </h6>
                    <span style="margin-left: 25px;"/><span style="font-weight: 700">2.2. Покупатель обязан:</span>
                    <h6 style="text-align: justify; margin-top: 0; margin-bottom: 20px;">
                        <span style="margin-left: 25px;"/>2.2.1. Выполнять все необходимые действия, обеспечивающие прием товара, поставленного в соответствии с договором.
                        <br/><span style="margin-left: 25px;"/>2.2.2. В случае отказа в соответствии с договором от переданного Продавцом товара обеспечивать ответственное хранение этого товара и незамедлительно уведомлять об этом Продавца.
                        <br/><span style="margin-left: 25px;"/>2.2.3. В случае приема товара, поставленного в предусмотренных договором порядке и сроках, уплачивать Продавцу суммы, подлежащие уплате последнему, а в случае нарушения срока — также предусмотренную пунктом 6.5 договора пеню.
                        <br/><span style="margin-left: 25px;"/>2.2.4. Уведомлять Продавца о нарушении условий договора относительно количества, ассортимента, качества товара сразу после выявления дефекта или в разумные сроки после того, когда нарушение соответствующего условия договора должно было быть выявлено, исходя из характера и значения товара.
                        <br/><span style="margin-left: 25px;"/>2.2.5. После расторжения договора согласно пункту 2.3.3 договора возмещать Продавцу причиненные последнему и обоснованные в установленном порядке убытки.
                    </h6>
                    <span style="margin-left: 25px;"/><span style="font-weight: 700">2.3. Продавец имеет право:</span>
                    <h6 style="text-align: justify; margin-top: 0; margin-bottom: 20px;">
                        <span style="margin-left: 25px;"/>2.3.1. Требовать у Покупателя принимать товар, поставленный в предусмотренные договором порядке, объемах, сроки и по адресу.
                        <br/><span style="margin-left: 25px;"/>2.3.2. Требовать у Покупателя платить суммы, подлежащие уплате ему за товар, поставленный в предусмотренном договором порядке, объемах, сроки и по адресу и принятый Покупателем.
                        <br/><span style="margin-left: 25px;"/>2.3.3. В одностороннем порядке расторгать договор (полностью или частично), если Покупатель существенным образом нарушил договор.
                        <br/><span style="margin-left: 25px;"/>2.3.3.1. Нарушение договора Покупателем считается существенным, если сроки оплаты товара нарушены неоднократно.
                        <br/><span style="margin-left: 25px;"/>2.3.4. Досрочно поставлять товар с согласия Покупателя.
                    </h6>
                    <span style="margin-left: 25px;"/><span style="font-weight: 700">2.4. Продавец обязан:</span>
                    <h6 style="text-align: justify; margin-top: 0; margin-bottom: 20px;">
                        <span style="margin-left: 25px;"/>2.4.1. Передавать товар Покупателю в порядке, объемах, сроки и по адресу, предусмотренные договором.
                        <br/><span style="margin-left: 25px;"/>2.4.2. Обеспечивать поставку товара в соответствии с подпунктом б) пункта 2.1.2 и (или) пунктом 2.1.5 договора в установленные Покупателем сроки.
                        <br/><span style="margin-left: 25px;"/>2.4.3. Передавать Покупателю товар, свободный от прав третьих лиц.
                        <br/><span style="margin-left: 25px;"/>2.4.4. Передавать Покупателю товар предусмотренного договором качества и количества в предусмотренные договором сроки и по адресу, а по требованию Покупателя предоставлять подтверждающие качество товара документы, установленные законодательством Республики Армения.
                        <br/><span style="margin-left: 25px;"/>2.4.5. В случае допущения недопоставки, в установленном договором порядке восполнять недопоставку.
                        <br/><span style="margin-left: 25px;"/>2.4.6. Забирать обратно товар, принятый Покупателем в соответствии с пунктом 2.2.2 договора на ответственное хранение, или в разумный срок распорядиться им, а также возмещать необходимые расходы, связанные с принятием товара на ответственное хранение, его реализацией или возвратом Продавцу.
                        <br/><span style="margin-left: 25px;"/>2.4.7. В предусмотренных договором случаях уплачивать предусмотренные пунктами 6.2 и 6.3 договора пеню и штраф.
                        <br/><span style="margin-left: 25px;"/>2.4.8. Передавать Покупателю принадлежности товара и соответствующие документы.
                        <br/><span style="margin-left: 25px;"/>2.4.9.  После расторжения договора согласно пункту 2.1.7 договора возмещать Покупателю причиненные последнему и обоснованные в установленном порядке убытки.
                        <br/><span style="margin-left: 25px;"/>2.4.10.   Лицо, представившее квалификацию и обеспечение договора, обязано в случае начала процесса ликвидации или банкротства в течение действия обеспечений заранее письменно уведомить об этом Покупателя.
                        <template v-if="currentOrganized.is_with_condition && Number(currentOrganized.organize_type) === 1"> 
                            <br/><span style="margin-left: 25px;"/>
                            2.4.11 Выполнить договор числом
                            <input type="text"
                                class="editor-input"
                                v-model="$v.inputs.workersCount.$model"
                                ref="workersCount"
                                inputName="workersCount"
                                style="width: 30px;border-top: 0 !important; border-left: 0 !important; border-right: 0 !important; text-align: right;   
                                font-size: 13px;
                                color: #303e67;
                                border-bottom: 1px solid black"
                                onkeypress="this.style.width = ((this.value.length + 1) * 8 + 2) + 'px';"
                            />
                            աсотрудников и при выполнении договора, более 50 процентов цены договора суммарно направить на выполнение договора посредством использования трудовых и (или) производственных ресурсов армянского происхождения.
                            <br/><span style="margin-left: 25px;"/>2.4.12 Вместе с протоколом о сдаче-приеме каждого этапа в рамках выполнения договора, представить заказчику копии счетов-фактур на приобретение  сертификатов страны происхождения производственных ресурсов и ресурсов армянского происхождения, использованных для обеспечения выполнения данного этапа, а также заверенной им справки о суммах, выплаченных соответствующему числу сотрудников, с указанием размеров сумм и номеров общественных услуг данных сотрудников.
                        </template>
                    </h6>
                </div>
                <div class="info-block">
                    <h6 style="margin-top: 3rem; text-align: justify">
                        <span style="margin-left: 25px;"/><p style="font-weight: 700; text-align: center; margin-bottom: 0;">3. ЦЕНА ДОГОВОРА И ПОРЯДОК ОПЛАТЫ</p>
                        <br/><span style="margin-left: 25px;"/>3.1. Цена договора составляет <span class="contract-price">_______</span> (<span class="contract-price-word">______________</span>) драмов Республики Армения, включая НДС.
                        <br/><span style="margin-left: 25px;"/>Цена договора включает все платежи (расходы), осуществляемые Продавцом с целью обеспечения исполнения договора, в том числе налоги, пошлины, расходы на транспортировку, страхование, премии и ожидаемую прибыль.
                        Цена поставки товара стабильна, и Продавец не вправе требовать увеличения, а Покупатель — снижения этой цены.
                        <template v-if="+currentOrganized.prepayment">
                            <span style="margin-left: 25px;"/>3.1.1. Покупатель перечисляет сумму в размере до {{ currentOrganized.prepayment_max }} ({{ currentOrganized.prepayment_max_text }}) драмов Республики Армения от цены договора на банковский счет Продавца в качестве предоплаты. Погашение предоплаты осуществляется в форме уменьшений (удержаний) из выплат, производимых на основании актов приема-передачи. При этом до полного погашения предоплаты платежи Продавцу не производятся.
                        </template>
                        <br/><span style="margin-left: 25px;"/>3.2. Покупатель платит за поставленный ему товар в драмах Республики Армения, в безналичной форме, путем перечисления денежных средств на расчетный счет Продавца. Перечисление денежных средств производится на основании акта сдачи-приемки в течение месяцев, предусмотренных графиком оплаты договора (Приложение № 2), но не позднее чем до ---- ого декабря данного года.
                        <br/><span style="margin-left: 25px;"/>При этом, с целью совершения платежа, заказчик в течение 3 рабочих дней со дня подписания протокола передачи-приема вносит платежное поручение и копию протокола передачи-приема в казначейскую систему уполномоченного органа, а на основании документов, представленных согласно установленному порядку, уполномоченный орган в случае поступления в казначейскую систему протокола передачи-приема производит данный платеж в сроки, установленные графиком օплаты настоящего Договора, в течение пяти рабочих дней. 
                        <br/><span style="margin-left: 25px;"/>При этом оплата за закупку осуществляется в срок, установленный графиком oплаты настоящего Договора, в течение пяти рабочих дней. 
                        <template v-if="currentOrganized.is_with_condition && Number(currentOrganized.organize_type) === 1"> 
                            <br/><span style="margin-left: 25px;"/>3.3. В случае применения условий, установленных пунктами 2.4.11 и 2.4.12 настоящего Договора, если представленная информация оценивается как соответствующая установленным требованиям, то Продавцу в порядке, установленном постановлением правительства РА № 442-н от 01.04. 2021 года, возмещается 1 процент от цены договора.
                        </template>
                    </h6>
                </div>
                <div class="info-block">
                    <h6 style="margin-top: 3rem; text-align: justify">
                        <span style="margin-left: 25px;"/><p style="font-weight: 700; text-align: center; margin-bottom: 0;">4. КАЧЕСТВО И ГАРАНТИЯ ТОВАРА</p>
                        <br/><span style="margin-left: 25px;"/>4.1. Продавец гарантирует соответствие качества поставленного товара требованиям государственного стандарта.
                        <br/><span style="margin-left: 25px;"/>
                        <span v-if="organizedRows[0].is_main_tool === 1">
                            4.2. <span style="color: rgb(17, 85, 204);">Для товаров, являющихся основным средством,</span> гарантийным сроком устанавливается 
                            <input type="text"
                                class="editor-input"
                                v-model="$v.inputs.calendar_days.$model"
                                ref="calendar_days"
                                inputName="calendar_days"
                                style="width: 30px;border-top: 0 !important; border-left: 0 !important; border-right: 0 !important; text-align: right;   
                                font-size: 13px;
                                color: #303e67;
                                border-bottom: 1px solid black" 
                                onkeypress="this.style.width = ((this.value.length + 1) * 8 + 2) + 'px';"
                            />
                            календарных дней со дня, следующего за днем принятия товара Покупателем. Если в течение гарантийного срока выявлены дефекты поставленного товара, то Продавец обязан за свой счет и в установленные Покупателем разумные сроки устранить эти дефекты.
                        </span>
                    </h6>
                </div>
                <div class="info-block">
                    <h6 style="margin-top: 3rem; text-align: justify">
                        <span style="margin-left: 25px;"/><p style="font-weight: 700; text-align: center; margin-bottom: 0;">5. ПЕРЕДАЧА И ПРИЕМ ТОВАРА</p>
                        <template v-if="+currentOrganized.organize_type === 1">
                                <br/><span style="margin-left: 25px;"/>5.1 Поставленный товар принимается подписанием акта приема-передачи между Покупателем и Продавцом. Факт передачи товара Покупателю фиксируется утвержденным в двустороннем порядке документом между Покупателем и Продавцом, с указанием даты составления документа.
                                <br/><span style="margin-left: 25px;"/>Включительно до дня, предусмотренного для поставки Товара по Договору, Продавец предоставляет Покупателю подписанный им документ, фиксирующий факт передачи товара Покупателю (Приложение № 3.1), а посредством системы электронных закупок armeps (пособие по осуществлению действия размещено в разделе "Электронные закупки" интернет сайта, действующего по адресу www.procurement.am) — также акт приема-передачи (Приложение № 3). При этом, Продавец не скрепляет печатью акт приема-передачи, утверждает электронной подписью, заполняя только те графы, которые относятся к его данным (порядок заполнения размещен в подразделе "Приказы Министра финансов" раздела "Законодательство" интернет-сайта, действующего по адресу: www.procurement.am).
                                <br/><span style="margin-left: 25px;"/>
                                5.2.  Если поставленный товар соответствует условиям договора, Покупатель в течение 
                                <input type="text"
                                    class="editor-input"
                                    v-model="$v.inputs.daysCount.$model"
                                    ref="daysCount"
                                    inputName="daysCount"
                                    style="width: 30px;border-top: 0 !important; border-left: 0 !important; border-right: 0 !important; text-align: right;   
                                    font-size: 13px;
                                    color: #303e67;
                                    border-bottom: 1px solid black"
                                    onkeypress="this.style.width = ((this.value.length + 1) * 8 + 2) + 'px';"
                                />
                                рабочих дней с рабочего дня, следующего за днем получения документов, указанных в пункте 3.1.	договора, подписывает и посредством системы электронных закупок ARMEPS предоставляет Продавцу подписанный им акт приема-передачи, а также положительное заключение, послужившее основанием для его подписания.
                                <br/><span style="margin-left: 25px;"/>5.3. Если поставленный товар или его часть не соответствует условиям договора, то Покупатель не подписывает акт приема-передачи и в указанный в пункте 3.2 настоящего договора срок, посредством системы электронных закупок ARMEPS, возвращает Продавцу акт приема-передачи, а также отрицательное заключение, послужившее основанием для его неподписания. В случае применения настоящего пункта Покупатель предпринимает меры, предусмотренные договором для подобной ситуации и в отношении Продавца применяет меры ответственности, предусмотренные договором.
                                <br/><span style="margin-left: 25px;"/>5.4.	Если в срок, установленный пунктом 5.2 договора, Покупатель не принимает поставленного товара или не отказывается принимать его, то поставленный товар считается принятым, и на следующий рабочий день после установленного пунктом 5.2 договора окончательного срока Покупатель посредством системы электронных закупок предоставляет Продавцу подписанный им акт приема-передачи.
                        </template>
                        <template v-else>
                                <br/><span style="margin-left: 25px;"/>5.1. Поставленный товар принимается подписанием акта приема-передачи между Покупателем и Продавцом. Факт передачи товара Покупателю фиксируется утвержденным в двустороннем порядке документом между Покупателем и Продавцом, с указанием даты составления документа.
                                <br/><span style="margin-left: 25px;"/>
                                Включительно до дня, предусмотренного для поставки товара по договору, Продавец предоставляет Покупателю подписанный им документ, фиксирующий факт передачи товара Покупателю (Приложение № 3.1) и
                                <input type="text"
                                    v-model="$v.inputs.copyCount.$model"
                                    ref="copyCount"
                                    inputName="copyCount"
                                    class="editor-input"
                                    style="width: 30px;border-top: 0 !important; border-left: 0 !important; border-right: 0 !important; text-align: right;   
                                    font-size: 13px;
                                    color: #303e67;
                                    border-bottom: 1px solid black" 
                                    onkeypress="this.style.width = ((this.value.length + 1) * 8 + 2) + 'px';"
                                />
                                экземпляр акта приема-передачи (Приложение № 3).
                                <br/><span style="margin-left: 25px;"/>5.2. Акт приема-передачи подписывается, если поставленный товар соответствует условиям договора. В противном случае результаты исполнения договора или его части не принимаются, акт приема-передачи не подписывается и Покупатель:
                                <br/><span style="margin-left: 25px;"/>а) для урегулирования вопроса предпринимает меры, предусмотренные договором для подобной ситуации;
                                <br/><span style="margin-left: 25px;"/>б) в отношении Продавца применяет меры ответственности, предусмотренные договором.
                                <br/><span style="margin-left: 25px;"/>
                                5.3. Покупатель в течение
                                <input type="text"
                                    class="editor-input"
                                    v-model="$v.inputs.daysCount.$model"
                                    ref="daysCount"
                                    inputName="daysCount"
                                    style="width: 30px;border-top: 0 !important; border-left: 0 !important; border-right: 0 !important; text-align: right;   
                                    font-size: 13px;
                                    color: #303e67;
                                    border-bottom: 1px solid black"
                                    onkeypress="this.style.width = ((this.value.length + 1) * 8 + 2) + 'px';"
                                />
                                рабочих дней с рабочего дня, следующего за днем получения акта приема-передачи представляет Продавцу один экземпляр подписанного им акта приема-передачи либо мотивированное отклонение непринятия товара.
                                <br/><span style="margin-left: 25px;"/>5.4.  Если в срок, установленный пунктом 5.3 договора, Покупатель не принимает поставленного товара или не отказывается принимать его, то поставленный товар считается принятым, и на следующий рабочий день после установленного пунктом 5.3 договора окончательного срока Покупатель предоставляет Продавцу подтвержденный им акт приема-передачи. 
                        </template>
                    </h6>
                </div>
                <div class="info-block">
                    <h6 style="margin-top: 3rem; text-align: justify">
                        <span style="margin-left: 25px;"/><p style="font-weight: 700; text-align: center; margin-bottom: 0;">6. ОТВЕТСТВЕННОСТЬ СТОРОН</p>
                        <br/><span style="margin-left: 25px;"/>6.1. Продавец несет ответственность за качество переданного товара и соблюдение предусмотренных договором сроков поставки.
                        <br/><span style="margin-left: 25px;"/>6.2. В случае нарушения Продавцом предусмотренных договором сроков поставки товара с Продавца за каждый просроченный рабочий день взимается пеня в размере 0,05 (ноль целых пять сотых) процента от цены подлежащего поставке, но не поставленного товара.
                        <br/><span style="margin-left: 25px;"/>6.3. В каждом случае поставки товара, не соответствующего указанной в пункте 1.1.   договора технической характеристике, с Продавца взимается штраф в размере 0,5 (ноль целых пять десятых) процента от цены договора20. При этом, штраф рассчитывается также при выполнении поставки товара в срок, установленный настоящим договором, но в случае его непринятия заказчиком.
                        <br/><span style="margin-left: 25px;"/>6.4. Предусмотренные пунктами 6.2 и 6.3 договора пеня и штраф исчисляются и зачитываются вместе с суммами, подлежащими уплате Продавцу.
                        <br/><span style="margin-left: 25px;"/>6.5. За нарушение Покупателем предусмотренного пунктом 3.2 договора срока, в отношении Покупателя за каждый просроченный рабочий день исчисляется пеня в размере 0,05 (ноль целых пять сотых) процента от подлежащей уплате, но не уплаченной суммы.
                        <br/><span style="margin-left: 25px;"/>6.6. В непредусмотренных договором случаях за неисполнение или ненадлежащее исполнение своих обязательств стороны несут ответственность в порядке, установленном законодательством Республики Армения
                        <br/><span style="margin-left: 25px;"/>6.7. Уплата пеней и (или) штрафов не освобождает стороны от полного исполнения своих договорных обязательств.
                    </h6>
                </div>
                <div class="info-block">
                    <h6 style="margin-top: 3rem; text-align: justify">
                        <span style="margin-left: 25px;"/><p style="font-weight: 700; text-align: center; margin-bottom: 0;">7. ДЕЙСТВИЕ НЕПРЕОДОЛИМОЙ СИЛЫ (ФОРС-МАЖОР)</p>
                        <br/><span style="margin-left: 25px;"/>Стороны освобождаются от ответственности за полное или частичное неисполнение обязательств по договору, если это явилось следствием действия непреодолимой силы, которая возникла после заключения настоящего договора, и которую стороны не могли предусмотреть или предотвратить. Такими ситуациями являются землетрясение, наводнение, пожар, война, объявление военного и чрезвычайного положения, политические волнения, забастовки, прекращение работ средств коммуникации, акты государственных органов и т. д., которые делают невозможным исполнение обязательств по настоящему Договору. Если действие чрезвычайной силы длится более 3 (трех) месяцев, то каждая из сторон имеет право расторгнуть договор, предварительно уведомив об этом другую сторону.
                    </h6>
                </div>
                <div class="info-block">
                    <h6 style="margin-top: 3rem; text-align: justify">
                        <span style="margin-left: 25px;"/><p style="font-weight: 700; text-align: center; margin-bottom: 0; ">8. ИНЫЕ УСЛОВИЯ</p>
                        <br/><span style="margin-left: 25px;"/>8.1. Договор вступает в силу с момента его подписания Сторонами и действует до выполнения в полном объеме принятых Сторонами по Договору обязательств.
                        <template v-if="currentOrganized.rights_responsibilities_fulfillment">
                            <br/><span style="margin-left: 25px;"/>Условием исполнения сторонами прав и обязанностей, предусмотренных договором, является обстоятельство учета договора Министерством финансов Республики Армения.
                        </template>
                        <br/><span style="margin-left: 25px;"/>8.2. Возникающее из договора платежное обязательство стороны не может прекратиться зачетом встречного обязательства, возникающего из другого договора, без письменного и утвержденного печатью соглашения сторон. Право требования, вытекающее из договора, не может быть передано другому лицу без письменного согласия стороны должника.
                        <br/><span style="margin-left: 25px;"/>8.3. В том случае, когда в установленном законом порядке в результате контроля либо надзора или рассмотрения жалоб в отношении выполнения требований закона констатируется, что в процессе закупки, организованной с целью заключения договора, Продавец до заключения договора представил поддельные документы (сведения и данные), или решение о признании последнего отобранным участником не соответствует законодательству Республики Армения, то после выявления данных оснований Покупатель в одностороннем порядке расторгает договор, если выявленные нарушения, в случае если бы о них стало известно до заключения договора, послужили бы основанием для незаключения договора согласно законодательству Республики Армения о закупках. При этом, Покупатель не несет риска убытков или упущенной выгоды, возникающих для Продавца в результате одностороннего расторжения договора, а последний обязан в порядке, установленном законодательством Республики Армения, возместить понесенные по его вине убытки Покупателя в том объеме, по части которого был расторгнут договор.
                        <br/><span style="margin-left: 25px;"/>8.4. Споры в связи с договором подлежат рассмотрению в судах Республики Армения.
                        <br/><span style="margin-left: 25px;"/>8.5.  Изменения и дополнения могут быть внесены в договор исключительно с взаимного согласия сторон — посредством заключения соглашения, которое будет являться неотъемлемой частью договора.
                        <br/><span style="margin-left: 25px;"/>Запрещается внесение в договор, а если цена договора факторная, то также в соглашение к данному договору, заключаемое в каждом последующем году, таких изменений, которые приводят к искусственному изменению объемов закупаемого товара или цены единицы приобретаемого товара или цены договора.
                        <br/><span style="margin-left: 25px;"/>Каждый случай изменения договора под воздействием не зависящих от сторон договора факторов устанавливает Правительство Республики Армения.
                        <div class="is-agency-agreement">
                            <span style="color: rgb(17, 85, 204);">
                                <span style="margin-left: 25px;"/>8.6. Если договор осуществляется посредством заключения агентского договора:
                            </span>
                            <p style="color: rgb(17, 85, 204);margin-bottom: 0;">
                                <span style="margin-left: 25px;"/>1) Продавец несет ответственность за неисполнение или ненадлежащее исполнение обязательств агента;
                            </p>
                            <p style="color: rgb(17, 85, 204); margin-bottom: 0;">  
                                <span style="margin-left: 25px;"/>2) В случае замены агента в течение исполнения договора Продавец в письменной форме уведомляет Покупателя с предоставлением копии агентского договора и данных являющегося его стороной лица в течение пяти рабочих дней со дня внесения изменения.
                            </p>
                            <p style="color: rgb(17, 85, 204); margin-bottom: 0;">
                                <span style="margin-left: 25px;"/>8.7. Если договор осуществляется посредством заключения договора о совместной деятельности (консорциума), то участники этого договора несут совместную и солидарную ответственность. При этом в случае выхода члена консорциума из консорциума договор расторгается в одностороннем порядке, и в отношении членов консорциума применяются предусмотренные договором меры ответственности.
                            </p>
                        </div>
                        <br/><span style="margin-left: 25px;"/>8.8. При наличии предложения от Продавца, срок поставки товара может быть продлен до истечения данного срока по договору, при условии, что у Покупателя все еще имеется потребность в использовании товара , а предложение продавца было представлено не позднее пяти календарных дней до истечения срока, изначально установленного договором для поставки. При этом, в установленном настоящим пунктом случае срок поставки товара может быть продлен один раз на срок до 30 календарных дней, но не более чем на срок, установленный договором.
                        <br/><span style="margin-left: 25px;"/>8.9. В условиях надлежащего исполнения договора, выгода (сбережения) или понесенные убытки сторон (Продавца или Покупателя) — это выгода или убытки, понесенные данной стороной.
                        <br/><span style="margin-left: 25px;"/>Обязательства сторон договора по отношению к третьим лицам, включая иные сделки, заключенные Продавцом в рамках исполнения договора, и вытекающие из них обязательства, находятся вне поля урегулирования договора и не могут влиять на принятие результата исполнения договора. Отношения, связанные с выполнением данных сделок и вытекающих из них обязательств, регулируются нормами, регулирующими отношения, связанные с данными сделками, и за них ответственен Продавец.
                        <br/><span style="margin-left: 25px;"/>8.10. Договор не может быть изменен вследствие частичного неисполнения обязательств сторонами или полностью расторгнут по взаимному согласию Сторон, за исключением случаев уменьшения финансовых ассигнований, необходимых для поставки товара в порядке, установленном законодательством Республики Армения. При этом, взаимное согласие сторон договора по частичному неисполнению обязательств или полному расторжению договора должно быть достигнуто до уменьшения финансовых ассигнований, необходимых для поставки товара в порядке, установленном законодательством Республики Армения.
                        <br/><span style="margin-left: 25px;"/>8.11. Уведомление относительно полного или частичного одностороннего расторжения договора на основании неисполнения или ненадлежащего исполнения обязательств, принятых на себя Продавцом, Покупатель опубликовывает в разделе "Уведомления об одностороннем расторжении договоров" на интернет сайте, действующем по адресу www.procurement.am, с указанием даты опубликования. Продавец считается надлежащим образом уведомленным относительно одностороннего расторжения договора со следующего за опубликованием уведомления дня, установленного настоящим пунктом. В день публикации в бюллетене уведомления о полном или частичном одностороннем расторжении договора Покупатель высылает его также на электронную почту Продавца.
                        <br/><span style="margin-left: 25px;"/>8.12. Споры, возникшие в связи с договором, разрешаются путем переговоров. В случае недостижения согласия споры разрешаются в судебном порядке.
                        <br/><span style="margin-left: 25px;"/>8.13. Договор составлен на <span class="pages-count">__</span> страницах, заключается в двух экземплярах, имеющих равную юридическую силу, каждой стороне предоставляется по одному экземпляру. Приложения № 1, № 2, № 3 и № 3.1. к договору считаются неотъемлемой частью договора.
                        <br/><span style="margin-left: 25px;"/>8.14. К отношениям, связанным с договором, применяется право Республики Армения.
                        <template v-if="currentOrganized.is_with_condition && currentOrganized.rows_total_price < 25000000" style="text-align: left">
                            <span style="color: rgb(17, 85, 204);">
                                <br/><span style="margin-left: 25px;"/>8.15 Поставка предусмотренных договором товаров осуществляется при наличии предусмотренных для этой цели финансовых средств и посредством заключения на данном основании соответствующего соглашения между сторонами. Договор расторгается, если в течение шести месяцев, следующих за днем его заключения, финансовые средства в целях его исполнения не предусматриваются.  При этом Продавец заключает соглашение и представляет Покупателю новые обеспечения в течение пятнадцати рабочих дней со дня получения извещения о заключении соглашения. В противном случае договор расторгается Покупателем в одностороннем порядке.
                            </span>
                        </template>
                        <template v-else-if="currentOrganized.is_with_condition" style="text-align: left">
                            <span style="color: rgb(17, 85, 204);">
                                <br/><span style="margin-left: 25px;"/>8.15 Поставка предусмотренных договором товаров осуществляется при наличии предусмотренных для этой цели финансовых средств и посредством заключения на данном основании соответствующего соглашения между сторонами. Договор расторгается, если в течение шести месяцев, следующих за днем его заключения, финансовые средства в целях его исполнения не предусматриваются. При этом расчет шестимесячного периода, данного настоящим пунктом для предусмотрения финансовых средств для заключения каждого последующего соглашения, начинается со дня принятия заказчиком в полном объеме результата поставки товара, установленного предыдущим соглашением. Если размер выделенных для исполнения договора финансовых средств превышает двадцатипятикратный размер базовой единицы закупок, то Покупателем будет заключенo соглашение в случае, если представленные Продавцом в виде неустойки обеспечения квалификации и договора заменяются гарантией или наличными деньгами, с учетом требований абзаца "в" подпункта 1 и абзаца "б" подпункта 17 пункта 32 Приложения № 1 к Постановлению Правительства Республики Армения № 526-N от 4 мая 2017 года. При этом Продавец заключает соглашение, а при замене обеспечений квалификации и договора представленных в виде неустойки, также представляет Покупателю новые обеспечения в течение пятнадцати рабочих дней со дня получения извещения о заключении соглашения. В противном случае договор расторгается Покупателем в одностороннем порядке.
                            </span>
                        </template>
                    </h6>
                </div>
		        <div class="html2pdf__page-break"/>
                <div class="info-block">
                    <h6 style="margin-top: 3rem; text-align: center; font-weight: 700">
                        9. Адреса, банковские реквизиты и подписи Сторон
                    </h6>
                    <div class="col-md-12 row d-flex justify-content-center info-block">
                        <table style="width: 100%; border: none !important">
                            <tbody>
                                <tr>
                                    <td style="width: 50%">
                                        <div style="text-align: center">
                                            <h6 class="ft-11" style="font-weight: 700">ПОКУПАТЕЛЬ</h6>
                                            <p class="ft-11" style="font-size: 14px;">" {{ me.organisation[0].translations.name.ru }} " {{ me.organisation[0].translations.company_type.ru }}</p>
                                            <p class="ft-11" style="font-size: 14px;" v-if="me.organisation[0].translations.region.ru === me.organisation[0].translations.city.ru">{{ me.organisation[0].translations.city.ru }} {{ me.organisation[0].translations.address.ru }}</p>
                                            <p class="ft-11" style="font-size: 14px;" v-else>{{ me.organisation[0].translations.region.ru }} {{ me.organisation[0].translations.city.ru }} {{ me.organisation[0].translations.address.ru }}</p>
                                            <p class="ft-11" style="font-size: 14px;">Банк: {{ me.organisation[0].translations.bank_name.ru }}</p>
                                            <p class="ft-11" style="font-size: 14px;">Н/С {{ me.organisation[0].bank_account }} </p>
                                            <p class="ft-11" style="font-size: 14px;">ИНН {{ me.organisation[0].tin }} </p>
                                            <p class="ft-11" style="font-size: 14px;">{{ me.organisation[0].translations.director_position.ru }}: {{ me.organisation[0].translations.director_name.ru }}</p>
                                            <p class="ft-11" style="font-size: 14px;">______________________</p>
                                            <p style="font-size: 8px; margin-top: -20px; color: gray; margin-bottom: 35px;">/подпись/</p>
                                        </div>
                                    </td>
                                    <td style="width: 50%">
                                        <div style="text-align: center">
                                            <h6 class="ft-11" style="font-weight: 700">ПРОДАВЕЦ</h6>
                                            <p class="ft-11" style="font-size: 14px;"> " <span class="winner-name">______________</span> " <span class="winner-type">_______</span></p>
                                            <p class="ft-11" style="font-size: 14px;"><span class="winner-address">_____________________</span></p>
                                            <p class="ft-11" style="font-size: 14px;">Банк:<span class="winner-bank">___________</span></p>
                                            <p class="ft-11" style="font-size: 14px;">Н/С <span class="winner-bank_account">_____________________</span></p>
                                            <p class="ft-11" style="font-size: 14px;">ИНН <span class="winner-tin">______________</span></p>
                                            <p class="ft-11" style="font-size: 14px;">Директор: <span class="winner-director">_____________________</span></p>
                                            <p class="ft-11" style="font-size: 14px;">______________________</p>
                                            <p style="font-size: 8px; margin-top: -20px; color: gray; margin-bottom: 35px;">/подпись/</p>
                                        </div>
                                    </td>
                                </tr>
                            </tbody>
                        </table>
                    </div>
                    <h6 style="text-align: center; margin-bottom: 3rem">
                    В случае необходимости в договор могут быть включены не противоречащие законодательству Республики Армения положения.
                    </h6>
                </div>
		        <div class="html2pdf__page-break"/>
                <div class="info-block">
                    <div style="text-align: right; margin-top: 3rem">Приложение N 1</div>
                    <div style="text-align: right">к Договору под кодом <span class="contract-code-ru" style="color: rgb(17, 85, 204);"></span></div>
                    <div style="text-align: right">заключенному <span style="color: rgb(17, 85, 204);"><span class="getOrgnizeTypeByPlanRu"></span> </span> 20  	г.</div>
                    <br/>
                    <div style="text-align: center; font-weight: 700; margin-top: 40px">ТЕХНИЧЕСКАЯ ХАРАКТЕРИСТИКА-ГРАФИК ЗАКУПКИ*</div>
                    <br/>
                    <br class="page-break"/>
                    <div style="text-align: right; margin-right: -25px;">Драмов РА<span style="margin-left: 25px;"/></div>
                    <table style="font-size: 10px;
                            width: 100%;
                            table-layout: fixed;
                            border-collapse: collapse;
                            page-break-inside: avoid;
                            border: 1px solid black;
                            text-align: center;" cellspacing="5" cellpadding="5" class="ft-5">
                        <tbody>
                            <tr>
                                <td colspan="12" style="border: 1px solid black;
                                                        border-collapse: collapse;
                                                        text-align: center;">Товар</td>
                            </tr>
                            <tr>
                                <td rowspan="2" style="border: 1px solid black;
                                                       border-collapse: collapse;
                                                       text-align: center;">Н/Л</td>
                                <td rowspan="2" style="border: 1px solid black;
                                                       border-collapse: collapse;
                                                       text-align: center;">CPV код</td>
                                <td rowspan="2" style="border: 1px solid black;
                                                       border-collapse: collapse;
                                                       text-align: center;">наименование</td>
                                <td rowspan="2" style="border: 1px solid black;
                                                       border-collapse: collapse;
                                                       text-align: center;"><span style="color: rgb(17, 85, 204);">товарный знак, фирменное наименование, модель и наименование производителя *</span></td>
                                <td rowspan="2" style="border: 1px solid black;
                                                       border-collapse: collapse;
                                                       text-align: center;">техническая характеристика</td>
                                <td rowspan="2" style="border: 1px solid black;
                                                       border-collapse: collapse;
                                                       text-align: center;">единица измерения</td>
                                <td rowspan="2" style="border: 1px solid black;
                                                       border-collapse: collapse;
                                                       text-align: center;">цена единицы/драмов РА</td>
                                <td rowspan="2" style="border: 1px solid black;
                                                       border-collapse: collapse;
                                                       text-align: center;">общая цена/драмов РА</td>
                                <td rowspan="2" style="border: 1px solid black;
                                                       border-collapse: collapse;
                                                       text-align: center;">общий объем</td>
                                <td colspan="3" style="border: 1px solid black;
                                                       border-collapse: collapse;
                                                       text-align: center;">поставки</td>
                            </tr>
                            <tr>	
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">адрес</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">подлежащее поставке количество товара</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">срок***</td>
                            </tr>
                        </tbody>
                        <tbody class="purchase-schedule">
                            <tr v-for="(row, rowIndex) in currentOrganized.organize_rows" :key="rowIndex">
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{ rowIndex + 1 }}</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{ row.procurement_plan.cpv.code }}{{ row.procurement_plan.cpv_drop && '/' }}{{ row.procurement_plan.cpv_drop }}</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{ row.procurement_plan.cpv.name_ru }}</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">&nbsp;&nbsp;&nbsp;</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{ row.procurement_plan.specifications.description.ru }}</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{ row.procurement_plan.unit_ru }}</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">
                                </td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">
                                </td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{ row.count }}</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"
                                    v-if="me.organisation[0].translations.region.ru === me.organisation[0].translations.city.ru">
                                Г.
                                    {{ me.organisation[0].translations.city.ru }}
                                    {{ me.organisation[0].translations.address.ru }}
                                </td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"
                                    v-else>
                                    {{ me.organisation[0].translations.region.ru }}

                                    г.

                                    {{ me.organisation[0].translations.city.ru }}
                                    {{ me.organisation[0].translations.address.ru }}
                                </td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{row.supply || ''}}</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{row.supply_date || ''}}</td>
                            </tr>
                        </tbody>
                    </table>
                    <p> * Срок поставки товара, а в случае поэтапной поставки — срок первого этапа поставки, должен устанавливаться минимум 20 календарных дней, расчет которого осуществляется в день вступления в силу условия исполнения предусмотренных договоров прав и обязанностей сторон, за исключением случая, когда отобранный участник соглашается поставить товар в более короткий срок. Окончательный срок поставки не может быть позднее 25 декабря данного года.</p>
                    <p>
                        <span style="color: rgb(17, 85, 204);">
                            ** Если по заявке отобранного участника представлены товары, произведенные более чем одним производителем, а также имеющие разные товарные знаки, фирменное наименование и модель, то удовлетворительно оцененные из них включаются в данное приложение. Если приглашением не предусматривается представление информации относительно товарного знака, фирменного наименования, марки и производителя товара, то графа " товарный знак, модель и наименование производителя " исключается.
                        </span>
                    </p>
                    <p>
                        <span style="color: rgb(17, 85, 204);">
                            В случае, предусмотренном договором, продавец также предоставляет покупателю гарантийное письмо или сертификат соответствия от производителя товара или его представителя.
                        </span>
                    </p>
                    <p v-if="currentOrganized.is_with_condition">
                        <span style="color: rgb(17, 85, 204);">
                            *** Если договор заключается на основании части 6 статьи 15 Закона РА "О закупках", то в графе срок устанавливается в календарных днях, а его исчисление осуществляется со дня вступления в силу заключаемого между сторонами соглашения в случае предусмотрения финансовых средств.
                        </span>
                    </p>
                    <div class="col-md-12 row d-flex justify-content-center info-block">
                        <table style="width: 100%; border: none !important">
                            <tbody>
                                <tr>
                                    <td style="width: 50%">
                                        <div style="text-align: center">
                                            <h6 class="ft-11" style="font-weight: 700">ПОКУПАТЕЛЬ</h6>
                                            <p class="ft-11" style="font-size: 14px;">" {{ me.organisation[0].translations.name.ru }} " {{ me.organisation[0].translations.company_type.ru }}</p>                                          
                                            <p class="ft-11" style="font-size: 14px;" v-if="me.organisation[0].translations.region.ru === me.organisation[0].translations.city.ru">{{ me.organisation[0].translations.city.ru }} {{ me.organisation[0].translations.address.ru }}</p>
                                            <p class="ft-11" style="font-size: 14px;" v-else>{{ me.organisation[0].translations.region.ru }} {{ me.organisation[0].translations.city.ru }} {{ me.organisation[0].translations.address.ru }}</p>
                                            <p class="ft-11" style="font-size: 14px;">Банк: {{ me.organisation[0].translations.bank_name.ru }}</p>
                                            <p class="ft-11" style="font-size: 14px;">Н/С {{ me.organisation[0].bank_account }} </p>
                                            <p class="ft-11" style="font-size: 14px;">ИНН {{ me.organisation[0].tin }} </p>
                                            <p class="ft-11" style="font-size: 14px;">{{ me.organisation[0].translations.director_position.ru }}: {{ me.organisation[0].translations.director_name.ru }}</p>                                          
                                            <p class="ft-11" style="font-size: 14px;">______________________</p>
                                            <p style="font-size: 8px; margin-top: -20px; color: gray; margin-bottom: 35px;">/подпись/</p>
                                        </div>
                                    </td>
                                    <td style="width: 50%">
                                        <div style="text-align: center">
                                            <h6 class="ft-11" style="font-weight: 700">ПРОДАВЕЦ</h6>
                                            <p class="ft-11" style="font-size: 14px;"> " <span class="winner-name">______________</span> " <span class="winner-type">_______</span></p>
                                            <p class="ft-11" style="font-size: 14px;"><span class="winner-address">_____________________</span></p>
                                            <p class="ft-11" style="font-size: 14px;">Банк:<span class="winner-bank">___________</span></p>
                                            <p class="ft-11" style="font-size: 14px;">Н/С <span class="winner-bank_account">_____________________</span></p>
                                            <p class="ft-11" style="font-size: 14px;">ИНН <span class="winner-tin">______________</span></p>
                                            <p class="ft-11" style="font-size: 14px;">Директор: <span class="winner-director">_____________________</span></p>
                                            <p class="ft-11" style="font-size: 14px;">______________________</p>
                                            <p style="font-size: 8px; margin-top: -20px; color: gray; margin-bottom: 35px;">/подпись/</p>
                                        </div>
                                    </td>
                                </tr>
                            </tbody>
                        </table>
                    </div>
                </div>
		        <div class="html2pdf__page-break"/>
                <div class="info-block">
                    <div style="text-align: right; margin-top: 3rem">Приложение N 2</div>
                    <div style="text-align: right">К Договору под кодом <span class="contract-code-ru" style="color: rgb(17, 85, 204);"></span></div>
                    <div style="text-align: right">Заключенному <span style="color: rgb(17, 85, 204);"><span class="getOrgnizeTypeByPlanRu"></span></span> 20  	г.</div>
                    <br/>
                    <div style="margin-top: 3rem; text-align: center; font-weight: 700">
                        ­­­­­­­­­­­­­­ГРАФИК ОПЛАТЫ*
                    </div>
                    <br/>
                    <table style="font-size: 10px;
                            width: 100%;
                            table-layout: fixed;
                            border-collapse: collapse;
                            page-break-inside: avoid;
                            border: 1px solid black;
                            text-align: center;" cellspacing="5" cellpadding="5" class="ft-5"> 
                        <tbody><tr>
                            <th rowspan="2" style="border: 1px solid black;
                                                   border-collapse: collapse;">Н/Л</th>
                            <th rowspan="2" style="border: 1px solid black;
                                                   border-collapse: collapse;">(CPV) код</th>
                            <th rowspan="2" style="border: 1px solid black;
                                                   border-collapse: collapse;">наименование</th>
                            <th colspan="13" style="border: 1px solid black;
                                                    border-collapse: collapse;">Оплату товара предусматривается произвести в <span style="color: rgb(17, 85, 204);">20  &nbsp;&nbsp;&nbsp;&nbsp; г.</span> по месяцам, в том числе**</th>
                        </tr>
                        <tr>
                            <td style="border: 1px solid black;
                                       border-collapse: collapse;
                                       writing-mode: vertical-lr;
                                       text-align: center;"><span style="color: rgb(17, 85, 204);">январь</span></td>
                            <td style="border: 1px solid black;
                                       border-collapse: collapse;
                                       writing-mode: vertical-lr;
                                       text-align: center;"><span style="color: rgb(17, 85, 204);">февраль</span></td>
                            <td style="border: 1px solid black;
                                       writing-mode: vertical-lr;
                                       border-collapse: collapse;
                                       text-align: center;"><span style="color: rgb(17, 85, 204);">март</span></td>
                            <td style="border: 1px solid black;
                                       writing-mode: vertical-lr;
                                       border-collapse: collapse;
                                       text-align: center;"><span style="color: rgb(17, 85, 204);">апрель</span></td>
                            <td style="border: 1px solid black;
                                       writing-mode: vertical-lr;
                                       border-collapse: collapse;
                                       text-align: center;"><span style="color: rgb(17, 85, 204);">май</span></td>
                            <td style="border: 1px solid black;
                                       writing-mode: vertical-lr;
                                       border-collapse: collapse;
                                       text-align: center;"><span style="color: rgb(17, 85, 204);">июнь</span></td>
                            <td style="border: 1px solid black;
                                       writing-mode: vertical-lr;
                                       border-collapse: collapse;
                                       text-align: center;"><span style="color: rgb(17, 85, 204);">июль</span></td>
                            <td style="border: 1px solid black;
                                       border-collapse: collapse;
                                       writing-mode: vertical-lr;
                                       text-align: center;"><span style="color: rgb(17, 85, 204);">август</span></td>
                            <td style="border: 1px solid black;
                                       border-collapse: collapse;
                                       writing-mode: vertical-lr;
                                       text-align: center;"><span style="color: rgb(17, 85, 204);">сентябрь</span></td>
                            <td style="border: 1px solid black;
                                       border-collapse: collapse;
                                       writing-mode: vertical-lr;
                                       text-align: center;"><span style="color: rgb(17, 85, 204);">октябрь</span></td>
                            <td style="border: 1px solid black;
                                       border-collapse: collapse;
                                       writing-mode: vertical-lr;
                                       text-align: center;"><span style="color: rgb(17, 85, 204);">ноябрь</span></td>
                            <td style="border: 1px solid black;
                                       border-collapse: collapse;
                                       writing-mode: vertical-lr;
                                       text-align: center;"><span style="color: rgb(17, 85, 204);">декабрь</span></td>
                            <td style="border: 1px solid black;
                                       border-collapse: collapse;
                                       writing-mode: vertical-lr;
                                       text-align: center;"><span style="color: rgb(17, 85, 204);">Всего</span></td>
                        </tr>
                    </tbody>
                    <tbody class="payment-schedule">
                        <tr v-for="(row, rowIndex) in currentOrganized.organize_rows" :key="rowIndex">
                            <td style="border: 1px solid black;
                                       border-collapse: collapse;
                                       text-align: center;">{{ rowIndex + 1 }}</td>
                            <td style="border: 1px solid black;
                                       border-collapse: collapse;
                                       text-align: center;">{{ row.procurement_plan.cpv.code }}{{ row.procurement_plan.cpv_drop && '/' }}{{ row.procurement_plan.cpv_drop }}</td>
                            <td style="border: 1px solid black;
                                       border-collapse: collapse;
                                       text-align: center;">{{ row.procurement_plan.cpv.name_ru }}</td>
                            <template v-if="row.organize_row_percent">
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{ row.organize_row_percent.month_1 !== null ? row.organize_row_percent.month_1 + '%'  : '-' }}</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{ row.organize_row_percent.month_2 !== null ? row.organize_row_percent.month_2 + '%'  : '-' }}</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{ row.organize_row_percent.month_3 !== null ? row.organize_row_percent.month_3 + '%'  : '-' }}</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{ row.organize_row_percent.month_4 !== null ? row.organize_row_percent.month_4 + '%'  : '-' }}</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{ row.organize_row_percent.month_5 !== null ? row.organize_row_percent.month_5 + '%'  : '-' }}</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{ row.organize_row_percent.month_6 !== null ? row.organize_row_percent.month_6 + '%'  : '-' }}</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{ row.organize_row_percent.month_7 !== null ? row.organize_row_percent.month_7 + '%'  : '-' }}</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{ row.organize_row_percent.month_8 !== null ? row.organize_row_percent.month_8 + '%'  : '-' }}</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{ row.organize_row_percent.month_9 !== null ? row.organize_row_percent.month_9 + '%'  : '-' }}</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{ row.organize_row_percent.month_10 !== null ? row.organize_row_percent.month_10 + '%'  : '-' }}</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{ row.organize_row_percent.month_11 !== null ? row.organize_row_percent.month_11 + '%'  : '-' }}</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{ row.organize_row_percent.month_12 !== null ? row.organize_row_percent.month_12 + '%'  : '-' }}</td>
                                <td v-if="row.organize_row_percent.month_1 === null && row.organize_row_percent.month_2 === null && row.organize_row_percent.month_3 === null && row.organize_row_percent.month_4 === null && row.organize_row_percent.month_5 === null && row.organize_row_percent.month_6 === null && row.organize_row_percent.month_7 === null && row.organize_row_percent.month_8 === null && row.organize_row_percent.month_9 === null && row.organize_row_percent.month_10 === null && row.organize_row_percent.month_11 === null && row.organize_row_percent.month_12 === null" 
                                style="border: 1px solid black;
                                       border-collapse: collapse;
                                       text-align: center;">-</td>
                                <td v-else style=" border: 1px solid black;
                                                   border-collapse: collapse;
                                                   text-align: center;"> 100% </td> 
                            </template>
                            <template v-else>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                            </template>   
                        </tr>
                    </tbody>
                    </table>
                    <p>
                        * Подлежащие уплате суммы представляются в порядке возрастания. 
                        <span v-if="currentOrganized.is_with_condition" style="color: rgb(17, 85, 204);"> 
                        ** Если договор заключается на основании части 6 статьи 15 Закона РА "О закупках", то настоящий график заполняется и заключается одновременно с заключаемым между сторонами соглашением в случае предусмотрения финансовых средств, в качестве его неотъемлемой части.
                        </span>
                    </p>
                    <p>
                        ** В приглашении суммы отмечаются в процентах, а при заключении договора вместо процента отмечается размер конкретной суммы.
                    </p>
                    <div class="col-md-12 row d-flex justify-content-center info-block">
                        <table style="width: 100%; border: none !important">
                            <tbody>
                                <tr>
                                    <td style="width: 50%">
                                        <div style="text-align: center">
                                            <h6 class="ft-11" style="font-weight: 700">ПОКУПАТЕЛЬ</h6>
                                            <p class="ft-11" style="font-size: 14px;">" {{ me.organisation[0].translations.name.ru }} " {{ me.organisation[0].translations.company_type.ru }}</p>
                                            <p class="ft-11" style="font-size: 14px;" v-if="me.organisation[0].translations.region.ru === me.organisation[0].translations.city.ru">{{ me.organisation[0].translations.city.ru }} {{ me.organisation[0].translations.address.ru }}</p>
                                            <p class="ft-11" style="font-size: 14px;" v-else>{{ me.organisation[0].translations.region.ru }} {{ me.organisation[0].translations.city.ru }} {{ me.organisation[0].translations.address.ru }}</p>
                                            <p class="ft-11" style="font-size: 14px;">Банк: {{ me.organisation[0].translations.bank_name.ru }}</p>
                                            <p class="ft-11" style="font-size: 14px;">Н/С {{ me.organisation[0].bank_account }} </p>
                                            <p class="ft-11" style="font-size: 14px;">ИНН {{ me.organisation[0].tin }} </p>
                                            <p class="ft-11" style="font-size: 14px;">{{ me.organisation[0].translations.director_position.ru }}: {{ me.organisation[0].translations.director_name.ru }}</p>
                                            <p class="ft-11" style="font-size: 14px;">______________________</p>
                                            <p style="font-size: 8px; margin-top: -20px; color: gray; margin-bottom: 35px;">/подпись/</p>
                                        </div>
                                    </td>
                                    <td style="width: 50%">
                                        <div style="text-align: center">
                                            <h6 class="ft-11" style="font-weight: 700">ПРОДАВЕЦ</h6>
                                            <p class="ft-11" style="font-size: 14px;"> " <span class="winner-name">______________</span> " <span class="winner-type">_______</span></p>
                                            <p class="ft-11" style="font-size: 14px;"><span class="winner-address">_____________________</span></p>
                                            <p class="ft-11" style="font-size: 14px;">Банк:<span class="winner-bank">___________</span></p>
                                            <p class="ft-11" style="font-size: 14px;">Н/С <span class="winner-bank_account">_____________________</span></p>
                                            <p class="ft-11" style="font-size: 14px;">ИНН <span class="winner-tin">______________</span></p>
                                            <p class="ft-11" style="font-size: 14px;">Директор: <span class="winner-director">_____________________</span></p>
                                            <p class="ft-11" style="font-size: 14px;">______________________</p>
                                            <p style="font-size: 8px; margin-top: -20px; color: gray; margin-bottom: 35px;">/подпись/</p>
                                        </div>
                                    </td>
                                </tr>
                            </tbody>
                        </table>
                    </div>
                </div>
		        <div class="html2pdf__page-break"/>
                <div class="info-block">
                    <div style="text-align: right; margin-top: 3rem">Приложение N 3</div>
                    <div style="text-align: right">К Договору под кодом <span class="contract-code-ru" style="color: rgb(17, 85, 204);"></span></div>
                    <div style="text-align: right">Заключенному <span style="color: rgb(17, 85, 204);"><span class="getOrgnizeTypeByPlanRu"></span></span> 20  	г.</div>
                    <br/>
                    <div class="col-md-12 d-flex" style="margin-top: 3rem">
                        <table style="width: 100%; border: none !important">
                            <tbody>
                                <tr>
                                    <td style="border:none !important;">
                                        <div style="text-align: right">	
                                            <p class="ft-11" style="font-size: 14px; font-weight: 700">Сторона договора</p>
                                            <p class="ft-11" style="font-size: 14px">_____________________________ </p>
                                            <p class="ft-11" style="font-size: 14px">_____________________________ </p>
                                            <p class="ft-11" style="font-size: 14px">место нахождения_________</p>
                                            <p class="ft-11" style="font-size: 14px">Р/С__________________________</p>
                                            <p class="ft-11" style="font-size: 14px">УНН__________________________ </p>
                                        </div>
                                    </td>
                                    <td style="border:none !important;padding-left: 80px">
                                        <div style="text-align: left">	
                                            <p class="ft-11" style="font-size: 14px; font-weight: 700">Заказчик</p>
                                            <p class="ft-11" style="font-size: 14px">_____________________________ </p>
                                            <p class="ft-11" style="font-size: 14px">_____________________________ </p>
                                            <p class="ft-11" style="font-size: 14px">место нахождения__________</p>
                                            <p class="ft-11" style="font-size: 14px">Р/С________________________</p>
                                            <p class="ft-11" style="font-size: 14px">УНН________________________ </p>
                                        </div>
                                    </td>
                                </tr>
                            </tbody>
                        </table>
                    </div>
                </div>
		        <div class="html2pdf__page-break"/>
                <div class="info-block">
                    <h6 style="font-weight: 700; text-align: center; margin-top: 3rem">АКТ N</h6>
                    <h6 style="font-weight: 700; text-align: center">ПРИЕМА-ПЕРЕДАЧИ РЕЗУЛЬТАТОВ</h6>
                    <h6 style="font-weight: 700; text-align: center">ИСПОЛНЕНИЯ ДОГОВОРАИЛИ ЕГО ЧАСТИ</h6>
                    <h6><span style="margin-left: 25px;" />"<span style="margin-left: 25px;" />  	"<span style="margin-left: 25px;" /> " <span style="margin-left: 25px;" />  " <span style="margin-left: 25px;" /> 20	г.</h6>
                    <h6>Наименование договора (далее — Договор)________________________________</h6>
                    <h6>Дата заключения Договора "____" "__________________" 20 г.</h6>
                    <h6>Номер Договора<span style="margin-left: 25px;"/>	__________</h6>
                    <h6>Заказчик и сторона Договора, принимая за основание относящийся к исполнению договора счет-фактуру N ________,  выписанный "_____________________" "________" 20  	г., составили настоящий акт о следующем:</h6>
                    <h6>В рамках Договора сторона Договора поставила следующие товары:</h6>
                    <table style=" 
                            width: 100%;
                            table-layout: fixed;
                            border-collapse: collapse;
                            page-break-inside: avoid;
                            border: 1px solid black;
                            text-align: center;" cellspacing="8" cellpadding="8">
                            <tbody><tr>
                                <th rowspan="3" style=" border: 1px solid black;
                                                        border-collapse: collapse;"
                            >N</th>
                                <th colspan="8" style=" border: 1px solid black;
                                                        border-collapse: collapse;">
                                    Поставленные товары
                                </th>
                            </tr>
                            <tr>
                                <th rowspan="2" style=" border: 1px solid black;
                                                        border-collapse: collapse;">наименование</th>
                                <th rowspan="2" style=" border: 1px solid black;
                                                        border-collapse: collapse;">краткое изложение технической характеристики</th>
                                <th colspan="2" style=" border: 1px solid black;
                                                        border-collapse: collapse;">количественный показатель
                                </th>
                                <th colspan="2" style=" border: 1px solid black;
                                                        border-collapse: collapse;">срок исполнения</th>
                                <th rowspan="2" style=" border: 1px solid black;
                                                        border-collapse: collapse;">сумма, подлежащая уплате (тыс. драмов)</th>
                                <th rowspan="2" style=" border: 1px solid black;
                                                        border-collapse: collapse;">срок оплаты (по графику оплаты)</th>
                            </tr>
                            <tr>
                                <th style=" border: 1px solid black;
                                            border-collapse: collapse;">по графику закупки, утвержденному Договором</th>
                                <th style=" border: 1px solid black;
                                            border-collapse: collapse;">фактический</th>
                                <th style=" border: 1px solid black;
                                            border-collapse: collapse;">по графику закупки, утвержденному Договором</th>
                                <th style=" border: 1px solid black;
                                            border-collapse: collapse;">фактический
                                </th>
                            </tr>
                            <tr>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                            </tr>
                            <tr>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;"></td>
                            </tr>
                        </tbody>
                    </table>
                    <p>Счет-фактура и положительное заключение, послужившие основанием для подтверждения в двустороннем порядке настоящего Акта , являются составляющей частью настоящего Акта и прилагаются.</p>
                    <div class="col-md-12 d-flex" style="margin-bottom: 3rem">
                        <table style="width: 100%; border: none !important">
                            <tbody>
                                <tr>
                                    <td style="border:none !important;">
                                        <div style="margin-top: 1.5rem; text-align: center;">
                                            <h6 style="font-weight: 700">Товар передал<span style="margin-left: 25px;"/></h6>
                                            <p style="font-weight: 700; margin-top: 1.5rem">	---------------------------------</p>
                                            <p style="font-size: 8px;margin-top: -20px; color: gray; margin-bottom: 35px; margin-left: 15px;">подпись<span style="margin-left: 25px;"/></p>
                                            <p style="font-weight: 700; margin-top: 1.5rem">	---------------------------------</p>
                                            <p style="font-size: 8px;margin-top: -20px; color: gray; margin-bottom: 35px; margin-left: 30px;">фамилия, имя<span style="margin-left: 25px;"/></p>
                                            <h6 style="font-weight: 700"><span style="margin-top: 25px;"/>М. П.</h6>
                                        </div>
                                    </td>
                                    <td>
                                        <div style="margin-top: 1.5rem; text-align: center;">
                                            <h6 style="font-weight: 700"><span style="margin-left: 25px;"/>Товар принят</h6>
                                            <p style="font-weight: 700; margin-top: 1.5rem">	---------------------------------</p>
                                            <p style="font-size: 8px; margin-top: -20px; color: gray; margin-bottom: 35px; margin-left: -15px;"><span style="margin-left: 25px;"/>подпись</p>
                                            <p style="font-weight: 700; margin-top: 1.5rem">	---------------------------------</p>
                                            <p style="font-size: 8px; margin-top: -20px; color: gray; margin-bottom: 35px; margin-left: 30px;">фамилия, имя<span style="margin-left: 25px;"/></p>
                                            <h6 style="font-weight: 700"><span style="margin-top: 25px;"/>М. П.</h6>
                                        </div>
                                    </td>
                                </tr>
                            </tbody>
                        </table>
                    </div>
                </div>
		        <div class="html2pdf__page-break"/>
                <div class="info-block">
                    <div style="text-align: right; margin-top: 3rem">Приложение N 3.1</div>
                    <div style="text-align: right">К Договору под кодом <span class="contract-code-ru" style="color: rgb(17, 85, 204);"></span></div>
                    <div style="text-align: right">Заключенному <span style="color: rgb(17, 85, 204);"><span class="getOrgnizeTypeByPlanRu"></span></span> 20   г.</div>
                    <br/>
                    <div style="margin-top: 3rem; text-align: center; font-weight: 700">
                        АКТ N_
                    </div>
                    <div style="text-align: center">
                        относительно фиксирования факта сдачи Заказчику результата договора
                    </div>
                    <p>Настоящим фиксируется, что в рамках договора закупки № ______________________,</p>
                    <p style="font-size: 8pt; margin-left: 420px; margin-top: -20px">номер договора</p>
                    <table>
                        <tr>
                            <td style="width: 50%">
                                <p>заключенного ______________________20</p>
                                <p style="font-size: 8pt; margin-left: 95px; margin-top: -20px">дата заключения договора</p>
                            </td>
                            <td style="width: 50%">
                                <p>г. между _________________________________</p>
                                <p style="font-size: 8pt; margin-left: 95px; margin-top: -20px">наименование Покупателя</p>
                            </td>
                        </tr>
                    </table>
                    <div>
                        <p>(далее — Покупатель) и____________________________________________(далее — Продавец),</p>
                        <p style="font-size: 8pt; margin-left: 215px; margin-top: -20px">наименование Продавца</p>
                    </div>
                    <p>Продавец _______ 20   г. передал с целью приема-передачи Покупателю нижеуказанные товары:</p>
                    <table style="width: 100%;
                                    table-layout: fixed;
                                    border-collapse: collapse;
                                    page-break-inside: avoid;
                                    border: 1px solid black;
                                    text-align: center;" cellspacing="8" cellpadding="8">
                        <tbody><tr>
                            <th colspan="3" style="border: 1px solid black;
                                                   border-collapse: collapse;">Товар</th>
                        </tr>
                        <tr>
                            <th style="border: 1px solid black;
                                       border-collapse: collapse;">наименование</th>
                            <th style="border: 1px solid black;
                                       border-collapse: collapse;">единица измерения</th>
                            <th style="border: 1px solid black;
                                       border-collapse: collapse;">объем (фактический)</th>
                        </tr>
                        <tr>
                            <td style="padding:20px;    
                                       border: 1px solid black;
                                       border-collapse: collapse;
                                       text-align: center;"></td>
                            <td style="padding:20px;
                                       border: 1px solid black;
                                       border-collapse: collapse;
                                       text-align: center;"></td>
                            <td style="padding:20px;
                                       border: 1px solid black;
                                       border-collapse: collapse;
                                       text-align: center;"></td>
                        </tr>
                        <tr>
                            <td style="padding:20px;
                                       border: 1px solid black;
                                       border-collapse: collapse;
                                       text-align: center;"></td>
                            <td style="padding:20px;
                                       border: 1px solid black;
                                       border-collapse: collapse;
                                       text-align: center;">
                            </td>
                            <td style="padding:20px;
                                       border: 1px solid black;
                                       border-collapse: collapse;
                                       text-align: center;"></td>
                        </tr>
                    </tbody></table>
                    <h6>Настоящий акт составлен в 2 экземплярах, каждой из сторон предоставляется по одному экземпляру.</h6>
                    <h6 style="text-align: right; margin-right: 20%; margin-top: 20px">СТОРОНЫ</h6>
                    <div class="col-md-12 d-flex" style="margin-bottom: 3rem">
                        <table style="width: 100%; border: none !important">
                            <tbody>
                                <tr>
                                    <td style="width: 50%">
                                        <div style="margin-top: 1.5rem; margin-right: 15px;">
                                            <h6 style="text-align: right; font-weight: 700; margin-bottom: 35px;">Передал<span style="margin-left: 25px;"/></h6>
                                            <p style="text-align: right; font-weight: 700; margin-top: 1.5rem">	---------------------------------</p>
                                            <p style="font-size: 8px; text-align: right ; margin-top: -20px; color: gray; margin-bottom: 35px; margin-right: 35px;">фамилия, имя<span style="margin-left: 25px;"/></p>
                                            <p style="text-align: right; font-weight: 700; margin-top: 1.5rem">	---------------------------------</p>
                                            <p style="font-size: 8px; text-align: right ; margin-top: -20px; color: gray; margin-bottom: 35px; margin-right: 45px;">подпись<span style="margin-left: 25px;"/></p>
                                        </div>
                                    </td>
                                    <td style="width: 50%;">
                                        <div style="margin-top: 20px; margin-left: 15px;">
                                            <h6 style="text-align: left; font-weight: 700"><span style="margin-left: 25px;"/>Принял <br> представитель, спроектировавший заявку:</h6>
                                            <p style="text-align: left; font-weight: 700; margin-top: 1.5rem">	---------------------------------</p>
                                            <p style="font-size: 8px; text-align: left ; margin-top: -20px; color: gray; margin-bottom: 35px; margin-left: 60px;">фамилия, имя<span style="margin-left: 25px;"/></p>
                                            <p style="text-align: left; font-weight: 700; margin-top: 1.5rem">	---------------------------------</p>
                                            <p style="font-size: 8px; text-align: left ; margin-top: -20px; color: gray; margin-bottom: 35px; margin-left: 45px;"><span style="margin-left: 25px;"/>подпись</p>
                                        </div>
                                    </td>
                                </tr>
                            </tbody>
                        </table>
                    </div>
                </div>
            </div>
        </section>
    </div>
</template>

<script>
import { required } from "vuelidate/lib/validators";
import purchaseTypesLongNamesCased from '@/mixins/purchaseTypes'
import $ from 'jquery';

export default {
    name: 'contract_draft_product',
    mixins: [purchaseTypesLongNamesCased],
    props: ['handleLoaded', 'handleLoadingStart', 'handleLoadingEnd'],
    data() {
        return {
            inputs: {
                copyCount: null,
                daysCount: null,
                violationDays: null,
                violationDays_1: null,
                calendar_days: null,
                workersCount: null,
            },
            participants: [],
            getOrgnizeTypeByPlan: '',
            participantsSequence: [],
            totalMembers: 0,
        }
    },
    validations() {
        const rules = {
            inputs: {
                violationDays: { required },
                violationDays_1: { required },
                workersCount: { required },
                daysCount: { required }
            }
        }
        if(+this.currentOrganized.organize_type === 0){
            Object.assign(rules.inputs, {
                copyCount: { required },
            })
        }
        if(this.organizedRows[0].is_main_tool === 1){
            Object.assign(rules.inputs, {
                calendar_days: { required },
            })
        }

        return rules;
    },
    mounted() { 
        this.$store.dispatch('organize/getCurrent', this.$route.params.id)
        const locale = 'ru'
        this.purchaseType = this.organizedRows[0].type
        this.getOrgnizeTypeByPlan = this.purchaseTypesLongNamesCased[locale][this.purchaseType || 2]
    },
    computed: {
        currentOrganized() {
            return this.$store.getters['organize/currentOrganized']
        },
        organizedRows() {
            return this.$store.getters['organize/organizedRows']
        },
        userChildren() {
            return this.$store.getters['user/userChildren']
        },
        me() {
            return this.$store.getters['user/me']
        },
    },
    watch: {
        currentOrganized: {
            immediate: true,
            async handler() {
                this.$store.dispatch('organize/getRows', {organizeId: this.$route.params.id})
                this.handleLoaded()
            },
        },
    },
    methods: {
        save() {
            this.$v.inputs.$touch();
            const _this = this
            let hasInvalid = false;
            $('#commandment-file .editor-input').each(function() {
                const inputName = $(this).attr('inputname');
                const input = _this.$v.inputs[inputName];
                if (input.$error) {
                    hasInvalid = true;
                    if(_this.$refs[inputName]._isVue) {
                        _this.$refs[inputName].$el.focus()
                    } else {
                        _this.$refs[inputName].focus();
                    }
                    return false;
                }
            });
            if (!hasInvalid) {
                this.handleLoadingStart()
                $('.editor-input').each(function() {
                    const txt = $(this).val()
                    $(this).after(txt)
                    $(this).remove()
                });

                $('.editor-option').each(function(index) {
                    const inputNumber = index+1
                    const optionValue = $(`.option-${inputNumber}:checked`).val()
                    const notSelectedOptionValue = +optionValue === 1 ? 2 : 1
                    $(`.option-${inputNumber}-variant-${notSelectedOptionValue}`).remove()
                    $(`.option-${inputNumber}`).remove()
                });
                 this.$client.put(`organize/${this.currentOrganized.id}`, {contract_html_ru: $('#commandment-file').html()}).then(({ status, data }) => {
                    // eslint-disable-next-line eqeqeq
                    if(status == 200) {
                    this.$store.commit('organize/setCurrentOrganized', data.data)
                        this.$notify({
                            group: 'foo',
                            type: 'success',
                            text: 'Հաջողությամբ թարմացված է'
                        })
                        this.$modal.hide('new-editor-modal')
                    }
                    this.isSaving = false
                    this.handleLoadingEnd()
                }).catch(e => {
                    this.handleLoadingEnd()
                    this.$notify({
                        group: 'foo',
                        type: 'error',
                        title: 'Ինչ որ բան այն չէ',
                        text: 'Կրկին փորձեք!'
                    })
                    this.isSaving = false
                })
            }
        },
        consoleLog(msg) {
            console.log(msg)
        },
        calculateMonthPrice(price, percent){
            return price*percent/100
        },
    },
}
</script>
<style>
.option-box *{
    color: grey;
}
.option-box-selected *{
    color: red;
}
</style>