<template>
    <div  id="commandment-file" ref="contract" contenteditable="true"> 
    <div>
            <div style="text-align: right; font-weight: 700;">Հավելված  N7</div>
            <div style="text-align: right; font-weight: 700;">«<span style="color: rgb(17, 85, 204);" class="getOrgnizeTypeByPlan">{{ currentOrganized.translations.code.hy }}</span>» ծածկագրով</div>
            <div style="text-align: right; font-weight: 700;"><span class="contract-code" style="color: rgb(17, 85, 204);">{{getOrgnizeTypeByPlan}}</span></div>
            <br/>
            <div style="text-align: center; font-weight: 700;">ՊԵՏՈՒԹՅԱՆ ԿԱՐԻՔՆԵՐԻ ՀԱՄԱՐ ԿԱՊԱԼԱՅԻՆ ԱՇԽԱՏԱՆՔՆԵՐԻ ԿԱՏԱՐՄԱՆ ՊԵՏԱԿԱՆ ԳՆՄԱՆ ՊԱՅՄԱՆԱԳԻՐ</div>
            <div style="text-align: center; font-weight: 700;">№ <span class="contract-code" style="color: rgb(17, 85, 204);"> {{ currentOrganized.translations.code.hy }}</span></div>
            <br/>
            <table style="width: 100%; border: none !important">
                <tbody>
                    <tr>
                        <td style="border:none !important;">
                            <div style="padding: 0 !important; text-align: left">
                                <h6><span class="ft-11" style="color: rgb(17, 85, 204);">{{ me.organisation[0].translations.city.hy }}</span></h6>
                            </div>
                        </td>
                        <td>
                            <div style="padding: 0 !important; text-align: right">
                                <h6><span style="color: rgb(17, 85, 204);" class="sign-date">__.__.____</span>թ.</h6>
                            </div>
                        </td>
                    </tr>
                </tbody>
            </table>
            <br/>
            <div style="text-align: justify">
                «<span style="color: rgb(17, 85, 204);">{{ me.organisation[0].translations.name.hy }}</span>» {{ me.organisation[0].translations.company_type.hy }}, ի դեմս
                {{ me.organisation[0].translations.director_position.hy }} <span style="color: rgb(17, 85, 204);">{{ me.organisation[0].translations.director_name.hy }}</span>ի, որը գործում է
                «<span style="color: rgb(17, 85, 204);">{{ me.organisation[0].translations.name.hy }}</span>» {{ me.organisation[0].translations.company_type.hy }}
                կանոնադրության հիման վրա (այսուհետ՝ Պատվիրատու), մի կողմից, և
                <span class="winner-name">_______</span>ն, ի դեմս տնօրեն <span class="winner-director">_______</span>-ի, որը գործում է <span class="winner-name">_______</span> կանոնադրության հիման վրա (այսուհետ՝ Կապալառու), մյուս կողմից, կնքեցին սույն պայմանագիրը հետևյալի մասին։
            </div>
            <br/>
            <div style="text-align: center; font-weight: 700;">1. ՊԱՅՄԱՆԱԳՐԻ ԱՌԱՐԿԱՆ</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>1.1 Կապալառուն պարտավորվում է  սույն պայմանագրով  սահմանված կարգով, նախատեսված ծավալներով, ձևով և ժամկետներում կատարել սույն պայմանագրի (այսուհետ` պայմանագիր) N 1 Հավելվածով սահմանված ծավալաթերթ-նախահաշվով նախատեսված <editor-input class="editor-input" type="text" style="border: 0; border-bottom: 1px solid #303030;" onkeypress="this.style.width = ((this.value.length + 1) * 12 + 5) + 'px';" inputName="work" ref="work" v-model="$v.inputs.work.$model" /> աշխատանքները (այսուհետ` աշխատանք), իսկ Պատվիրատուն պարտավորվում է ընդունել կատարված աշխատանքը և վարձատրել դրա համար։</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>1.2 Պայմանագրով նախատեսված աշխատանքները կատարվում են ՀՀ օրենսդրությամբ սահմանված ստանդարտներին, շինարարարական նորմերին և կանոններին, աշխատանքի նախագծին, ինչպես նաև պայմանագրի անբաժանելի մասը կազմող աշխատանքի ծավալաթերթ-նախահաշվին  համապատասխան։</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>1.3 Պայմանագրով նախատեսված աշխատանքները սկսվում են պայմանագիրն ուժի մեջ մտնելուց հետո և կատարման ժամկետը սահմանվում է` <editor-input class="editor-input" type="text" style="border: 0; border-bottom: 1px solid #303030;" onkeypress="this.style.width = ((this.value.length + 1) * 12 + 5) + 'px';" inputName="term" ref="term" v-model="$v.inputs.term.$model" /></div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>Պայմանագրով նախատեսված առանձին տեսակի աշխատանքների, փուլերի և ծավալների կատարման ժամկետները որոշվում են կողմերի կողմից համաձայնեցված օրացուցային գրաֆիկով (Հավելված N 2)։</div>
            <br/>
            <div style="text-align: center; font-weight: 700;">2. ԿԱՊԱԼԱՌՈՒԻ ՄԻՋՈՑՆԵՐՈՎ ԱՇԽԱՏԱՆՔՆԵՐԸ ԿԱՏԱՐԵԼԸ</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>2.1 Աշխատանքը կատարվում է Կապալառուի ուժերով, նյութերով և միջոցներով։</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>2.2 Կապալառուն պատասխանատվություն է կրում իր տրամադրած նյութերի և սարքավորումների որակի համար։</div>
            <br/>
            <div style="text-align: center; font-weight: 700;">3. ԿՈՂՄԵՐԻ ԻՐԱՎՈՒՆՔՆԵՐԸ ԵՎ ՊԱՐՏԱԿԱՆՈՒԹՅՈՒՆՆԵՐԸ</div>
            <div style="font-weight: 700;">3.1. Պատվիրատուն իրավունք ունի`</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>3.1.1 Ցանկացած ժամանակ ստուգել Կապալառուի իրականացրած աշխատանքի ընթացքը և որակը` առանց միջամտելու վերջինիս գործունեությանը.</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>3.1.2 Կապալառուի կողմից պայմանագրի 1.3 կետում նշված ժամկետի (ներառյալ օրացուցային գրաֆիկի) խախտման դեպքում իր հայեցողությամբ սահմանել աշխատանքի կատարման նոր ժամկետ և պահանջել Կապալառուից վճարելու պայմանագրի 6.2 կետով նախատեսված տույժը։</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>3.1.3 Չընդունել աշխատանքի արդյունքը` ՀՀ օրենսդրությամբ սահմանված դրույթներին, պայմանագրի 1.2 կետով նախատեսված փաստաթղթերի պահանջներին չհամապատասխանելու դեպքում` իր հայեցողությամբ սահմանելով թերությունների անհատույց վերացման ողջամիտ ժամկետ և պահանջել Կապալառուից վճարելու  պայմանագրի 6.2 կետով նախատեսված տույժը, ինչպես նաև 6.3 կետով նախատեսված տուգանքը։</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>3.1.4 Միակողմանի լուծել պայմանագիրը և պահանջել հատուցելու իրեն պատճառված վնասները, եթե.</div>
            <div style="text-align: justify;"><span style="margin-left: 40px;"/>ա) Կապալառուն ժամանակին չի սկսում աշխատանքի կատարումը կամ աշխատանքը կատարում է այնքան դանդաղ, որ դրա ժամանակին ավարտը  դառնում է ակնհայտ անհնար,</div>
            <div style="text-align: justify;"><span style="margin-left: 40px;"/>բ) Կապալառուն խախտել է պայմանագրի 1.3 կետում նախատեսված ժամկետը (ներառյալ օրացուցային գրաֆիկը),</div>
            <div style="text-align: justify;"><span style="margin-left: 40px;"/>գ) Կապալառուի կողմից կատարված աշխատանքը չի համապատասխանում նախագծանախահաշվային փաստաթղթերով սահմանված պահանջներին,</div>
            <div style="text-align: justify;"><span style="margin-left: 40px;"/>դ) Կապալառուի կողմից խախտվել են պայմանագրի 3.1.3 կետով նախատեսված հիմքերով աշխատանքի թերությունների անհատույց վերացման ողջամիտ ժամկետները.</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>3.1.5 Աշխատանքի արդյունքի թերությունների հետ կապված պահանջներ ներկայացնել  երաշխիքային ժամկետում։</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>3.1.6 Լիազորել այլ անձի` աշխատանքի իրականացման նկատմամբ տեխնիկական հսկողություն իրականացնելու նպատակով.</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>3.1.7 Մինչև Պատվիրատուի կողմից Կապալառուի կատարած աշխատանքի արդյունքն ընդունելը, պահանջել իրեն հանձնելու անավարտ աշխատանքի արդյունքը` պայմանագիրն օրենքով կամ պայմանագրով նախատեսված հիմքերով դադարեցնելու դեպքում։</div>
            <div style="font-weight: 700;">3.2. Պատվիրատուն պարտավոր է`</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>3.2.1 Աշխատանքը կատարելիս` աջակցել Կապալառուին պայմանագրով նախատեսված դեպքերում, ծավալով և կարգով.</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>3.2.2 Պայմանագրով նախատեսված ժամկետում և կարգով Կապալառուի մասնակցությամբ զննել և ընդունել կատարված աշխատանքը (դրա արդյունքը), իսկ պայմանագրից աշխատանքի արդյունքը վատթարացնող շեղումներ կամ աշխատանքում այլ թերություններ հայտնաբերելու դեպքերում` այդ մասին անհապաղ հայտնել Կապալառուին.</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>3.2.3 Պայմանագրի ուժի մեջ մտնելու պահից 5 աշխատանքային օրվա ընթացքում Կապալառուին տրամադրել աշխատանքի իրականացման համար համապատասխան տարածք.</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>3.2.4 Պայմանագրի 1.3 կետով նախատեսված ժամկետում աշխատանքի արդյունքն ընդունելու դեպքում Կապալառուին վճարել վերջինիս վճարման ենթակա գումարները։</div>
            <div style="font-weight: 700;">3.3. Կապալառուն իրավունք ունի`</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>3.3.1  Պայմանագրի 1.3 կետով նախատեսված ժամկետում աշխատանքի արդյունքը հանձնելու դեպքում Պատվիրատուից պահանջել վճարելու պայմանագրի 5.1 կետով նախատեսված` վճարման ենթակա գումարը։</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>3.3.2  Պատվիրատուի կողմից պայմանագրի 5.4 կետում նշված ժամկետների խախտման դեպքում Պատվիրատուից պահանջել վճարելու իրեն վճարման ենթակա գումարները և պայմանագրի 6.5 կետով նախատեսված տույժը։</div>
            <div style="font-weight: 700;">3.4. Կապալառուն պարտավոր է`</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>3.4.1  Աշխատանքների առնվազն <editor-input class="editor-input" type="text" style="border: 0; border-bottom: 1px solid #303030;" onkeypress="this.style.width = ((this.value.length + 1) * 12 + 5) + 'px';" inputName="percents" ref="percents" v-model="$v.inputs.percents.$model" /> տոկոսը կատարել անձամբ, պայմանագրով նախատեսված կարգով և ժամկետներում, իր ուժերով, գործիքներով, մեխանիզմներով, ինչպես նաև անհրաժեշտ նյութերով ու պատշաճ որակով` նախագծին և ծավալաթերթին համապատասխան։</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>3.4.2  Կատարել աշխատանքի վերաբերյալ Պատվիրատուի տված ցուցումները, եթե դրանք չեն հակասում պայմանագրի պայմաններին։ </div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>3.4.3  Ապահովել շինմոնտաժային աշխատանքների կատարումը շինարարական նորմերին, կանոններին ու տեխնիկական պայմաններին համապատասխան, կատարել իր կողմից մոնտաժված սարքավորման (էլեկտրական, ջեռուցման, ջրամատակարարման, կոյուղու, օդափոխիչ և այլն) անհատական փորձարկում, մասնակցել սարքավորման համալիր փորձարկմանը։</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>3.4.4  Աշխատանքի արդյունքը Պատվիրատուին հանձնելիս նրան հայտնել այն պահանջների և կանոնների մասին, որոնց պահպանումն անհրաժեշտ է աշխատանքի արդյունքի արդյունավետ և անվտանգ օգտագործման համար, ինչպես նաև տեղեկություններ հաղորդել այդ պահանջները և կանոնները չպահպանելու հնարավոր հետևանքների մասին։</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>3.4.5  Պայմանագրի 1.3 կետում նշված ժամկետը (ներառյալ օրացուցային գրաֆիկը) խախտելու և Պատվիրատուի կողմից աշխատանքի կատարման նոր ժամկետ սահմանվելու դեպքում, ապահովել աշխատանքի կատարումը սահմանված ժամկետում և յուրաքանչյուր ուշացված օրվա համար վճարել պայմանագրի  6.2 կետով նախատեսված տույժը։</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>3.4.6  Պայմանագրի 3.1.4 կետով նախատեսված հիմքերով պայմանագրի լուծման դեպքում հատուցել Պատվիրատուին պատճառված վնասները և վճարել 6.3 կետով նախատեսված տուգանքը։</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>3.4.7  Շինարարության օբյեկտի կոնսերվացման անհրաժեշտության ծագման դեպքում` իր միջոցներով կատարել աշխատանքը դադարեցնելու և շինարարությունը կոնսերվացնելու անհրաժեշտությունից բխող ողջամիտ ծախսերը։</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>3.4.8  Եթե շինարարական ծրագրերի կատարման արդյունքի կամ դրա առանձին բաղադրիչի համար սահմանված երաշխիքային ժամկետի ընթացքում ի հայտ են եկել կատարված աշխատանքի թերություններ, ապա Կապալառուն պարտավոր է իր հաշվին, Պատվիրատուի կողմից սահմանված ողջամիտ ժամկետում վերացնել թերությունները։</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>3.4.9  Պայմանագրով երաշխիքային ժամկետ է սահմանվում Պատվիրատուի կողմից ողջ ծավալով Աշխատանքն ընդունվելու օրվան հաջորդող օրվանից հաշված առնվազն <span style="color: rgb(17, 85, 204);">365 օրացուցային օր</span>։ Եթե երաշխիքային ժամկետի ընթացքում ի հայտ են եկել կատարված Աշխատանքի թերություններ, ապա Կապալառուն պարտավոր է իր հաշվին, Պատվիրատուի կողմից սահմանված ողջամիտ ժամկետում վերացնել թերությունները:</div>
            <div style="text-align: justify; color: rgb(17, 85, 204);"><span style="margin-left: 25px;"/>3.4.10 Կապալի օբյեկտի, դրա առանձին մասերի (կոնստրուկցիաներ և այլն) և օգտագործվելիք  նյութերի և (կամ) սարքերի ու սարքավորումների երաշխիքային ժամկետներին ներկայացվող նվազագույն պահանջները ներկայացված են պայմանագրի N – Հավելվածում:</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>3.4.11 Որակավորման և պայմանագրի կատարման ապահովման գործողության ընթացքում լուծարման կամ սնանկացման գործընթաց սկսելու դեպքում դրա մասին նախապես գրավոր տեղեկացնել Պատվիրատուին։</div>
            <br/>
            <div style="text-align: center; font-weight: 700;">4. ԱՇԽԱՏԱՆՔԻ ՀԱՆՁՆՄԱՆ ԵՎ ԸՆԴՈՒՆՄԱՆ ԿԱՐԳԸ</div>
            <div v-if="currentOrganized.organize_type === '1'">
                <div style="text-align: justify;"><span style="margin-left: 25px;"/>4.1 Կատարված աշխատանքը ընդունվում է Պատվիրատուի և Կապալառուի միջև հանձնման-ընդունման արձանագրության ստորագրմամբ: Աշխատանքը Պատվիրատուին հանձնելու փաստը ֆիքսվում է Պատվիրատուի և Կապալառուի միջև երկկողմ հաստատված փաստաթղթով՝ նշելով փաստաթղթի կազմման ամսաթիվը:</div>
                <div style="text-align: justify;"><span style="margin-left: 25px;"/>Մինչև պայմանագրով աշխատանքի կատարման համար նախատեսված օրը ներառյալ Կապալառուն Պատվիրատուին է տրամադրում իր կողմից ստորագրված` աշխատանքը Պատվիրատուին հանձնելու փաստը ֆիքսող փաստաթուղթը (հավելված N 4.1), իսկ էլեկտրոնային գնումների armeps համակարգի միջոցով (գործողության իրականացման ձեռնարկը տեղադրված է www.procurement.am հասցեով գործող կայքի «Էլեկտրոնային գնումներ» բաժնում)` նաև հանձնման-ընդունման արձանագրությունը (հավելված N 4): Ընդ որում Կապալառուն հանձնման-ընդունման արձանագրությունը չի կնքում, հաստատում է էլեկտրոնային ստորագրությամբ` լրացնելով միայն այն սյունակները, որոնք վերաբերում են իր տվյալներին (լրացման կարգը տեղադրված է www.procurement.am հասցեով գործող կայքի «Օրենսդրություն» բաժնի «Ֆինանսների նախարարի հրամաններ» ենթաբաժնում): </div>
                <div style="text-align: justify;"><span style="margin-left: 25px;"/>4.2 Եթե կատարված աշխատանքը համապատասխանում է պայմանագրի պայմաններին, Պատվիրատուն պայմանագրի 4.1 կետում նշված փաստաթղթերը ստանալու օրվան հաջորդող աշխատանքային օրվանից հաշված <editor-input class="editor-input" type="text" style="border: 0; border-bottom: 1px solid #303030;" onkeypress="this.style.width = ((this.value.length + 1) * 12 + 5) + 'px';" inputName="work_days" ref="work_days" v-model="$v.inputs.work_days.$model" /> աշխատանքային օրվա ընթացքում ստորագրում և էլեկտրոնային գնումների armeps համակարգի միջոցով Կապալառուին է տրամադրում իր կողմից ստորագրված հանձնման-ընդունման արձանագրությունը և դրա ստորագրման համար հիմք հանդիսացած դրական եզրակացությունը:</div>
                <div style="text-align: justify;"><span style="margin-left: 25px;"/>4.3 Եթե կատարված աշխատանքը կամ դրա մի մասը չի համապատասխանում պայմանագրի պայմաններին, ապա Պատվիրատուն չի ստորագրում հանձնման-ընդունման արձանագրությունը և պայմանագրի 4.2 կետում նշված ժամկետում էլեկտրոնային գնումների armeps համակարգի միջոցով Կապալառուին հետ է վերադարձնում հանձնման-ընդունման արձանագրությունը և դրա չստորագրման համար հիմք հանդիսացած բացասական եզրակացությունը: Սույն կետի կիրառման դեպքում Պատվիրատուն  ձեռնարկում է նման իրավիճակի համար պայմանագրով նախատեսված միջոցները և Կապալառուի նկատմամբ կիրառում է պայմանագրով նախատեսված պատասխանատվության միջոցներ։</div>
                <div style="text-align: justify;"><span style="margin-left: 25px;"/>4.4 Եթե պայմանագրի 4.2 կետով սահմանված ժամկետում Պատվիրատուն չի ընդունում կատարված աշխատանքը կամ չի մերժում դրա ընդունումը, ապա կատարված աշխատանքը համարվում է ընդունված և պայմանագրի 4.2 կետով սահման­ված վերջնաժամկետին հաջորդող աշխատանքային օրը Պատվիրատուն էլեկտրոնային գնումների համակարգի միջոցով Կապալառուին է տրամադրում իր կողմից ստորագրված հանձնման-ընդունման արձանա­գրությունը:</div>
                <div style="text-align: justify;"><span style="margin-left: 25px;"/>4.5 Աշխատանքի կամ պայմանագրի օրացուցային գրաֆիկով նախատեսված առանձին տեսակի աշխատանքների, փուլերի և ծավալների արդյունքները նախագծանախահաշվային փաստաթղթերին չհամապատասխանելու դեպքում կողմերը կազմում են երկկողմ ակտ` թվարկելով թերությունների վերացման համար պահանջվող` կատարման ենթակա լրացուցիչ աշխատանքները և ժամկետները։ Կապալառուն պարտավոր է պայմանագրային գնի սահմաններում, առանց լրացուցիչ վճարի, կատարել անհրաժեշտ աշխատանքներ։</div>
            </div>  
            <div v-if="currentOrganized.organize_type === '0'">
                <div style="text-align: justify;"><span style="margin-left: 25px;"/>4.1 Կատարված աշխատանքը ընդունվում է Պատվիրատուի և Կապալառուի միջև հանձնման-ընդունման արձանագրության ստորագրմամբ: Աշխատանքը Պատվիրատուին հանձնելու փաստը ֆիքսվում է Պատվիրատուի և Կապալառուի միջև երկկողմ հաստատված փաստաթղթով՝ նշելով փաստաթղթի կազմման ամսաթիվը:</div>
                <div style="text-align: justify;"><span style="margin-left: 40px;"/>Մինչև պայմանագրով աշխատանքի կատարման համար նախատեսված օրը ներառյալ Կապալառուն Պատվիրատուին է տրամադրում իր կողմից ստորագրված` աշխատանքը Պատվիրատուին հանձնելու փաստը ֆիքսող փաստաթուղթը (հավելված N 3.1) և հանձնման-ընդունման արձանագրության <editor-input class="editor-input" type="text" style="border: 0; border-bottom: 1px solid #303030;" onkeypress="this.style.width = ((this.value.length + 1) * 12 + 5) + 'px';" inputName="quantity" ref="quantity" v-model="$v.inputs.quantity.$model" /> օրինակ (հավելված N 3):</div>
                <div style="text-align: justify;"><span style="margin-left: 25px;"/>4.2 Հանձնման-ընդունման արձանագրությունն ստորագրվում է, եթե կատարված աշխատանքը համապատասխանում է պայմանագրի պայմաններին։ Հակառակ դեպքում պայմանագրի կամ դրա մի մասի կատարման արդյունքները չեն ընդունվում, հանձնման-ընդունման արձանագրություն չի ստորագրվում և Պատվիրատուն`</div>
                <div style="text-align: justify;"><span style="margin-left: 40px;"/>ա) հարցի կարգավորման համար ձեռնարկում է նման իրավիճակի համար պայմանագրով նախատեսված միջոցները.</div>
                <div style="text-align: justify;"><span style="margin-left: 25px;"/>բ) Կապալառուի նկատմամբ կիրառում է պայմանագրով նախատեսված պատասխանատվության միջոցներ։</div>
                <div style="text-align: justify;"><span style="margin-left: 25px;"/>4.3 Պատվիրատուն հանձնման-ընդունման արձանագրությունը ստանալու օրվան հաջորդող աշխատանքային օրվանից հաշված 
                <input type="text"
                    class="editor-input"
                    v-model="$v.inputs.daysCount.$model"
                    ref="daysCount"
                    inputName="daysCount"
                    style="width: 30px;border-top: 0 !important; border-left: 0 !important; border-right: 0 !important; text-align: right;   
                    font-size: 13px;
                    color: #303e67;
                    border-bottom: 1px solid black"
                    onkeypress="this.style.width = ((this.value.length + 1) * 8 + 2) + 'px';"
                />
                աշխատանքային օրվա ընթացքում Կապալառուին է ներկայացնում իր կողմից ստորագրված հանձնման-ընդունման արձանագրության մեկ օրինակը կամ աշխատանքը չընդունելու պատճառաբանված մերժումը։</div>
                <div style="text-align: justify;"><span style="margin-left: 25px;"/>4.4 Եթե պայմանագրի 4.3 կետով սահմանված ժամկետում Պատվիրատուն չի ընդունում կատարված աշխատանքը կամ չի մերժում դրա ընդունումը, ապա կատարված աշխատանքը համարվում է ընդունված և պայմանագրի 4.3 կետով սահման­ված վերջնաժամկետին հաջորդող աշխատանքային օրը Պատվիրատուն   Կապալառուին տրամադրում իր կողմից հաստատված հանձնման-ընդունման արձանա­գրությունը:</div>
                <div style="text-align: justify;"><span style="margin-left: 25px;"/>4.5 Աշխատանքի կամ պայմանագրի օրացուցային գրաֆիկով նախատեսված առանձին տեսակի աշխատանքների, փուլերի և ծավալների արդյունքները նախագծանախահաշվային փաստաթղթերին չհամապատասխանելու դեպքում կողմերը կազմում են երկկողմ ակտ` թվարկելով թերությունների վերացման համար պահանջվող` կատարման ենթակա լրացուցիչ աշխատանքները և ժամկետները։ Կապալառուն պարտավոր է պայմանագրային գնի սահմաններում, առանց լրացուցիչ վճարի, կատարել անհրաժեշտ աշխատանքներ։</div>
            </div>
            <div style="text-align: justify;color: rgb(17, 85, 204);"><span style="margin-left: 25px;"/>4.6 Աշխատանքն ընդունելիս կիրառվում են նաև հետևյալ պայմանները`</div>
            <div style="text-align: justify;color: rgb(17, 85, 204);"><span style="margin-left: 40px;"/>1) Կապալառուի կողմից շինարարության ավարտի մասին տեղեկություն ստանալուց հետո Պատվիրատուի ղեկավարը ձեռնարկում է միջոցներ Հայաստանի Հանրապետության կառավարության 2015 թվականի մարտի 19-ի N 596-Ն որոշմամբ սահմանված հանձնաժողով ձևավորելու և կատարված աշխատանքներն ընդունելու համար.</div>
            <div style="text-align: justify;color: rgb(17, 85, 204);"><span style="margin-left: 40px;"/>2) պայմանագրի կատարման արդյունքը համարվում է ամբողջությամբ ընդունված պետական կառավարման մարմնի ղեկավարի` Հայաստանի Հանրապետության կառավարության 2015 թվականի մարտի 19-ի N 596-Ն որոշմամբ սահմանված կարգով ձևավորված հանձնաժողովի (այսուհետ` ընդունող հանձնաժողով) կողմից կատարված աշխատանքներն ընդունվելու դեպքում.</div>
            <div style="text-align: justify;color: rgb(17, 85, 204);"><span style="margin-left: 40px;"/>3) մինչև ավարտված շինարարական օբյեկտի ընդունումը` Հայաստանի Հանրապետության կառավարության 2015 թվականի մարտի 9-ի N 596-Ն որոշման համապատասխան ստեղծված հանձնաժողովը Հայաստանի Հանրապետության օրենսդրությամբ սահմանված կարգով փաստագրում է ավարտված շինարարության օբյեկտը և կազմում օբյեկտը շահագործման ընդունող հանձնաժողովի ակտ.</div>
            <div style="text-align: justify;color: rgb(17, 85, 204);"><span style="margin-left: 40px;"/>4) սույն կետի 3-րդ ենթակետում նշված ակտը սահմանված կարգով ստանալուց հետո պատասխանատու ստորաբաժանումն ստուգում է ավարտված շինարարական օբյեկտի (կատարված աշխատանքների) համապատասխանությունը պայմանագրի պահանջներին և, եթե կատարված աշխատանքը`</div>
            <div style="text-align: justify;color: rgb(17, 85, 204);"><span style="margin-left: 40px;"/>ա. համապատասխանում է պայմանագրի պայմաններին, ապա ստորագրվում է պայմանագրի կատարման արդյունքն ընդունելու մասին հանձնման-ընդունման ավարտական արձանագրություն,</div>
            <div style="text-align: justify;color: rgb(17, 85, 204);"><span style="margin-left: 40px;"/>բ. չի համապատասխանում պայմանագրի պայմաններին, ապա արձանագրություն չի ստորագրվում.</div>
            <div style="text-align: justify;color: rgb(17, 85, 204);"><span style="margin-left: 40px;"/>5) մինչև սույն կետով նախատեսված պայմանագրի կատարման արդյունքն ընդունելու մասին հանձնման-ընդունման ավարտական արձանագրությունն ստորագրելը՝ Պատվիրատուն չի վճարում կապիտալ շինարարության համար կատարված աշխատանքների ընդհանուր գումարի հինգ տոկոսը, իսկ տարաժամկետ վճարելու դեպքում` վերջին վճարման գումարը, որը չի կարող պակաս լինել կապիտալ շինարարության համար կատարված աշխատանքների ընդհանուր գումարի հինգ տոկոսից:</div>
            <br/>
            <div style="text-align: center; font-weight: 700;">5. ԱՇԽԱՏԱՆՔԻ ԳԻՆԸ ԵՎ ՎԱՐՁԱՏՐՈՒԹՅՈՒՆԸ</div>
            <div style="text-align: justify;color: rgb(17, 85, 204);"><span style="margin-left: 25px;"/>5.1 Սույն պայմանագրի ընդհանուր գինը կազմում է <span class="contract-price">_______</span> (<span class="contract-price-word">______________</span>) ՀՀ դրամ, որից <span class="contract-det">ՀՀ դրամը` ԱԱՀ-ն։</span> Գինը ներառում է Կապալառուի կողմից իրականացվող բոլոր ծախսերը, ընդ որում`
            <div v-if="+currentOrganized.prepayment" style="text-align: justify;"><span style="margin-left: 25px;"/>5.1.1 Պայմանագրի գնից` մինչև {{ currentOrganized.prepayment_max }} ՀՀ դրամը, Պատվիրատուն փոխանցում է Կապալառուի բանկային հաշվին` որպես կանխավճար։</div>
            <div v-if="+currentOrganized.prepayment" style="text-align: justify;"><span style="margin-left: 25px;"/>Կանխավճարի մարումն իրականացվում է հանձնման-ընդունման արձանագրությունների հիման վրա կատարվող վճարումներից նվազեցումներ (պահումներ) կատարելու ձևով։ Ընդ որում մինչև կանխավճարի ամբողջական մարումը, Կապալառուին վճարումներ չեն կատարվում:</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>5.2 Աշխատանքի գինը կայուն է և Կապալառուն իրավունք չունի պահանջել ավելացնելու, իսկ Պատվիրատուն նվազեցնելու այդ գինը։</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>5.3 Պատվիրատուն վճարում է աշխատանքի կամ պայմանագրի օրացուցային գրաֆիկով նախատեսված` առանձին տեսակի աշխատանքների, փուլերի և ծավալների`  պայմանագրի 4-րդ բաժնով նախատեսված կարգով ընդունելու դեպքում Հայաստանի Հանրապետության դրամով անկանխիկ` դրամական միջոցները Կապալառուի հաշվարկային հաշվին փոխանցելու միջոցով։ Դրամական միջոցների փոխանցումը կատարվում է հանձման-ընդունման արձանագրության հիման վրա` պայմանագրի վճարման  ժամանակացույցով (հավելված N 2) նախատեսված չափերով և ամիներին: Եթե արձանագրությունը կազմվում է տվյալ ամսվա 20-ից հետո և այդ ամսում վճարման ժամանակացույցով նախատեսված են ֆինանսական միջոցներ, ապա վճարումն իրականացվում է մինչև 30 աշխատանքային օրվա ընթացքում, բայց ոչ ուշ, քան մինչև տվյալ տարվա դեկտեմբերի 30-ը։</div>
            <span style="margin-left: 25px;"/>Ընդ որում վճարում կատարելու նպատակով հանձնման-ընդունման արձանագրությունն ստորագրվելու օրվանից հետո 3 աշխատանքային օրվա ընթացքում Պատվիրատուն վճարման հանձնարարագիրը և հանձնման-ընդունման արձանագրության պատճենը մուտքագրում է լիազորված մարմնի գանձապետական համակարգ, իսկ սահմանված կարգի համաձայն ներկայացված փաստաթղթերի հիման վրա լիազորված մարմինը տվյալ վճարումը կատարում է հանձնման-ընդունման արձանագրությունը գանձապետական համակարգ մուտքագրված լինելու դեպքում՝ սույն պայմանագրի վճարման ժամանակացույցով սահմանված ժամկետներում, հինգ աշխատանքային օրվա ընթացքում: 
            <br/>
            <br/>
            <div style="text-align: center; font-weight: 700;">6. ԿՈՂՄԵՐԻ ՊԱՏԱՍԽԱՆԱՏՎՈՒԹՅՈՒՆԸ</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>6.1 Կապալառուն պատասխանատվություն է կրում Աշխատանքի որակի և սույն պայմանագրի 1.3 կետով (ներառյալ օրացուցային գրաֆիկը) նախատեսված ժամկետի պահպանման համար։</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>6.2 Սույն պայմանագրով նախատեսված Աշխատանքի կատարման ժամկետը խախտելու դեպքում Կապալառուից յուրաքանչյուր ուշացված աշխատանքային օրվա համար գանձվում է տույժ` կատարման ենթակա, սակայն չկատարված Աշխատանքի գնի 0,05 (զրո ամբողջ հինգ հարյուրերրորդական) տոկոսի չափով։</div>
            <span style="text-align: justify;" v-if="!currentOrganized.is_with_condition"><span style="margin-left: 25px;"/>6.3 Պայմանագրի 3.1.3 կետով նախատեսված հիմքերով Պատվիրատուի կողմից աշխատանքը չընդունվելու, ինչպես նաև 3.1.4 կետով նախատեսված կարգով պայմանագիրը լուծելու դեպքում Կապալառուից գանձվում է տուգանք` պայմանագրի 5.1 կետում նախատեսված գումարի 0,5 (զրո ամբողջ հինգ տասնորդական) տոկոսի չափով:</span>
            <span style="text-align: justify;" v-else><span style="margin-left: 25px;"/>6.3. Պայմանագրի N 1 հավելվածում նշված տեխնիկական բնութագրին չհամապատասխանող ծառայություն մատուցելու յուրաքանչյուր դեպքում Կատարողից գանձվում է տուգանք` պայմանագրի 5.1 կետում նախատեսված գումարի 0,5 (զրո ամբողջ հինգ տասնորդական) տոկոսի չափով: Եթե պայմանագիրը կնքվել է «Գնումների մասին» ՀՀ օրենքի 15-րդ հոդվածի 6-րդ կետի հիման վրա, ապա տուգանքը հաշվարկվում է այն համաձայնագրի գնի նկատմամբ, որի շրջանակում արձանագրվել է ստանձնված պարտավորությունների չկատարման կամ ոչ պատշաճ կատարման հանգամանքը: Եթե պայմանագիրը ներառում է մեկից ավել չափաբաժին, ապա տուգանքը հաշվարկվում է պայմանագրով այդ չափաբաժնի համար սահմանված ընդհանուր գնի նկատմամբ:</span>
            <span>Ընդ որում տուգանքը հաշվարկվում է նաև աշխատանքի արդյունքը սույն պայմանագրով սահմանված ժամկետում կատարելու, սակայն պատվիրատուի կողմից այդ չընդունվելու դեպքում:</span>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>6.4 Պայմանագրի 6.2 և 6.3 կետերով նախատեսված տույժը և տուգանքը հաշվարկվում և հաշվանցվում են  Կապալառուին վճարվող գումարների հետ։</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>6.5 Պատվիրատուի կողմից պայմանագրի 5.3 կետով նախատեսված ժամկետների խախտման համար Պատվիրատուի նկատմամբ յուրաքանչյուր ուշացված աշխատանքային օրվա համար հաշվարկվում է տույժ` վճարման ենթակա, սակայն չվճարված  գումարի 0,05 (զրո ամբողջ հինգ հարյուրերրորդական) տոկոսի չափով։</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>6.6	Պայամանագրով չնախատեսված դեպքերում կողմերն իրենց պարտավորությունները չկատարելու կամ ոչ պատշաճ կատարելու համար պատասխանատվություն են կրում ՀՀ օրենսդրությամբ սահմանված կարգով։</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>6.7 Տույժերի և (կամ) տուգանքների վճարումը կողմերին չի ազատում իրենց պայմանագրային պարտավորությունները կատարելուց։</div>
            <br/>
            <div style="text-align: center; font-weight: 700;">7. ԱՆՀԱՂԹԱՀԱՐԵԼԻ ՈՒԺԻ ԱԶԴԵՑՈՒԹՅՈՒՆԸ (ՖՈՐՍ-ՄԱԺՈՐ)</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>Սույն պայմանագրով պարտավորություններն ամբողջությամբ կամ մասնակիորեն չկատարելու համար կողմերն ազատվում են պատասխանատվությունից, եթե դա եղել է անհաղթահարելի ուժի ազդեցության հետևանքով, որը ծագել է սույն պայմանագիրը կնքելուց հետո, և որը կողմերը  չէին կարող կանխատեսել կամ կանխարգելել։ Այդպիսի իրավիճակներ են երկրաշարժը, ջրհեղեղը, հրդեհը, պատերազմը, ռազմական և արտակարգ դրություն հայտարարելը, քաղաքական հուզումները, գործադուլները, հաղորդակցության միջոցների աշխատանքի դադարեցումը, պետական մարմինների ակտերը և այլն, որոնք անհնարին են դարձնում սույն պայմանագրով պարտավորությունների կատարումը։ Եթե արտակարգ ուժի ազդեցությունը շարունակվում է 3 (երեք) ամսից ավելի, ապա կողմերից յուրաքանչյուրն իրավունք ունի լուծել պայմանագիրը` այդ մասին նախապես տեղյակ պահելով մյուս կողմին։</div>
            <br/>
            <div style="text-align: center; font-weight: 700;">8. ԱՅԼ ՊԱՅՄԱՆՆԵՐ</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>8.1 Պայմանագիրն ուժի մեջ է մտնում Կողմերի ստորագրման պահից և գործում է մինչև կողմերի պայմանագրով ստանձնած պարտավորությունների ողջ ծավալով կատարումը։</div>
            <div style="text-align: justify; color: rgb(17, 85, 204);" v-if="currentOrganized.rights_responsibilities_fulfillment"><span style="margin-left: 40px;"/>Պայմանագրով նախատեսված կողմերի իրավունքների և պարտականությունների կատարման պայման է հանդիսանում պայմանագիրը ՀՀ ֆինանսների նախարարության կողմից հաշվառված լինելու հանգամանքը:</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>8.2 Պայմանագրից ծագած` կողմի վճարային պարտավորությունը չի կարող դադարել այլ պայմանագրից ծագած` հակընդդեմ պարտավորության հաշվանցով, առանց կողմերի գրավոր և կնիքով հաստատված համաձայնության։ Պայմանագրից ծագած պահանջի իրավունքը չի կարող փոխանցվել այլ անձի, առանց պարտապան կողմի գրավոր համաձայնության։</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>8.3 Այն դեպքում, երբ օրենքով նախատեսված կարգով օրենքի պահանջների կատարման նկատմամբ հսկողության կամ վերահսկողության կամ բողոքների քննության արդյունքում արձանագրվում է, որ գնման գործընթացում, մինչև պայմանագրի կնքումը, Կապալառուն ներկայացրել է կեղծ փաստաթղթեր (տեղեկություններ և տվյալներ), կամ վերջինիս ընտրված մասնակից ճանաչելու մասին որոշումը չի համապատասխանում Հայաստանի Հանրապետության օրենսդրությանը, ապա այդ հիմքերն ի հայտ գալուց հետո Պատվիրատուն միակողմանիորեն լուծում է պայմանագիրը, եթե արձանագրված խախտումները մինչև պայմանագրի կնքումը հայտնի լինելու դեպքում գնումների մասին Հայաստանի Հանրապետության օրենսդրության համաձայն հիմք կհանդիսանային պայմանագիրը չկնքելու համար։ Ընդ որում, Պատվիրատուն չի կրում պայմանագրի միակողմանի լուծման հետևանքով Կապալառուի համար առաջացող վնասների կամ բաց թողնված օգուտի ռիսկը, իսկ վերջինս պարտավոր է Հայաստանի Հանրապետության օրենքով սահմանված կարգով փոխհատուցել իր մեղքով Պատվիրատուի կրած վնասներն այն ծավալով, որի մասով պայմանագիրը լուծվել է։</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>8.4 Պայմանագրի հետ կապված վեճերը ենթակա են քննության Հայաստանի Հանրապետության դատարաններում։</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>8.5 Պայմանագրում փոփոխություններ և լրացումներ կարող են կատարվել միայն Կողմերի փոխադարձ համաձայնությամբ` համաձայնագիր կնքելու միջոցով, որը կհանդիսանա պայմանագրի անբաժանելի մասը։</div>
            <div style="text-align: justify;"><span style="margin-left: 40px;"/>Արգելվում է պայմանագրում, իսկ եթե պայմանագրի գինը գործոնային է, ապա նաև այդ պայմանագրին կից հաջորդող յուրաքանչյուր տարիներին կնքված համաձայնագրում կատարել այնպիսի փոփոխություններ, որոնք հանգեցնում են գնվող աշխատանքի ծավալների կամ ձեռք բերվող աշխատանքի միավորի գնի կամ պայմանագրի գնի արհեստական փոփոխման։</div>
            <div style="text-align: justify;"><span style="margin-left: 40px;"/>Պայմանագրի կողմերից անկախ գործոնների ազդեցությամբ պայմանագրի փոփոխման յուրաքանչյուր դեպք սահմանում է Հայաստանի Հանրապետության կառավարությունը։</div>
            <div style="text-align: justify;color: rgb(17, 85, 204);"><span style="margin-left: 25px;"/>8.6 Եթե պայմանագիրն իրականացվում է ենթակապալի պայմանագիր կնքելու միջոցով.</div>
            <div style="text-align: justify;color: rgb(17, 85, 204);"><span style="margin-left: 40px;"/>1) Կապալառուն պատասխանատվություն է կրում ենթակապալառուի պարտավորությունների չկատարման կամ ոչ պատշաճ կատարման համար.</div>
            <div style="text-align: justify;color: rgb(17, 85, 204);"><span style="margin-left: 40px;"/>2) պայմանագրի կատարման ընթացքում ենթակապալառուի փոփոխման դեպքում Կապալառուն գրավոր տեղեկացնում է Պատվիրատուին՝ տրամադրելով ենթակապալի պայմանագրի պատճենը և դրա կողմ հանդիսացող անձի տվյալները՝ փոփոխությունը կատարվելու օրվանից հինգ աշխատանքային օրվա ընթացքում:</div>
            <div style="text-align: justify;color: rgb(17, 85, 204);"><span style="margin-left: 25px;"/>8.7 Եթե պայմանագիրն իրականացվում է համատեղ գործունեության (կոնսորցիումի) պայմանագիր կնքելու միջոցով, ապա այդ պայմանագրի մասնակիցները կրում են համատեղ և համապարտ պատասխանատվություն: Ընդ որում, կոնսորցիումի անդամի կոնսորցիումից դուրս գալու դեպքում պայմանագիրը միակողմանիորեն լուծվում է և կոնսորցիումի անդամների նկատմամբ կիրառվում են պայմանագրով նախատեսված պատասխանատվության միջոցները:</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>8.8 Աշխատանքի կատարման ժամկետը կարող է երկարաձգվել մինչև պայմանագրով այդ ժամկետը լրանալը` Կապալառուի առաջարկության առկայության դեպքում` պայմանով, որ Պատվիրատուի մոտ չի վերացել աշխատանքի օգտագործման պահանջը, իսկ Կապալառուի առաջարկությունը ներկայացվել է ոչ ուշ, քան պայմանագրով ի սկզբանե աշխատանքների կատարման համար սահմանված ժամկետը լրանալուց առնվազն 5 օրացուցային օր առաջ: Ընդ որում սույն կետով սահմանված դեպքում աշխատանքի կատարման ժամկետը կարող է երկարաձգվել մեկ անգամ մինչև 30 օրացուցային օրով, բայց ոչ ավել քան պայմանագրով սահմանված ժամկետն է:</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>8.9 Պայմանագրի պատշաճ կատարման պայմաններում կողմերի (Կապալառու կամ Պատվիրատու) օգուտները (խնայողություններ) կամ կրած վնասները տվյալ կողմի օգուտը կամ կրած վնասն են։</div>
            <div style="text-align: justify;"><span style="margin-left: 40px;"/>Պայմանագրի կողմերի` երրորդ անձանց նկատմամբ պարտավորությունները՝ ներառյալ պայմանագրի կատարման շրջանակում Կապալառուի կնքած այլ գործարքները և դրանցից բխող պարտավորությունները, դուրս են պայմանագրի կարգավորման դաշտից և չեն կարող ազդել պայմանագրի կատարման արդյունքն ընդունելու վրա։ Այդ գործարքների և դրանցից բխող պարտավորությունների կատարման հետ կապված հարաբերությունները կարգավորվում են այդ գործարքների հետ կապված հարաբերությունները կարգավորող նորմերով, և դրանց համար պատասխանատու է Կապալառուն։</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>8.10 Պայմանագիրը չի կարող փոփոխվել կողմերի պարտա­վորու­թյունների մասնակի չկատարման հետևանքով կամ ամբողջությամբ լուծվել կողմերի փոխադարձ համաձայնությամբ՝ բացառությամբ` Հայաստանի Հանրապետության օրենսդրությամբ սահմանված կարգով աշխատանքի կատարման համար անհրաժեշտ ֆինանսական հատկացումների նվազեցման դեպքերի: Ընդ որում, պայմանագրի կողմերի` պարտավորությունների մասնակի չկատարման կամ ամբողջությամբ լուծման կողմերի փոխադարձ համաձայնությունն անհրաժեշտ է ձեռք բերել նախքան Հայաստանի Հանրապետության օրենսդրությամբ սահմանված կարգով աշխատանքի կատարման համար անհրաժեշտ ֆինանսական հատկացումների նվազեցումը:</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>8.11 Կապալառուի կողմից ստանձնած պարտավորությունները չկատա­րելու կամ ոչ պատշաճ կատարելու հիմքով պայմանագիրն ամբողջությամբ կամ մասնակի միակողմանի լուծելու մասին ծանուցումը Պատվիրատուն հրապարակում է www.procurement.am հասցեով գործող ինտերնետային կայքի «Պայմանագրերը միակողմանի լուծելու մասին ծանուցումներ» բաժնում` նշելով հրապարակման ամսաթիվը: Կապալառուն, պայմանագիրը միակողմանի լուծելու վերաբերյալ, համարվում է պատշաճ ծանուցված` ծանուցումը, սույն կետով սահմանված հրապարակվելուն հաջորդող օրվանից: Պայմանագիրն ամբողջությամբ կամ մասնակի միակողմանի լուծելու մասին ծանուցումը տեղեկագրում հրապարակվելու օրը Պատվիրատուն այն ուղարկվում է նաև Կապալառուի էլեկտրոնային փոստին:</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>8.12 Սույն պայմանագրի կապակցությամբ ծագած վեճերը լուծվում են բանակցությունների միջոցով։ Համաձայնություն ձեռք չբերելու դեպքում վեճերը լուծվում են դատական կարգով։</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>8.13 Սույն պայմանագիրը կազմված է <span class="pages-count">__</span> էջից, կնքվում է երկու օրինակից, որոնք ունեն հավասարազոր իրավաբանական ուժ, յուրաքանչյուր կողմին տրվում է մեկական օրինակ։ Սույն պայմանագրի N 1, N 2, N 3, N 4 և N 4.1 հավելվածները, համարվում են պայմանագրի անբաժանելի մասը։</div>
            <div style="text-align: justify;"><span style="margin-left: 25px;"/>8.14 Սույն պայմանագրի հետ կապված  հարաբերությունների նկատմամբ կիրառվում է Հայաստանի Հանրապետության իրավունքը։</div>
            <div v-if="currentOrganized.is_with_condition">
                <div v-if="total < 25000000" style="text-align: justify;"><span style="margin-left: 25px;"/>8.15. Պայմանագրով նախատեսված աշխատանքների կատարումն իրականացվում է այդ նպատակով ֆինանսական միջոցների առկայության և դրա հիման վրա կողմերի միջև համապատասխան համաձայնագրի կնքման միջոցով: Պայմանագիրը լուծվում է, եթե այն կնքելու օրվան հաջորդող վեց ամսվա ընթացքում այդ նպատակով պայմանագրի կատարման համար ֆինանսական միջոցներ չեն նախատեսվում: Եթե պայմանագրի կատարման համար հատկացված ֆինանսական միջոցների չափը գերազանցում է գնումների բազային միավորի քսանհինգապատիկը, ապա Պատվիրատուի կողմից համաձայնագիր կկնքվի, եթե Կապալառուի կողմից տուժանքի ձևով ներկայացված որակավորման և պայմանագրի ապահովումները` նախատեսված ֆինանսական միջոցների չափով, փոխարինվում են  երաշխիքով կամ կանխիկ փողով` հաշվի առնելով ՀՀ կառավարության 2017 թվականի մայիսի 4-ի N 526-Ն որոշման N 1 հավելվածի 32-րդ կետի 17-րդ ենթակետի «բ» պարբերության պահանջները: Ընդ որում, Կապալառուն համաձայնագիրը կնքում, իսկ տուժանքի ձևով ներկայացված որակավորման և պայմանագրի ապահովումների փոխարինման դեպքում նաև նոր ապահովումները Պատվիրատուին ներկայացնում է համաձայնագիր կնքելու ծանուցումը ստանալու օրվանից տասնհինգ աշխատանքային օրվա ընթացքում։ Հակառակ դեպքում պայմանագիրը Պատվիրատուի կողմից միակողմանիորեն լուծվում է: </div>
                <div v-if="total > 25000000" style="text-align: justify;"><span style="margin-left: 25px;"/>8.15. Պայմանագրով նախատեսված ծառայությունների մատուցումն իրականացվում է այդ նպատակով ֆինանսական միջոցների առկայության և դրա հիման վրա կողմերի միջև համապատասխան համաձայնագրի կնքման միջոցով: Պայմանագիրը լուծվում է, եթե այն կնքելու օրվան հաջորդող վեց ամսվա ընթացքում այդ նպատակով պայմանագրի կատարման համար ֆինանսական միջոցներ չեն նախատեսվում: Ընդ որում, Կապալառուն համաձայնագիրը կնքում և Պատվիրատուին ներկայացնում է համաձայնագիր կնքելու ծանուցումը ստանալու օրվանից տասնհինգ աշխատանքային օրվա ընթացքում։ Հակառակ դեպքում պայմանագիրը Պատվիրատուի կողմից միակողմանիորեն լուծվում է:</div>
            </div>
            <br>
            <div style="text-align: center; font-weight: 700;">9. ԿՈՂՄԵՐԻ ՀԱՍՑԵՆԵՐԸ, ԲԱՆԿԱՅԻՆ ՎԱՎԵՐԱՊԱՅՄԱՆՆԵՐԸ ԵՎ ՍՏՈՐԱԳՐՈՒԹՅՈՒՆՆԵՐԸ</div>
            <br>
            <table style="width: 100%; border: none !important">
                <tbody>
                    <tr style="display: flex;">
                        <td style="width: 50%; display: flex; justify-content: center;">
                            <div>
                                <h6 class="ft-11" style="font-weight: 700">ՊԱՏՎԻՐԱՏՈՒ</h6>
                                <p class="ft-11" style="font-size: 14px;">" {{ me.organisation[0].translations.name.hy }} " {{ me.organisation[0].translations.company_type.hy }}</p>                                      
                                <p class="ft-11" style="font-size: 14px;" v-if="me.organisation[0].translations.region.hy === me.organisation[0].translations.city.hy">{{ me.organisation[0].translations.city.hy }} {{ me.organisation[0].translations.address.hy }}</p>
                                <p class="ft-11" style="font-size: 14px;" v-else>{{ me.organisation[0].translations.region.hy }} {{ me.organisation[0].translations.city.hy }} {{ me.organisation[0].translations.address.hy }}</p>
                                <p class="ft-11" style="font-size: 14px;">Բանկ՝ {{ me.organisation[0].translations.bank_name.hy }}</p>
                                <p class="ft-11" style="font-size: 14px;">Հ/Հ  {{ me.organisation[0].bank_account }} </p>
                                <p class="ft-11" style="font-size: 14px;">ՀՎՀՀ {{ me.organisation[0].tin }} </p>
                                <p class="ft-11" style="font-size: 14px;">{{ me.organisation[0].translations.director_position.hy }}՝ {{ me.organisation[0].translations.director_name.hy }}</p>                                          
                                <p class="ft-11" style="font-size: 14px;">_____________________________________________________________</p>
                                <p style="text-align: center;font-size: 8px; margin-top: -20px; color: gray; margin-bottom: 35px;">ստորագրություն</p>
                            </div>
                        </td>
                        <td style="width: 50%; display: flex; justify-content: center;">
                            <div>
                                <h6 class="ft-11" style="font-weight: 700">ԿԱՊԱԼԱՌՈՒ</h6>
                                <p class="ft-11" style="font-size: 14px;"> " <span class="winner-name">______________</span> " <span class="winner-type">_______</span></p>
                                <p class="ft-11" style="font-size: 14px;"><span class="winner-address">_____________________</span></p>
                                <p class="ft-11" style="font-size: 14px;">Բանկ՝<span class="winner-bank">___________</span></p>
                                <p class="ft-11" style="font-size: 14px;">Հ/Հ <span class="winner-bank_account">_____________________</span></p>
                                <p class="ft-11" style="font-size: 14px;">ՀՎՀՀ <span class="winner-tin">______________</span></p>
                                <p class="ft-11" style="font-size: 14px;">Տնօրեն՝ <span class="winner-director">_____________________</span></p>
                                <p class="ft-11" style="font-size: 14px;">____________________________________________</p>
                                <p style="text-align: center;font-size: 8px; margin-top: -20px; color: gray; margin-bottom: 35px;">ստորագրություն</p>
                            </div>
                        </td>
                    </tr>
                </tbody>
            </table>
            <br>
            <i style="text-align: justify;">Անհրաժեշտության դեպքում պայմանագրի նախագծում կարող են ներառվել ՀՀ օրենսդրությանը չհակասող դրույթներ։</i>
            <pagebreak/>
            <br class="page-break"/>
            <div class="mt-5">
                <div style="text-align: right; font-weight: 700">Հավելված N 1</div>
                <div style="text-align: right; font-weight: 700"><span class="sign-date">__.__.____</span>թ կնքված</div>
                <div style="text-align: right; font-weight: 700"><span class="contract-code" style="color: rgb(17, 85, 204);"></span> ծածկագրով գնման պայմանագրի</div>
                <br/>
                <div style="text-align: center; font-weight: 700">ԾԱՎԱԼԱԹԵՐԹ-ՆԱԽԱՀԱՇԻՎ*</div>
                <div style="text-align: center; font-weight: 700">« <editor-input class="editor-input" type="text" style="border: 0; border-bottom: 1px solid #303030;" onkeypress="this.style.width = ((this.value.length + 1) * 12 + 5) + 'px';" inputName="done_works" ref="done_works" v-model="$v.inputs.done_works.$model" /> » ԱՇԽԱՏԱՆՔՆԵՐԻ ԿԱՏԱՐՄԱՆ</div>
                <br/>
                <div style="text-align: center;"> 
                    * Կապալառուն աշխատանքները կատարում է
                    <span v-if="me.organisation[0].translations.region.hy === me.organisation[0].translations.city.hy"> г. {{ me.organisation[0].translations.city.hy}} {{ me.organisation[0].translations.address.hy }}</span>
                    <span v-else>{{ me.organisation[0].translations.region.hy }} г. {{ me.organisation[0].translations.city.hy }} {{ me.organisation[0].translations.address.hy }}</span>
                    հասցեում:
                </div>
                <br/>
                <table style="width: 100%; border: none !important">
                    <tbody>
                        <tr style="display: flex;">
                            <td style="width: 50%; display: flex; justify-content: center;">
                                <div>
                                    <h6 class="ft-11" style="font-weight: 700">ՊԱՏՎԻՐԱՏՈՒ</h6>
                                    <p class="ft-11" style="font-size: 14px;">" {{ me.organisation[0].translations.name.hy }} " {{ me.organisation[0].translations.company_type.hy }}</p>                                      
                                    <p class="ft-11" style="font-size: 14px;" v-if="me.organisation[0].translations.region.hy === me.organisation[0].translations.city.hy">{{ me.organisation[0].translations.city.hy }} {{ me.organisation[0].translations.address.hy }}</p>
                                    <p class="ft-11" style="font-size: 14px;" v-else>{{ me.organisation[0].translations.region.hy }} {{ me.organisation[0].translations.city.hy }} {{ me.organisation[0].translations.address.hy }}</p>
                                    <p class="ft-11" style="font-size: 14px;">Բանկ՝ {{ me.organisation[0].translations.bank_name.hy }}</p>
                                    <p class="ft-11" style="font-size: 14px;">Հ/Հ  {{ me.organisation[0].bank_account }} </p>
                                    <p class="ft-11" style="font-size: 14px;">ՀՎՀՀ {{ me.organisation[0].tin }} </p>
                                    <p class="ft-11" style="font-size: 14px;">{{ me.organisation[0].translations.director_position.hy }}՝ {{ me.organisation[0].translations.director_name.hy }}</p>                                          
                                    <p class="ft-11" style="font-size: 14px;">_____________________________________________________________</p>
                                    <p style="text-align: center; font-size: 8px; margin-top: -20px; color: gray; margin-bottom: 35px;">ստորագրություն</p>
                                </div>
                            </td>
                            <td style="width: 50%; display: flex; justify-content: center;">
                                <div>
                                    <h6 class="ft-11" style="font-weight: 700">ԿԱՊԱԼԱՌՈՒ</h6>
                                    <p class="ft-11" style="font-size: 14px;"> " <span class="winner-name">______________</span> " <span class="winner-type">_______</span></p>
                                    <p class="ft-11" style="font-size: 14px;"><span class="winner-address">_____________________</span></p>
                                    <p class="ft-11" style="font-size: 14px;">Բանկ՝<span class="winner-bank">___________</span></p>
                                    <p class="ft-11" style="font-size: 14px;">Հ/Հ <span class="winner-bank_account">_____________________</span></p>
                                    <p class="ft-11" style="font-size: 14px;">ՀՎՀՀ <span class="winner-tin">______________</span></p>
                                    <p class="ft-11" style="font-size: 14px;">Տնօրեն՝ <span class="winner-director">_____________________</span></p>
                                    <p class="ft-11" style="font-size: 14px;">____________________________________________</p>
                                    <p style="text-align: center; font-size: 8px; margin-top: -20px; color: gray; margin-bottom: 35px;">ստորագրություն</p>
                                </div>
                            </td>
                        </tr>
                    </tbody>
                </table>
            </div>
            <pagebreak/>
            <br class="page-break"/>
            <div>
                <div style="text-align: right; font-weight: 700">Հավելված N 2</div>
                <div style="text-align: right; font-weight: 700"><span class="sign-date">__.__.____</span>թ կնքված</div>
                <div style="text-align: right; font-weight: 700"><span class="contract-code" style="color: rgb(17, 85, 204);"></span> ծածկագրով գնման պայմանագրի</div>
                <br/>
                <div style="text-align: center; font-weight: bold;">ՕՐԱՑՈՒՑԱՅԻՆ ԳՐԱՖԻԿ</div>
                <div style="text-align: center; font-weight: bold;"> « <editor-input class="editor-input" type="text" style="border: 0; border-bottom: 1px solid #303030;" onkeypress="this.style.width = ((this.value.length + 1) * 12 + 5) + 'px';" inputName="done_works_appendix_2" ref="done_works_appendix_2" v-model="$v.inputs.done_works_appendix_2.$model" /> » ԱՇԽԱՏԱՆՔՆԵՐԻ ԿԱՏԱՐՄԱՆ</div>
                <br/>
                <div v-if="currentOrganized.calendar_schedule && currentOrganized.calendar_schedule !== null && currentOrganized.calendar_schedule !== undefined" v-html="currentOrganized.calendar_schedule">
                </div>
                <div v-else>
                    <table style="  font-size: 10px;
                                    width: 100%;
                                    table-layout: fixed;
                                    border-collapse: collapse;
                                    page-break-inside: avoid;
                                    border: 1px solid black;
                                    border-collapse: collapse;
                                    text-align: center;">
                    <tr>
                        <td rowspan="2" style="    
                                border: 1px solid black;
                                border-collapse: collapse;">N ը/կ</td>
                        <td rowspan="2" style="    
                                border: 1px solid black;
                                border-collapse: collapse;">Կապալառուի կողմից կատարվելիք աշխատանքների առանձին տեսակների անվանումներ</td>
                        <td colspan="2" style="    
                                border: 1px solid black;
                                border-collapse: collapse;">Աշխատանքների  կատարման ժամկետը**</td>
                    </tr>
                    <tr>
                        <td style="    
                                border: 1px solid black;
                                border-collapse: collapse;">Սկիզբը</td>
                        <td style="    
                                border: 1px solid black;
                                border-collapse: collapse;">Ավարտը</td>
                    </tr>
                    <tr>
                        <td style="    
                                border: 1px solid black;
                                border-collapse: collapse;">1</td>
                        <td style="    
                                border: 1px solid black;
                                border-collapse: collapse;"></td>
                        <td style="    
                                border: 1px solid black;
                                border-collapse: collapse;"></td>
                        <td style="    
                                border: 1px solid black;
                                border-collapse: collapse;"></td>
                    </tr>
                    <tr>
                        <td style="    
                                border: 1px solid black;
                                border-collapse: collapse;">2</td>
                        <td style="    
                                border: 1px solid black;
                                border-collapse: collapse;"></td>
                        <td style="    
                                border: 1px solid black;
                                border-collapse: collapse;"></td>
                        <td style="    
                                border: 1px solid black;
                                border-collapse: collapse;"></td>
                    </tr>
                    <tr>
                        <td style="    
                                border: 1px solid black;
                                border-collapse: collapse;">3</td>
                        <td style="    
                                border: 1px solid black;
                                border-collapse: collapse;"></td>
                        <td style="    
                                border: 1px solid black;
                                border-collapse: collapse;"></td>
                        <td style="    
                                border: 1px solid black;
                                border-collapse: collapse;"></td>
                    </tr>
                    <tr>
                        <td style="    
                                border: 1px solid black;
                                border-collapse: collapse;">4</td>
                        <td style="    
                                border: 1px solid black;
                                border-collapse: collapse;"></td>
                        <td style="    
                                border: 1px solid black;
                                border-collapse: collapse;"></td>
                        <td style="    
                                border: 1px solid black;
                                border-collapse: collapse;"></td>
                    </tr>
                    <tr>
                        <td style="    
                                border: 1px solid black;
                                border-collapse: collapse;">5</td>
                        <td style="    
                                border: 1px solid black;
                                border-collapse: collapse;"></td>
                        <td style="    
                                border: 1px solid black;
                                border-collapse: collapse;"></td>
                        <td style="    
                                border: 1px solid black;
                                border-collapse: collapse;"></td>
                    </tr>
                    <tr>
                        <td style="    
                                border: 1px solid black;
                                border-collapse: collapse;">...</td>
                        <td style="    
                                border: 1px solid black;
                                border-collapse: collapse;"></td>
                        <td style="    
                                border: 1px solid black;
                                border-collapse: collapse;"></td>
                        <td style="    
                                border: 1px solid black;
                                border-collapse: collapse;"></td>
                    </tr>
                    <tr>
                        <td style="    
                                border: 1px solid black;
                                border-collapse: collapse;" colspan="2">ԸՆԴԱՄԵՆԸ</td>
                        <td style="    
                                border: 1px solid black;
                                border-collapse: collapse;"></td>
                        <td style="    
                                border: 1px solid black;
                                border-collapse: collapse;"></td>
                    </tr>
                    </table>
                </div>
                <br/>
                <i v-if="currentOrganized.is_with_condition"> ** Եթե պայմանագիրը կնքվում է "Գնումների մասին" ՀՀ օրենքի 15-րդ հոդվածի 6-րդ մասի հիման վրա, ապա «Սկիզբը» սյունակում ժամկետի սկիզբը նշվում է ֆինանսական միջոցներ նախատեսվելու դեպքում կողմերի միջև կնքվող համաձայնագրի ուժի մեջ մտնելու օրը:</i>
                <br/>
                <table style="width: 100%; border: none !important">
                    <tbody>
                        <tr style="display: flex;">
                            <td style="width: 50%; display: flex; justify-content: center;">
                                <div>
                                    <h6 class="ft-11" style="font-weight: 700">ՊԱՏՎԻՐԱՏՈՒ</h6>
                                    <p class="ft-11" style="font-size: 14px;">" {{ me.organisation[0].translations.name.hy }} " {{ me.organisation[0].translations.company_type.hy }}</p>                                      
                                    <p class="ft-11" style="font-size: 14px;" v-if="me.organisation[0].translations.region.hy === me.organisation[0].translations.city.hy">{{ me.organisation[0].translations.city.hy }} {{ me.organisation[0].translations.address.hy }}</p>
                                    <p class="ft-11" style="font-size: 14px;" v-else>{{ me.organisation[0].translations.region.hy }} {{ me.organisation[0].translations.city.hy }} {{ me.organisation[0].translations.address.hy }}</p>
                                    <p class="ft-11" style="font-size: 14px;">Բանկ՝ {{ me.organisation[0].translations.bank_name.hy }}</p>
                                    <p class="ft-11" style="font-size: 14px;">Հ/Հ  {{ me.organisation[0].bank_account }} </p>
                                    <p class="ft-11" style="font-size: 14px;">ՀՎՀՀ {{ me.organisation[0].tin }} </p>
                                    <p class="ft-11" style="font-size: 14px;">{{ me.organisation[0].translations.director_position.hy }}՝ {{ me.organisation[0].translations.director_name.hy }}</p>                                          
                                    <p class="ft-11" style="font-size: 14px;">_____________________________________________________________</p>
                                    <p style="text-align: center;font-size: 8px; margin-top: -20px; color: gray; margin-bottom: 35px;">ստորագրություն</p>
                                </div>
                            </td>
                            <td style="width: 50%; display: flex; justify-content: center;">
                                <div>
                                    <h6 class="ft-11" style="font-weight: 700">ԿԱՊԱԼԱՌՈՒ</h6>
                                    <p class="ft-11" style="font-size: 14px;"> " <span class="winner-name">______________</span> " <span class="winner-type">_______</span></p>
                                    <p class="ft-11" style="font-size: 14px;"><span class="winner-address">_____________________</span></p>
                                    <p class="ft-11" style="font-size: 14px;">Բանկ՝<span class="winner-bank">___________</span></p>
                                    <p class="ft-11" style="font-size: 14px;">Հ/Հ <span class="winner-bank_account">_____________________</span></p>
                                    <p class="ft-11" style="font-size: 14px;">ՀՎՀՀ <span class="winner-tin">______________</span></p>
                                    <p class="ft-11" style="font-size: 14px;">Տնօրեն՝ <span class="winner-director">_____________________</span></p>
                                    <p class="ft-11" style="font-size: 14px;">____________________________________________</p>
                                    <p style="text-align: center;font-size: 8px; margin-top: -20px; color: gray; margin-bottom: 35px;">ստորագրություն</p>
                                </div>
                            </td>
                        </tr>
                    </tbody>
                </table>
            </div>
            <pagebreak/>
            <br class="page-break"/>
            <div>
                <div style="text-align: right; font-weight: 700">Հավելված N 3</div>
                <div style="text-align: right; font-weight: 700"><span class="sign-date">__.__.____</span>թ կնքված</div>
                <div style="text-align: right; font-weight: 700"><span class="contract-code" style="color: rgb(17, 85, 204);"></span> ծածկագրով գնման պայմանագրի</div>
                <br /> 
                <div style="text-align: center; font-weight: 700">­­­­­­­­­­­­­­ՎՃԱՐՄԱՆ ԺԱՄԱՆԱԿԱՑՈՒՅՑ*</div>
                <br/>
                <div style="text-align: right; font-weight: 700">ՀՀ դրամ</div>
                <table   style="font-size: 10px;
                                width: 100%;
                                table-layout: fixed;
                                border-collapse: collapse;
                                break-inside: avoid;
                                border: 1px solid black;
                                text-align: center;" cellspacing="4" cellpadding="4" class="ft-5"> 
                    <tbody>
                    <tr>
                            <th colspan="16" style="border: 1px solid black;
                                                    border-collapse: collapse;">Աշխատանքի</th>
                        </tr>
                        <tr>
                            <th rowspan="2" style="border: 1px solid black;
                                                   border-collapse: collapse;">Չ/Հ</th>
                            <th rowspan="2" style="border: 1px solid black;
                                                   border-collapse: collapse;">CPV կոդ</th>
                            <th rowspan="2" style="border: 1px solid black;
                                                   border-collapse: collapse;">անվանումը</th>
                            <th colspan="13" style="border: 1px solid black;
                                                    border-collapse: collapse;">դիմաց վճարումները նախատեսվում է իրականացնել {{new Date().getFullYear()}} թ-ին` ըստ ամիսների, այդ թվում**</th>
                        </tr>
                        <tr>
                            <th style="border: 1px solid black;
                                       writing-mode: vertical-lr;
                                       border-collapse: collapse;">հունվար</th>
                            <th style="border: 1px solid black;
                                       writing-mode: vertical-lr;
                                       border-collapse: collapse;">փետրվար</th>
                            <th style="border: 1px solid black;
                                       writing-mode: vertical-lr;
                                       border-collapse: collapse;">մարտ</th>
                            <th style="border: 1px solid black;
                                       writing-mode: vertical-lr;
                                       border-collapse: collapse;">ապրիլ</th>
                            <th style="border: 1px solid black;
                                       writing-mode: vertical-lr;
                                       border-collapse: collapse;">մայիս</th>
                            <th style="border: 1px solid black;
                                       writing-mode: vertical-lr;
                                       border-collapse: collapse;">հունիս</th>
                            <th style="border: 1px solid black;
                                       writing-mode: vertical-lr;
                                       border-collapse: collapse;">հուլիս</th>
                            <th style="border: 1px solid black;
                                       writing-mode: vertical-lr;
                                       border-collapse: collapse;">օգոստոս</th>
                            <th style="border: 1px solid black;
                                       writing-mode: vertical-lr;
                                       border-collapse: collapse;">սեպտեմբեր</th>
                            <th style="border: 1px solid black;
                                       writing-mode: vertical-lr;
                                       border-collapse: collapse;">հոկտեմբեր</th>
                            <th style="border: 1px solid black;
                                       writing-mode: vertical-lr;
                                       border-collapse: collapse;">նոյեմբեր</th>
                            <th style="border: 1px solid black;
                                       writing-mode: vertical-lr;
                                       border-collapse: collapse;">դեկտեմբեր</th>
                            <th style="border: 1px solid black;
                                       writing-mode: vertical-lr;
                                       border-collapse: collapse;">Ընդամենը</th>
                        </tr>
                    </tbody>
                    <tbody class="payment-schedule">
                            <tr v-for="(row, rowIndex) in currentOrganized.organize_rows" :key="rowIndex">
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{ rowIndex + 1 }}</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{ row.procurement_plan.cpv.code }}{{ row.procurement_plan.cpv_drop && '/' }}{{ row.procurement_plan.cpv_drop }}</td>
                                <td style="border: 1px solid black;
                                           border-collapse: collapse;
                                           text-align: center;">{{ row.procurement_plan.cpv.name }}</td>
                                <template v-if="row.organize_row_percent">
                                    <td style="border: 1px solid black;
                                               border-collapse: collapse;
                                               text-align: center;">{{ row.organize_row_percent.month_1 !== null ? row.organize_row_percent.month_1 + '%'  : '-' }}</td>
                                    <td style="border: 1px solid black;
                                                border-collapse: collapse;
                                                text-align: center;">{{ row.organize_row_percent.month_2 !== null ? row.organize_row_percent.month_2 + '%'  : '-' }}</td>
                                    <td style="border: 1px solid black;
                                                border-collapse: collapse;
                                                text-align: center;">{{ row.organize_row_percent.month_3 !== null ? row.organize_row_percent.month_3 + '%'  : '-' }}</td>
                                    <td style="border: 1px solid black;
                                                border-collapse: collapse;
                                                text-align: center;">{{ row.organize_row_percent.month_4 !== null ? row.organize_row_percent.month_4 + '%'  : '-' }}</td>
                                    <td style="border: 1px solid black;
                                                border-collapse: collapse;
                                                text-align: center;">{{ row.organize_row_percent.month_5 !== null ? row.organize_row_percent.month_5 + '%'  : '-' }}</td>
                                    <td style="border: 1px solid black;
                                                border-collapse: collapse;">{{ row.organize_row_percent.month_6 !== null ? row.organize_row_percent.month_6 + '%'  : '-' }}</td>
                                    <td style="border: 1px solid black;
                                                border-collapse: collapse;">{{ row.organize_row_percent.month_7 !== null ? row.organize_row_percent.month_7 + '%'  : '-' }}</td>
                                    <td style="border: 1px solid black;
                                                border-collapse: collapse;">{{ row.organize_row_percent.month_8 !== null ? row.organize_row_percent.month_8 + '%'  : '-' }}</td>
                                    <td style="border: 1px solid black;
                                                border-collapse: collapse;">{{ row.organize_row_percent.month_9 !== null ? row.organize_row_percent.month_9 + '%'  : '-' }}</td>
                                    <td style="border: 1px solid black;
                                                border-collapse: collapse;">{{ row.organize_row_percent.month_10 !== null ? row.organize_row_percent.month_10 + '%'  : '-' }}</td>
                                    <td style="border: 1px solid black;
                                                border-collapse: collapse;">{{ row.organize_row_percent.month_11 !== null ? row.organize_row_percent.month_11 + '%'  : '-' }}</td>
                                    <td style="border: 1px solid black;
                                                border-collapse: collapse;">{{ row.organize_row_percent.month_12 !== null ? row.organize_row_percent.month_12 + '%'  : '-' }}</td>
                                    <td v-if="row.organize_row_percent.month_1 === null && row.organize_row_percent.month_2 === null && row.organize_row_percent.month_3 === null && row.organize_row_percent.month_4 === null && row.organize_row_percent.month_5 === null && row.organize_row_percent.month_6 === null && row.organize_row_percent.month_7 === null && row.organize_row_percent.month_8 === null && row.organize_row_percent.month_9 === null && row.organize_row_percent.month_10 === null && row.organize_row_percent.month_11 === null && row.organize_row_percent.month_12 === null" 
                                    style="border: 1px solid black;
                                            border-collapse: collapse;">-</td>
                                    <td v-else style="border: 1px solid black;
                                                        border-collapse: collapse;"> 100% </td>    
                                </template>
                                <template v-else>
                                    <td style="border: 1px solid black;
                                                border-collapse: collapse;"></td>
                                    <td style="border: 1px solid black;
                                                border-collapse: collapse;"></td>
                                    <td style="border: 1px solid black;
                                                border-collapse: collapse;"></td>
                                    <td style="border: 1px solid black;
                                                border-collapse: collapse;"></td>
                                    <td style="border: 1px solid black;
                                                border-collapse: collapse; "></td>
                                    <td style="border: 1px solid black;
                                                border-collapse: collapse;"></td>
                                    <td style="border: 1px solid black;
                                                border-collapse: collapse; "></td>
                                    <td style="border: 1px solid black;
                                                border-collapse: collapse; "></td>
                                    <td style="border: 1px solid black;
                                                border-collapse: collapse;"></td>
                                    <td style="border: 1px solid black;
                                                border-collapse: collapse;"></td>
                                    <td style="border: 1px solid black;
                                                border-collapse: collapse;"></td>
                                    <td style="border: 1px solid black;
                                                border-collapse: collapse;"></td>
                                    <td style="border: 1px solid black;
                                                border-collapse: collapse;"></td>
                                </template>   
                            </tr>
                </tbody>
                </table>
                <br/>
                <div style="text-align: justify;"> * Վճարման ենթակա գումարները ներկայացվում են աճողական կարգով:
                </div>
                <div v-if="currentOrganized.is_with_condition">Եթե պայմանագիրը կնքվում է "Գնումների մասին" ՀՀ օրենքի 15-րդ հոդվածի 6-րդ մասի հիման վրա, ապա սույն ժամանակացույցը լրացվում և կնքվում է ֆինանսական միջոցներ նախատեսվելու դեպքում կողմերի միջև կնքվող համաձայնագրի հետ միաժամանակ` որպես դրա անբաժանելի մաս:</div>
                <div style="text-align: justify;">
                    ** հրավերում գումարները նշվում են տոկոսով, իսկ պայմանագիրը կնքելիս տոկոսի փոխարեն նշվում է կոնկրետ գումարի չափ
                </div>
                <br/>
                <table style="width: 100%; border: none !important">
                    <tbody>
                        <tr style="display: flex;">
                            <td style="width: 50%; display: flex; justify-content: center;">
                                <div>
                                    <h6 class="ft-11" style="font-weight: 700">ՊԱՏՎԻՐԱՏՈՒ</h6>
                                    <p class="ft-11" style="font-size: 14px;">" {{ me.organisation[0].translations.name.hy }} " {{ me.organisation[0].translations.company_type.hy }}</p>                                      
                                    <p class="ft-11" style="font-size: 14px;" v-if="me.organisation[0].translations.region.hy === me.organisation[0].translations.city.hy">{{ me.organisation[0].translations.city.hy }} {{ me.organisation[0].translations.address.hy }}</p>
                                    <p class="ft-11" style="font-size: 14px;" v-else>{{ me.organisation[0].translations.region.hy }} {{ me.organisation[0].translations.city.hy }} {{ me.organisation[0].translations.address.hy }}</p>
                                    <p class="ft-11" style="font-size: 14px;">Բանկ՝ {{ me.organisation[0].translations.bank_name.hy }}</p>
                                    <p class="ft-11" style="font-size: 14px;">Հ/Հ  {{ me.organisation[0].bank_account }} </p>
                                    <p class="ft-11" style="font-size: 14px;">ՀՎՀՀ {{ me.organisation[0].tin }} </p>
                                    <p class="ft-11" style="font-size: 14px;">{{ me.organisation[0].translations.director_position.hy }}՝ {{ me.organisation[0].translations.director_name.hy }}</p>                                          
                                    <p class="ft-11" style="font-size: 14px;">_____________________________________________________________</p>
                                    <p style="text-align: center;font-size: 8px; margin-top: -20px; color: gray; margin-bottom: 35px;">ստորագրություն</p>
                                </div>
                            </td>
                            <td style="width: 50%; display: flex; justify-content: center;">
                                <div>
                                    <h6 class="ft-11" style="font-weight: 700">ԿԱՊԱԼԱՌՈՒ</h6>
                                    <p class="ft-11" style="font-size: 14px;"> " <span class="winner-name">______________</span> " <span class="winner-type">_______</span></p>
                                    <p class="ft-11" style="font-size: 14px;"><span class="winner-address">_____________________</span></p>
                                    <p class="ft-11" style="font-size: 14px;">Բանկ՝<span class="winner-bank">___________</span></p>
                                    <p class="ft-11" style="font-size: 14px;">Հ/Հ <span class="winner-bank_account">_____________________</span></p>
                                    <p class="ft-11" style="font-size: 14px;">ՀՎՀՀ <span class="winner-tin">______________</span></p>
                                    <p class="ft-11" style="font-size: 14px;">Տնօրեն՝ <span class="winner-director">_____________________</span></p>
                                    <p class="ft-11" style="font-size: 14px;">____________________________________________</p>
                                    <p style="text-align: center;font-size: 8px; margin-top: -20px; color: gray; margin-bottom: 35px;">ստորագրություն</p>
                                </div>
                            </td>
                        </tr>
                    </tbody>
                </table>
            </div>
            <pagebreak/>
            <br class="page-break"/>
            <div>
                <div style="text-align: right; font-weight: 700; ">Հավելված N 4</div>
                <div style="text-align: right; font-weight: 700; "><span class="sign-date">__.__.____</span>թ կնքված</div>
                <div style="text-align: right; font-weight: 700; "><span class="contract-code" style="color: rgb(17, 85, 204);"></span> ծածկագրով գնման պայմանագրի</div>
                <br/>
                <table style="width: 100%; border: none !important">
                    <tbody>
                        <tr style="display: flex;">
                            <td style="display: flex; width: 50%; justify-content: center;">
                                <div>
                                    <p class="ft-11" style="font-size: 14px; font-weight: 700; ">Պայմանագրի կողմ </p>
                                    <p class="ft-11" style="font-size: 14px; ">____________________ </p>
                                    <p class="ft-11" style="font-size: 14px; ">____________________ </p>
                                    <p class="ft-11" style="font-size: 14px; ">գտնվելու վայրը__________</p>
                                    <p class="ft-11" style="font-size: 14px; ">հհ __________</p>
                                    <p class="ft-11" style="font-size: 14px; ">____________________ </p>
                                    <p class="ft-11" style="font-size: 14px; ">հվհհ _______________________ </p>
                                </div>
                            </td>
                            <td style="display: flex; width: 50%; justify-content: center;">
                                <div>
                                    <p class="ft-11" style="font-size: 14px; font-weight: 700; ">Պատվիրատու</p>
                                    <p class="ft-11" style="font-size: 14px; ">____________________ </p>
                                    <p class="ft-11" style="font-size: 14px; ">____________________ </p>
                                    <p class="ft-11" style="font-size: 14px; ">գտնվելու վայրը__________</p>
                                    <p class="ft-11" style="font-size: 14px; ">հհ __________</p>
                                    <p class="ft-11" style="font-size: 14px; ">____________________ </p>
                                    <p class="ft-11" style="font-size: 14px; ">հվհհ _______________________ </p>
                                </div>
                            </td>
                        </tr>
                    </tbody>
                </table>
                <div>
                    <h6 style="text-align: center; margin-top: 3rem; ">
                        ԱՐՁԱՆԱԳՐՈՒԹՅՈՒՆ N
                    </h6>
                    <h6 style="text-align: center; ">
                        ՊԱՅՄԱՆԱԳՐԻ ԿԱՄ ԴՐԱ ՄԻ ՄԱՍԻ ԿԱՏԱՐՄԱՆ ԱՐԴՅՈՒՆՔՆԵՐԻ ՀԱՆՁՆՄԱՆ-ԸՆԴՈՒՆՄԱՆ
                    </h6>
                    <p style="text-align: left; ">« &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;     » «  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;        	»  20&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;	թ.</p>
                    <h6 style="text-align: center; ">
                        Պայմանագրի &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;/այսուհետ`&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Պայմանագիր/&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; անվանումը`
                    </h6>
                    <h6 style="text-align: center; ">_____________________________________________________________________________________</h6>
                    <h6 style="text-align: left; ">
                        Պայմանագրի կնքման ամսաթիվը` «____» «__________________» 20 թ.
                    </h6>
                    <h6 style="text-align: left; ">
                        Պատվիրատուն  և  Պայմանագրի կողմը՝  հիմք  ընդունելով  պայմանագրի  կատարման  վերաբերյալ      « &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;      »      «  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;	                »  20&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;     թ. դուրս գրված N ___   հաշիվ ապրանքագիրը, կազմեցին սույն արձանագրությունը հետևյալի մասին.
                    </h6>
                    <h6 style="text-align: left; ">
                        Պայմանագրի շրջանակներում Պայմանագրի կողմը  կատարել է հետևյալ աշխատանքները՝
                    </h6>
                    <table style="font-size: 10px;
                                width: 100%;
                                table-layout: fixed;
                                border-collapse: collapse;
                                page-break-inside: avoid;
                                border: 1px solid black;
                                text-align: center;" cellspacing="5" cellpadding="5">
                                <tbody><tr>
                                    <th rowspan="3" style="border: 1px solid black;
                                                           border-collapse: collapse;">N</th>
                                    <th colspan="8" style="border: 1px solid black;
                                                           border-collapse: collapse;">Կատարված աշխատանքների</th>
                                </tr>
                                <tr>
                                    <th rowspan="2" style="border: 1px solid black;
                                                           border-collapse: collapse;">անվանումը</th>
                                    <th rowspan="2" style="border: 1px solid black;
                                                           border-collapse: collapse;">տեխնիկական բնութագրի համառոտ շարադրանքը</th>
                                    <th colspan="2" style="border: 1px solid black;
                                                           border-collapse: collapse;">քանակական ցուցանիշը
                                    </th>
                                    <th colspan="2" style="border: 1px solid black;
                                                           border-collapse: collapse;">կատարման ժամկետը</th>
                                    <th rowspan="2" style="border: 1px solid black;
                                                           border-collapse: collapse;">Վճարման ենթակա գումարը /հազար դրամ/</th>
                                    <th rowspan="2" style="border: 1px solid black;
                                                           border-collapse: collapse;">Վճարման ժամկետը /ըստ վճարման ժամանակացույցի/</th>
                                </tr>
                                <tr>
                                    <th style="border: 1px solid black;
                                               border-collapse: collapse;">պայմանագրով հաստատված գնման ժամանակացույցի</th>
                                    <th style="border: 1px solid black;
                                               border-collapse: collapse;">փաստացի</th>
                                    <th style="border: 1px solid black;
                                               border-collapse: collapse;"> ըստ պայմանագրով հաստատված գնման ժամանակացույցի</th>
                                    <th style="border: 1px solid black;
                                               border-collapse: collapse;">փաստացի
                                    </th>
                                </tr>
                                <tr>
                                    <td style ="padding: 20px;
                                                border: 1px solid black;
                                                border-collapse: collapse;
                                                text-align: center;"></td>
                                    <td style ="padding: 20px;
                                                border: 1px solid black;
                                                border-collapse: collapse;
                                                text-align: center"></td>
                                    <td style ="padding: 20px;
                                                border: 1px solid black;
                                                border-collapse: collapse;
                                                text-align: center;"></td>
                                    <td style ="padding: 20px;
                                                border: 1px solid black;
                                                border-collapse: collapse;
                                                text-align: center;"></td>
                                    <td style ="padding: 20px;
                                                border: 1px solid black;
                                                border-collapse: collapse;
                                                text-align: center;"></td>
                                    <td style ="padding: 20px;
                                                border: 1px solid black;
                                                border-collapse: collapse;
                                                text-align: center;"></td>
                                    <td style ="padding: 20px;
                                                border: 1px solid black;
                                                border-collapse: collapse;
                                                text-align: center;"></td>
                                    <td style ="padding: 20px;
                                                border: 1px solid black;
                                                border-collapse: collapse;
                                                text-align: center;"></td>
                                    <td style ="padding: 20px;
                                                border: 1px solid black;
                                                border-collapse: collapse;
                                                text-align: center;"></td>
                                </tr>
                                <tr>
                                    <td style ="padding: 20px;
                                                border: 1px solid black;
                                                border-collapse: collapse;
                                                text-align: center;"></td>
                                    <td style ="padding: 20px;
                                                border: 1px solid black;
                                                border-collapse: collapse;
                                                text-align: center;"></td>
                                    <td style ="padding: 20px;
                                                border: 1px solid black;
                                                border-collapse: collapse;
                                                text-align: center;"></td>
                                    <td style ="padding: 20px;
                                                border: 1px solid black;
                                                border-collapse: collapse;
                                                text-align: center;"></td>
                                    <td style ="padding: 20px;
                                                border: 1px solid black;
                                                border-collapse: collapse;
                                                text-align: center;"></td>
                                    <td style ="padding: 20px;
                                                border: 1px solid black;
                                                border-collapse: collapse;
                                                text-align: center;"></td>
                                    <td style ="padding: 20px;
                                                border: 1px solid black;
                                                border-collapse: collapse;
                                                text-align: center;"></td>
                                    <td style ="padding: 20px;
                                                border: 1px solid black;
                                                border-collapse: collapse;
                                                text-align: center;"></td>
                                    <td style ="padding: 20px;
                                                border: 1px solid black;
                                                border-collapse: collapse;
                                                text-align: center;"></td>
                                </tr>
                            </tbody>
                        </table>
                    <h6 style="text-align: left; margin-top: 3rem; ">
                        Սույն արձանագրության երկկողմ հաստատման համար հիմք հանդիսացած հաշիվ ապրանքագիրը և դրական եզրակացությունը հանդիսանում են սույն արձանագրության բաղկացուցիչ մասը և կցվում են:
                    </h6>
                    <div class="col-md-12 d-flex" style="margin-top: 3rem">
                        <table style="width: 100%; border: none !important">
                            <tbody>
                                <tr>
                                    <td style="border:none !important;">
                                        <div style="text-align: center">
                                            <h6 class="ft-11">Աշխատանքը հանձնեց</h6>
                                            <h6>__________________________________</h6>
                                            <h6>ստորագրություն</h6>
                                            <h6>__________________________________</h6>
                                            <h6>ազգանուն, անուն</h6>
                                        </div>
                                    </td>
                                    <td>
                                        <div style="text-align: center;">
                                            <h6 class="ft-11">Աշխատանքը ընդունեց</h6>
                                            <h6>__________________________________</h6>
                                            <h6>ստորագրություն</h6>
                                            <h6>__________________________________</h6>
                                            <h6>ազգանուն, անուն</h6>
                                        </div>
                                    </td>
                                </tr>
                            </tbody>
                        </table>
                    </div>
                </div>
            </div>
            <pagebreak/>
            <br class="page-break"/>
            <div>
                <div style="text-align: right; font-weight: 700; ">Հավելված N 4.1</div>
                <div style="text-align: right; font-weight: 700; "><span class="sign-date">__.__.____</span>թ կնքված</div>
                <div style="text-align: right; font-weight: 700; "><span class="contract-code" style="color: rgb(17, 85, 204);"></span> ծածկագրով գնման պայմանագրի</div>
                <br/>
                <div style="text-align: center; font-weight: 700; ">
                    ԱԿՏ  N
                </div>
                <br/>
                <div>
                    պայմանագրի արդյունքը Պատվիրատուին հանձնելու փաստը ֆիքսելու վերաբերյալ
                </div>
                <h6 style="text-align: left; ">Սույնով արձանագրվում է, որ   -ի (այսուհետ` Պատվիրատու)   և   	        -ի</h6>	
                <p style="font-size: 14px; text-align: left; ">Պատվիրատուի անունը    Կատարողի անունը</p>
                <h6 style="text-align: left; ">
                    (այսուհետ` Կատարող) միջև 20թ. -ին կնքված N 
                </h6>
                <p style="font-size: 14px; text-align: left; ">	պայմանագրի կնքման ամսաթիվը   պայմանագրի համարը
                </p>
                <h6 style="text-align: left; ">
                    գնման պայմանագրի շրջանակներում Կատարողը  20 թ. -ին հանձնման-ընդունման նպատակով			
                </h6>
                <h6 style="text-align: left; ">Պատվիրատուին հանձնեց ստորև նշված աշխատանքները.</h6>
                <table style="width: 100%;
                            table-layout: fixed;
                            border-collapse: collapse;
                            page-break-inside: avoid;
                            border: 1px solid black;
                            text-align: center;" cellspacing="8" cellpadding="8">
                    <tr>
                        <th colspan="3" style="border: 1px solid black;
                                                border-collapse: collapse;">Աշխատանքի</th>
                    </tr>
                    <tr>
                        <th style="border: 1px solid black;
                                    border-collapse: collapse;">անվանումը</th>
                        <th style="border: 1px solid black;
                                    border-collapse: collapse;">չափման միավորը</th>
                        <th style="border: 1px solid black;
                                    border-collapse: collapse;">քանակը (փաստացի)</th>
                    </tr>
                    <tr>
                        <td style ="padding: 20px;
                                    border: 1px solid black;
                                    border-collapse: collapse;
                                    text-align: center;"></td>
                        <td style ="padding: 20px;
                                    border: 1px solid black;
                                    border-collapse: collapse;
                                    text-align: center;"></td>
                        <td style ="padding: 20px;
                                    border: 1px solid black;
                                    border-collapse: collapse;
                                    text-align: center;"></td>
                    </tr>
                    <tr>
                        <td style ="padding: 20px;
                                    border: 1px solid black;
                                    border-collapse: collapse;
                                    text-align: center;"></td>
                        <td style ="padding: 20px;
                                    border: 1px solid black;
                                    border-collapse: collapse;
                                    text-align: center;"></td>
                        <td style ="padding: 20px;
                                    border: 1px solid black;
                                    border-collapse: collapse;
                                    text-align: center;"></td>
                    </tr>
                </table>
                <h6 style="text-align: left; margin-top: 3rem; ">Սույն ակտը կազմված է 2 օրինակից, յուրաքանչյուր կողմին տրամադրվում է մեկական օրինակ:</h6>
                <div class="col-md-12 d-flex" style="margin-top: 3rem">
                        <table style="width: 100%; border: none !important"> 
                            <tbody>
                                <tr>
                                    <td>
                                        <div style="text-align: center;">
                                            <h6 class="ft-11" style="font-weight: 700; ">Հանձնեց</h6>
                                            <h6 style="margin-top: 32px; ">__________________________________</h6>
                                            <h6>ազգանուն, անուն</h6>
                                            <h6>__________________________________</h6>
                                            <h6>ստորագրություն</h6>
                                        </div>
                                    </td>
                                    <td>
                                        <div style="text-align: center;">
                                            <h6 class="ft-11" style="font-weight: 700; "><span style="margin-left: 25px;"/>Ընդունեց <br> հայտը նախագծած ներկայացուցիչ`</h6>
                                            <h6>__________________________________</h6>
                                            <h6>ազգանուն, անուն</h6>
                                            <h6>__________________________________</h6>
                                            <h6>ստորագրություն</h6>
                                        </div>
                                    </td>
                                </tr>
                            </tbody>
                        </table>
                </div>
            </div>
        </div>
        </div>
    </div>
</template>
<script>
import { required } from "vuelidate/lib/validators";
import EditorInput from '@/components/helpers/EditorInput';
import purchaseTypesLongNamesCased from '@/mixins/purchaseTypes'
import $ from 'jquery';

export default {
    name: 'contract_draft_work_construction',
    mixins: [purchaseTypesLongNamesCased],
    components: { EditorInput },
    props: ['handleLoaded', 'handleLoadingStart', 'handleLoadingEnd'],
    data() {
        return {
            total: 0,
            inputs: {
                work: null,
                term: null,
                percents: null,
                days: null,
                work_days: null,
                quantity: null,
                done_works: null,
                done_works_appendix_2: null,
                day: null,
            },
            purchaseType: 1,
            getOrgnizeTypeByPlan: '',
            participants: [],
            participantsSequence: [],
            totalMembers: 0,
        }
    },
    validations() {
        const rules = {
            inputs: {
                work: { required },
                term: { required },
                percents: { required },
                quantity: { required },
                done_works: { required },  
                done_works_appendix_2: { required },   
                day: { required },      
            }
        }
        
        if(this.currentOrganized.organize_type === '1'){
            Object.assign(rules.inputs, {
                work_days: { required },
            })
        }
        return rules;
    },
    mounted() { 
        this.$store.dispatch('organize/getCurrent', this.$route.params.id)
        const locale = 'hy'
        this.purchaseType = this.organizedRows[0].type
        this.getOrgnizeTypeByPlan = this.purchaseTypesLongNamesCased[locale][this.purchaseType || 2]
        this.organizedRows.forEach(item => {
            if(item.is_condition){
                this.total += item.count * item.procurementPlan.details[0].unit_amount
            }
        })
    },
    computed: {
        currentOrganized() {
            return this.$store.getters['organize/currentOrganized']
        },
        organizedRows() {
            return this.$store.getters['organize/organizedRows']
        },
        userChildren() {
            return this.$store.getters['user/userChildren']
        },
        me() {
            return this.$store.getters['user/me']
        },
    },
    watch: {
        currentOrganized: {
            immediate: true,
            async handler() {
                this.handleLoaded()
            },
        },
    },
    methods: {
        save() {
            this.$v.inputs.$touch();
            const _this = this
            let hasInvalid = false;
            $('#commandment-file .editor-input').each(function() {
                const inputName = $(this).attr('inputname');
                const input = _this.$v.inputs[inputName];
                if (input.$error) {
                    hasInvalid = true;
                    if(_this.$refs[inputName]._isVue) {
                        _this.$refs[inputName].$el.focus()
                    } else {
                        _this.$refs[inputName].focus();
                    }
                    return false;
                }
            });
            if (!hasInvalid) {
                this.handleLoadingStart()
                $('.editor-input').each(function() {
                    const txt = $(this).val()
                    $(this).after(txt)
                    $(this).remove()
                });

                $('.editor-option').each(function(index) {
                    const inputNumber = index+1
                    const optionValue = $(`.option-${inputNumber}:checked`).val()
                    const notSelectedOptionValue = +optionValue === 1 ? 2 : 1
                    $(`.option-${inputNumber}-variant-${notSelectedOptionValue}`).remove()
                    $(`.option-${inputNumber}`).remove()
                });
                
                this.$client.put(`organize/${this.currentOrganized.id}`, {contract_html_hy: $('#commandment-file').html()}).then(({ status, data }) => {
                    // eslint-disable-next-line eqeqeq
                    if(status == 200) {
                    this.$store.commit('organize/setCurrentOrganized', data.data)
                        this.$notify({
                            group: 'foo',
                            type: 'success',
                            text: 'Հաջողությամբ թարմացված է'
                        })
                        this.$modal.hide('new-editor-modal')
                    }
                    this.isSaving = false
                    this.handleLoadingEnd()
                }).catch(e => {
                    this.handleLoadingEnd()
                    this.$notify({
                        group: 'foo',
                        type: 'error',
                        title: 'Ինչ որ բան այն չէ',
                        text: 'Կրկին փորձեք!'
                    })
                    this.isSaving = false
                })
            }
        },
        consoleLog(msg) {
            console.log(msg)
        },
    },
}
</script>
<style scoped>
    *{
        color: #303030;
    }
</style>