<template>
        <div style="padding: 30px;">
          <h5 style="font-weight: 700; font-size: 16px; text-align: center">I. Հայտարարագրի լրացման կարգը</h5>
          <div style="margin-top: 20px">
            <p>1. Հայտարարագրի 1-ին բաժնում (Կազմակերպությունը) լրացվում են հայտարարագիր ներկայացնող իրավաբանական անձի (այսուհետ՝ Կազմակերպություն) տվյալները։ Այս բաժնում ենթաբաժինները լրացվում են հետևյալ կանոններով.</p>
            <p style="margin-left: 20px">1) «Կազմակերպության տվյալները» ենթաբաժնում լրացվում են Կազմակերպության անվանումը (այդ թվում՝ լատինատառ) և պետական գրանցման տվյալները՝ ներառյալ նշում կազմակերպաիրավական ձևի մասին.</p>
            <p style="margin-left: 20px">2) «Հայտարարագիրը ներկայացնող անձը» ենթաբաժնում լրացվում է այն ֆիզիկական անձի տվյալները ով ստորագրում է սույն ընթացակարգի հայտում ներառվող փաստաթղթերը.</p>
            <p style="margin-left: 20px">3) «Հայտարարագրի ներկայացումը» ենթաբաժնում լրացվում են հայտարարագրի ստորագրման օրը, ամիսը, տարին, հայտարարագրի էջերի քանակը, ինչպես նաև դրվում է հայտարարագիրը ներկայացնող անձի ստորագրությունը:</p>
          </div>
          <div style="margin-top: 20px">
            <p>2. Հայտարարագրի 2-րդ բաժինը (Բաժնետոմսերի ցուցակման տվյալները) լրացվում է, եթե Կազմակերպության կամ Կազմակերպությունն ամբողջությամբ վերահսկող այլ իրավաբանական անձի բաժնետոմսերը ցուցակված են Հայաստանի Հանրապետության արդարադատության նախարարի կողմից հաստատված՝ իրական շահառուների համարժեք բացահայտման չափանիշներով կարգավորվող շուկաների ցանկում ներառված շուկայում։ Նշված չափանիշներին համապատասխանելու դեպքում այս բաժինը լրացվում է Կազմակերպության կամ Կազմակերպությունն ամբողջությամբ վերահսկող այլ իրավաբանական անձի համար։ Այս բաժինը լրացնելու դեպքում հայտարարագրի հաջորդ բաժինները ենթակա չեն լրացման, բացառությամբ 5-րդ բաժնի, որը լրացվում է, եթե Կազմակերպությունն ամբողջությամբ վերահսկող իրավաբանական անձը Կազմակերպության կանոնադրական կապիտալում ունի անուղղակի մասնակցություն։ Այս բաժնում ենթաբաժինները լրացվում են հետևյալ կանոններով.</p>
            <p style="margin-left: 20px">1) «Բաժնետոմսերի ցուցակման տվյալները» ենթաբաժնում լրացվում է ֆոնդային բորսայի անվանումը՝ փակագծերում նշելով նաև բորսայի ծածկագիրը (Market Identifier Code), որտեղ ցուցակված են Կազմակերպության կամ Կազմակերպությունն ամբողջությամբ վերահսկող այլ իրավաբանական անձի բաժնետոմսերը, ինչպես նաև կատարվում է հղում բորսայում առկա փաստաթղթերին` առկայության դեպքում այն փաստաթղթերին, որոնք պարունակում են տեղեկություններ տվյալ իրավաբանական անձի սեփականատերերի վերաբերյալ.</p>
            <p style="margin-left: 20px">2) «Կազմակերպությունը վերահսկող իրավաբանական անձի տվյալները» ենթաբաժինը լրացվում է, եթե հայտարարագրի 2.1-ին ենթաբաժնում լրացված տվյալները վերաբերում են ոչ թե հայտարարագիրը ներկայացնող իրավաբանական անձին, այլ Կազմակերպությունն ամբողջությամբ վերահսկող այլ իրավաբանական անձի: Այս ենթաբաժնում լրացվում են Կազմակերպությունը վերահսկող իրավաբանական անձի անվանումը (այդ թվում՝ լատինատառ) և գրանցման տվյալները` ներառյալ նշում կազմակերպաիրավական ձևի մասին, ինչպես նաև գործադիր մարմնի ղեկավարի անունը և ազգանունը.</p>
            <p style="margin-left: 20px">3) «Վերահսկողության մակարդակը» ենթաբաժինը լրացվում է, եթե հայտարարագրի 2.1-ին ենթաբաժնում լրացվել են Կազմակերպությունն ամբողջությամբ վերահսկող իրավաբանական անձին վերաբերող տվյալները։ Այս ենթաբաժնում նշվում է Կազմակերպության կանոնադրական կապիտալում Կազմակերպությունը վերահսկող իրավաբանական անձի մասնակցության չափը՝ տոկոսային արտահայտմամբ, ինչպես նաև մասնակցության տեսակը։ Կանոնադրական կապիտալում մասնակցության չափի և տեսակի վերաբերյալ նշումները կատարվում են սույն կարգի 4-րդ կետի 5-րդ ենթակետի «ա» պարբերությամբ սահմանված կանոնների հաշվառմամբ։</p>
          </div>
          <div style="margin-top: 20px">
            <p>3. Հայտարարագրի 3-րդ բաժինը (Պետության, համայնքի կամ միջազգային կազմակերպության մասնակցությունը) լրացվում է, եթե Կազմակերպության կանոնադրական կապիտալում ուղղակի կամ անուղղակի մասնակցություն ունի որևէ պետություն, համայնք կամ միջազգային կազմակերպություն։ Բաժինը կարող է լրացվել մի քանի անգամ, եթե Կազմակերպության կանոնադրական կապիտալում ուղղակի կամ անուղղակի մասնակցություն ունեն մի քանի պետություն, համայնք կամ միջազգային կազմակերպություն։ Այս բաժնում ենթաբաժինները լրացվում են հետևյալ կանոններով.</p>
            <p style="margin-left: 20px">1) «Պետության կամ համայնքի մասնակցությունը» ենթաբաժինը լրացվում է, եթե հայտարարագիրը ներկայացնող իրավաբանական անձի կանոնադրական կապիտալում առկա է պետության կամ համայնքի ուղղակի կամ անուղղակի մասնակցություն: Պետության մասնակցության դեպքում այս ենթաբաժնում լրացվում է պետության, իսկ համայնքի մասնակցության դեպքում՝ նաև համայնքի անվանումը։ Այս ենթաբաժնում լրացվում են նաև իրավաբանական անձի կանոնադրական կապիտալում պետության կամ համայնքի մասնակցության չափը՝ տոկոսային արտահայտմամբ, ինչպես նաև մասնակցության տեսակը։ Կանոնադրական կապիտալում մասնակցության չափի և տեսակի վերաբերյալ նշումները կատարվում են սույն կարգի 4-րդ կետի 5-րդ ենթակետի «ա» պարբերությամբ սահմանված կանոնների հաշվառմամբ.</p>
            <p style="margin-left: 20px">2) «Միջազգային կազմակերպության մասնակցությունը» ենթաբաժինը լրացվում է, եթե հայտարարագիրը ներկայացնող իրավաբանական անձի կանոնադրական կապիտալում առկա է միջազգային կազմակերպության ուղղակի կամ անուղղակի մասնակցություն: Այս ենթաբաժնում լրացվում են միջազգային կազմակերպության անվանումը (այդ թվում՝ լատինատառ), իրավաբանական անձի կանոնադրական կապիտալում միջազգային կազմակերպության մասնակցության չափը՝ տոկոսային արտահայտմամբ, ինչպես նաև մասնակցության տեսակը։ Կանոնադրական կապիտալում մասնակցության չափի և տեսակի վերաբերյալ նշումները կատարվում են սույն կարգի 4-րդ կետի 5-րդ ենթակետի «ա» պարբերությամբ սահմանված կանոնների հաշվառմամբ։</p>
          </div>
          <div style="margin-top: 20px">
            <p>4. Հայտարարագրի 4-րդ բաժինը (Իրական շահառուի տվյալները) լրացվում է յուրաքանչյուր իրական շահառուի համար առանձին՝ Կազմակերպության իրական շահառուների քանակով։ Այս բաժնում ենթաբաժինները լրացվում են հետևյալ կանոններով.</p>
            <p style="margin-left: 20px">1) «Անձի ինքնությունը հավաստող տվյալները» ենթաբաժնում լրացվում են իրական շահառուի անձնական տվյալները։ Տվյալները լրացվում են այնպես, ինչպես դրանք լրացված են իրական շահառուի անձը հաստատող փաստաթղթում։ Եթե անձի անունը և ազգանունը հայերեն կամ լատինատառ առկա չեն վերջինիս անձը հաստատող փաստաթղթում, ապա հայտարարագրում լրացվում է դրանց տառադարձությունը.</p>
            <p style="margin-left: 20px">2) «Անձը հաստատող փաստաթուղթը» ենթաբաժնում լրացվում են տեղեկությունների իրական շահառուի անձը հաստատող փաստաթղթի վերաբերյալ.</p>
            <p style="margin-left: 20px">3) «Անձի հաշվառման հասցեն» ենթաբաժնում լրացվում է իրական շահառուի հաշվառման վայրի հասցեն.</p>
            <p style="margin-left: 20px">4) «Անձի բնակության հասցեն» ենթաբաժինը լրացվում է, եթե իրական շահառուի հաշվառման հասցեն տարբերվում է վերջինիս բնակության հասցեից։ Այս ենթաբաժնում լրացվում է իրական շահառուի բնակության վայրի հասցեն.</p>
            <p style="margin-left: 20px">5) «Իրական շահառու հանդիսանալու հիմքերը (բացառությամբ ընդերքօգտագործման ոլորտի հաշվետու կազմակերպությունների)» ենթաբաժինը լրացվում է, եթե հայտարարագիրը ներկայացնող իրավաբանական անձը չի հանդիսանում ընդերքօգտագործման ոլորտի հաշվետու կազմակերպություն: Այս ենթաբաժնում նշվում է, թե «Փողերի լվացման և ահաբեկչության ֆինանսավորման դեմ պայքարի» մասին օրենքով նախատեսված որ հիմք(եր)ով է անձը հանդիսանում Կազմակերպության իրական շահառու, և ներառվում են այդ հիմքերի առնչությամբ պահանջվող տեղեկությունները։ Մեկից ավելի հիմքերով իրական շահառու հանդիսանալու դեպքում նշում է կատարվում բոլոր հիմքերի մասով՝ համապատասխան կետերում։ Այս ենթաբաժնում հիմքերի վերաբերյալ տվյալները լրացվում են հետևյալ կանոններով.</p>
            <p style="margin-left: 40px">ա. այս ենթաբաժնի «ա» կետում կատարվում է նշում, եթե ֆիզիկական անձը ուղղակի կամ անուղղակի տիրապետում է Կազմակերպության՝ ձայնի իրավունք տվող բաժնեմասերի (բաժնետոմսերի, փայերի) 20 և ավելի տոկոսին կամ ուղղակի կամ անուղղակի կերպով ունի 20 և ավելի տոկոս մասնակցություն Կազմակերպության կանոնադրական կապիտալում։ Մասնակցությունը կարող է լինել Կազմակերպության բաժնեմասը (բաժնետոմսը, փայը) սեփականության իրավունքով տիրապետելու ուժով (ուղղակի մասնակցություն) կամ Կազմակերպության բաժնեմասին (բաժնետոմսին, փային) տիրապետող այլ իրավաբանական անձի բաժնեմասը (բաժնետոմսը, փայը) սեփականության իրավունքով տիրապետելու ուժով (անուղղակի մասնակցություն)։ Անուղղակի մասնակցությունը կարող է իրականացվել անկախ ֆիզիկական անձի և Կազմակերպության բաժնեմասը (բաժնետոմսը, փայը) տիրապետող իրավաբանական անձի շղթայում առկա միջանկյալ իրավաբանական անձանց քանակից։ «Մասնակցության չափը» դաշտում նշվում է Կազմակերպության կանոնադրական կապիտալում մասնակցության չափը՝ տոկոսային արտահայտմամբ։ Մասնակցության չափը հաշվարկվում է՝ հիմք ընդունելով իրական շահառուի ուղղակի և անուղղակի մասնակցության արդյունքում Կազմակերպության կանոնադրական կապիտալում մասնակցության բոլոր տոկոսների հանրագումարը։ Անուղղակի մասնակցության դեպքում, կազմակերպության կանոնադրական կապիտալում իրական շահառուի մասնակցությունը հաշվարկվում է՝ հիմք ընդունելով յուրաքանչյուր նախորդ միջանկյալ կազմակերպության մասնակցության չափը, այն է՝ Կազմակերպության մասնակից իրավաբանական անձի՝ տոկոսային արտահայտմամբ մասնակցության չափը բազմապատկելով Կազմակերպության մասնակից իրավաբանական անձի կանոնադրական կապիտալում համապատասխան մասնակցի՝ տոկոսային արտահայտմամբ մասնակցության չափով, և այդպես շարունակ մինչև իրական շահառուին հասնելը։ «Մասնակցության տեսակը» դաշտում կատարվում է նշում կանոնադրական կապիտալում մասնակցության ուղղակի կամ անուղղակի լինելու մասին։ Կանոնադրական կապիտալում և՛ ուղղակի, և՛ անուղղակի մասնակցության առկայության դեպքում նշում է կատարվում միաժամանակ և՛ ուղղակի, և՛ անուղղակի մասնակցության առկայության վերաբերյալ.</p>
            <p style="margin-left: 40px">բ. այս ենթաբաժնի «բ» կետում կատարվում է նշում, եթե անձն «ա» կետի իմաստով չի հանդիսանում կազմակերպության իրական շահառու, սակայն վերահսկում է Կազմակերպությունը՝ իրավական գործիքների (այդ թվում՝ կնքված գործարքների) ուժով, այլ բնույթի անձնական ազդեցության հիման վրա կամ այլ միջոցներով.</p>
            <p style="margin-left: 40px">գ. այս ենթաբաժնի «գ» կետում կատարվում է նշում, եթե անձը հանդիսանում է Կազմակերպության գործունեության ընդհանուր կամ ընթացիկ ղեկավարումն իրականացնող պաշտոնատար անձ այն դեպքում, երբ առկա չէ այս ենթաբաժնի «ա» և «բ» կետերի պահանջներին համապատասխանող ֆիզիկական անձ</p>
            <p style="margin-left: 20px">6) «Իրական շահառու հանդիսանալու հիմքերը (ընդերքօգտագործման ոլորտի հաշվետու կազմակերպությունների համար)» ենթաբաժինը լրացվում է, եթե հայտարարագիրը ներկայացնող իրավաբանական անձը հանդիսանում է ընդերքօգտագործման ոլորտի հաշվետու կազմակերպություն։ Իրական շահառուների բացահայտումն իրականացվում է Ընդերքի մասին օրենսգրքով սահմանված չափանիշներով: Այս ենթաբաժնում նշումները կատարվում են սույն կարգի 4.5-րդ կետում սահմանված կանոնների հաշվառմամբ։ Այս ենթաբաժնում հիմքերի վերաբերյալ տվյալները լրացվում են հետևյալ կանոններով.</p>
            <p style="margin-left: 40px">ա. այս ենթաբաժնի «ա» կետում կատարվում է նշում, եթե ֆիզիկական անձը ուղղակի կամ անուղղակի կերպով տիրապետում է տվյալ իրավաբանական անձի` ձայնի իրավունք տվող բաժնեմասերի (բաժնետոմսերի, փայերի) 10 և ավելի տոկոսին կամ ուղղակի կամ անուղղակի կերպով ունի 10 և ավելի տոկոս մասնակցություն իրավաբանական անձի կանոնադրական կապիտալում։ Այս ենթաբաժինը լրացվում է սույն կարգի 4-րդ կետի 5-րդ ենթակետի «ա» պարբերությամբ սահմանված կանոնների հաշվառմամբ.</p>
            <p style="margin-left: 40px">բ. այս ենթաբաժնի «բ» կետում կատարվում է նշում, եթե անձն իրավունք ունի նշանակելու կամ հեռացնելու իրավաբանական անձի կառավարման մարմինների անդամների մեծամասնությանը.</p>
            <p style="margin-left: 40px">գ. այս ենթաբաժնի «գ» կետում կատարվում է նշում, եթե անձը Կազմակերպությունից անհատույց ստացել է հաշվետու տարվան նախորդող տարվա ընթացքում տվյալ իրավաբանական անձի ստացած շահույթի առնվազն 15 տոկոսի չափով օգուտ.</p>
            <p style="margin-left: 40px">դ. այս ենթաբաժնի «դ» կետում կատարվում է նշում, եթե անձն «ա»-«գ» կետերի իմաստով չի հանդիսանում Կազմակերպության իրական շահառու, սակայն վերահսկում է կազմակերպությունը՝ իրավական գործիքների (այդ թվում՝ կնքված գործարքների) ուժով, այլ բնույթի անձնական ազդեցության հիման վրա կամ այլ միջոցներով.</p>
            <p style="margin-left: 40px">ե. այս ենթաբաժնի «ե» կետում կատարվում է նշում, եթե անձը հանդիսանում է Կազմակերպության գործունեության ընդհանուր կամ ընթացիկ ղեկավարումն իրականացնող պաշտոնատար անձ այն դեպքում, երբ առկա չէ այս ենթաբաժնի «ա»-«դ» կետերի պահանջներին համապատասխանող ֆիզիկական անձ.</p>
            <p style="margin-left: 20px">7) «Իրական շահառուի կարգավիճակի վերաբերյալ տեղեկությունները» ենթաբաժնում լրացվում են անձի՝ Կազմակերպության իրական շահառու դառնալու օրը, ամիսը, տարին։ Այս ենթաբաժնում կատարվում է նշում իրական շահառուի կողմից Կազմակերպության նկատմամբ վերահսկողության իրականացման ձևի վերաբերյալ։ Փոխկապակցված անձանց հետ համատեղ վերահսկողության իրականացման վերաբերյալ կատարվում է նշում, եթե իրական շահառուն Կազմակերպությունը վերահսկում է իր հետ փոխկապակցված անձի հետ համաձայնեցված գործելու ուժով կամ կարող է այն վերահսկել իր հետ փոխկապակցված անձի հետ համաձայնեցված գործելու դեպքում։ Եթե հայտարարագիրը ներկայացնող իրավաբանական անձը հանդիսանում է ընդերքօգտագործման ոլորտի հաշվետու կազմակերպություն, այս ենթաբաժնում նաև կատարվում է նշում իրական շահառուի՝ Ընդերքի մասին օրենսգրքի 3-րդ հոդվածի 1-ին մասի 53-րդ կետի իմաստով պաշտոնատար անձ կամ նրա ընտանիքի անդամ հանդիսանալու վերաբերյալ.</p>
            <p style="margin-left: 20px">8) «Իրական շահառուի կոնտակտային տվյալները» ենթաբաժնում լրացվում են իրական շահառուի էլեկտրոնային փոստի հասցեն և հեռախոսահամարը:</p>
          </div>
          <div style="margin-top: 20px">
            <p>5. Հայտարարագրի 5-րդ բաժինը (Միջանկյալ իրավաբանական անձինք) լրացվում է, եթե հայտարարագիրը ներկայացնող իրավաբանական անձի իրական շահառուն կամ Կազմակերպությունն ամբողջությամբ վերահսկող իրավաբանական անձն ունի անուղղակի մասնակցություն Կազմակերպության կանոնադրական կապիտալում։ Այս բաժինը ենթակա է լրացման յուրաքանչյուր միջանկյալ իրավաբանական անձի համար առանձին՝ բոլոր միջանկյալ իրավաբանական անձանց քանակով։ Այս բաժնում ենթաբաժինները լրացվում են հետևյալ կանոններով.</p>
            <p style="margin-left: 20px">1) «Կազմակերպության տվյալները» ենթաբաժնում լրացվում են միջանկյալ իրավաբանական անձի անվանումը (այդ թվում՝ լատինատառ) և գրանցման տվյալները` ներառյալ նշում կազմակերպաիրավական ձևի մասին.</p>
            <p style="margin-left: 20px">2) «Իրական շահառուի տվյալները» ենթաբաժնում լրացվում են այն իրական շահառու(ներ)ի անունը և ազգանունը, ում համար այս ենթաբաժնում լրացված կազմակերպությունը հանդիսանում է միջանկյալ իրավաբանական անձ: Եթե միջանկյալ իրավաբանական անձանց տվյալները լրացվում են Կազմակերպությունն ամբողջությամբ վերահսկող իրավաբանական անձի համար, այս ենթաբաժինը ենթակա չէ լրացման։</p>
            <p style="margin-left: 20px">3) «Միջանկյալ իրավաբանական անձի բաժնետոմսերի ցուցակման տվյալները» ենթաբաժինը ենթակա չէ պարտադիր լրացման։ Այս ենթաբաժինը կարող է լրացվել, եթե միջանկյալ իրավաբանական անձի բաժնետոմսերը ցուցակված են կարգավորվող շուկայում։ Այս ենթաբաժնում լրացվում է ֆոնդային բորսայի անվանումը՝ փակագծերում նշելով նաև բորսայի ծածկագիրը (Market Identifier Code), որտեղ ցուցակված են իրավաբանական անձի բաժնետոմսերը, ինչպես նաև կատարվում է հղում բորսայում առկա փաստաթղթերին։</p>        
          </div>
          <div style="margin-top: 20px">
            <p>6. Հայտարարագրի 6-րդ բաժինը (Լրացուցիչ նշումներ) լրացվում է, եթե առկա են լրացուցիչ տեղեկություններ կամ հավելյալ պարզաբանումներ, որոնք առնչվում են հայտարարագրում լրացված կամ լրացման ենթակա տվյալներին։ Այս ենթաբաժնում կարող են լրացվել հավելյալ պարզաբանումներ իրական շահառուի կողմից Կազմակերպությունը վերահսկելու հիմքերի վերաբերյալ, պետության (համայնքի) այն մարմինների վերաբերյալ, որոնք իրականացնում են Կազմակերպության վերահսկողությունն այն դեպքում, եթե հայտարարագիրը ներկայացնող իրավաբանական անձի կանոնադրական կապիտալում առկա է պետության կամ համայնքի ուղղակի կամ անուղղակի մասնակցություն, և այլ պարազաբանումներ հայտարարագրի առնչությամբ։</p>      
          </div>
          <div style="margin-top: 20px">
            <p>7. Հայտարարագիրը լրացնում և ստորագրում է հայտը ներկայացնող անձը։ Հայտարարագրի էջերի համարակալումը և հայտարարագրում էջերի քանակի մասին նշում կատարելը պարտադիր չէ։</p>      
          </div>
        </div> 
</template>

<script>
import purchaseTypes from '@/mixins/purchaseTypes'

export default {
    name: 'procedure_for_filling_out_the_declaration',
    mixins: [purchaseTypes],
    components: {},
    props: ['handleLoaded', 'tender'],
    data() {
        return {
            participantInfo: {},
            participantsSequence: [],
            rows: [],
            beneficiaries: [],
            totalMembers: 0,
            isWithArmenianResources: false,
			isLoaded: false,
        }
    },
    async mounted() {
      this.participantMainInfo = this.me.organisation[0]
      this.participantInfo = this.me.organisation[0].translations
      this.isWithArmenianResources = this.tenderData.isWithArmenianResources
      this.rows = this.tenderData.selectedRows
      this.beneficiaries = this.tenderData.realBeneficiaries
      this.workersCount = this.tenderData.workersCount
      this.tenderData = this.tenderData.tender
          
      await this.rows.forEach(async (row, index) => {
        if(index === this.rows.length-1){
          this.isLoaded = true;
          await this.handleLoaded()
        }
      })
    },
    computed: {
        me() {
            return this.$store.getters['user/me']
        },
    },
    methods: {
        save() {
            alert()
        },
        consoleLog(msg) {
            console.log(msg)
        },
        fixIncorrectWords(word) {
          return word.replace('միլիօն', 'միլիոն').replace('ստորակել', 'ամբողջ')
        },
        getTenderTypeByPlan(){
          return this.purchaseTypesLongNamesCased.hy[this.tenderData.procedure.id];
        },
    },
}
</script>

<style scoped>
  *{
    font-family: GHEA grapalat  !important;
  }
</style>


